{
  "version": "1.0",
  "truncation": {
    "max_length": 150,
    "strategy": "OnlyFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 150
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2001,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 1182,
      "special": false,
      "content": "<start>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 1183,
      "special": false,
      "content": "<end>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFKC"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "model": {
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "#": 0,
      "%": 1,
      "(": 2,
      ")": 3,
      "*": 4,
      "+": 5,
      "-": 6,
      "/": 7,
      "0": 8,
      "1": 9,
      "2": 10,
      "3": 11,
      "4": 12,
      "5": 13,
      "6": 14,
      "7": 15,
      "8": 16,
      "9": 17,
      "=": 18,
      "@": 19,
      "A": 20,
      "B": 21,
      "C": 22,
      "F": 23,
      "G": 24,
      "H": 25,
      "I": 26,
      "M": 27,
      "N": 28,
      "O": 29,
      "P": 30,
      "S": 31,
      "T": 32,
      "W": 33,
      "X": 34,
      "Y": 35,
      "Z": 36,
      "[": 37,
      "\\": 38,
      "]": 39,
      "b": 40,
      "c": 41,
      "e": 42,
      "g": 43,
      "i": 44,
      "l": 45,
      "n": 46,
      "o": 47,
      "p": 48,
      "r": 49,
      "s": 50,
      "t": 51,
      "u": 52,
      "Ċ": 53,
      "cc": 54,
      "CC": 55,
      "(=": 56,
      "ccc": 57,
      "CCC": 58,
      "Cc": 59,
      "+]": 60,
      "ccccc": 61,
      "NC": 62,
      "OC": 63,
      "NH": 64,
      "nc": 65,
      "CCCC": 66,
      ")(": 67,
      "Cl": 68,
      "cccc": 69,
      "Oc": 70,
      "Nc": 71,
      ")[": 72,
      "-]": 73,
      "-])": 74,
      "OCC": 75,
      "COc": 76,
      ")(=": 77,
      "nH": 78,
      "([": 79,
      ")=": 80,
      "CCN": 81,
      "Br": 82,
      "CN": 83,
      "+](": 84,
      "cn": 85,
      "CCCCC": 86,
      "CCc": 87,
      "COC": 88,
      "CO": 89,
      "12": 90,
      "+])": 91,
      "sc": 92,
      "nn": 93,
      "NCC": 94,
      "ncc": 95,
      "CS": 96,
      "CCOC": 97,
      "21": 98,
      "+](=": 99,
      "CNC": 100,
      "oc": 101,
      "cnc": 102,
      "NCc": 103,
      "CCCCCCCC": 104,
      "nnc": 105,
      "CCOCC": 106,
      "OCc": 107,
      "Cn": 108,
      "CCOc": 109,
      "CCCN": 110,
      "COCC": 111,
      "23": 112,
      "cccnc": 113,
      "CCNC": 114,
      "SC": 115,
      "32": 116,
      "CCO": 117,
      "CSc": 118,
      "NN": 119,
      "ccnc": 120,
      "CCS": 121,
      "](": 122,
      "NS": 123,
      "cccs": 124,
      "CCn": 125,
      "CCCCCC": 126,
      "CCCc": 127,
      "CNc": 128,
      "Si": 129,
      "ccn": 130,
      "cnn": 131,
      "ccccn": 132,
      "+]=": 133,
      "Sc": 134,
      "ccco": 135,
      "CCCO": 136,
      "csc": 137,
      ")=[": 138,
      "cs": 139,
      "NCCC": 140,
      "ncnc": 141,
      "ccncc": 142,
      "SCC": 143,
      "no": 144,
      "NNC": 145,
      "noc": 146,
      "NCCc": 147,
      "=[": 148,
      "OCCC": 149,
      "nccc": 150,
      "ncn": 151,
      "OCO": 152,
      "CCCNC": 153,
      "cncc": 154,
      ")([": 155,
      "(-": 156,
      "OCCO": 157,
      "ncccc": 158,
      "ccsc": 159,
      "34": 160,
      "43": 161,
      "CCCOc": 162,
      "CCCCCCC": 163,
      "SCc": 164,
      "CCl": 165,
      "CCNc": 166,
      "CSC": 167,
      "CCCCN": 168,
      "cccn": 169,
      "*]": 170,
      "NO": 171,
      "sccc": 172,
      "CCCn": 173,
      "(=[": 174,
      "+]([": 175,
      "CCCCCCCCCCCCCCCC": 176,
      "CCCOC": 177,
      "COCc": 178,
      "OCCCC": 179,
      "CCCCCCCCC": 180,
      "Fc": 181,
      "nccn": 182,
      "CCCS": 183,
      "OCCOCC": 184,
      "CCCCc": 185,
      "CCSC": 186,
      "13": 187,
      "on": 188,
      "CBr": 189,
      "CCCCO": 190,
      "[*]": 191,
      "CNS": 192,
      "-])[": 193,
      "Clc": 194,
      "COP": 195,
      "CCCNc": 196,
      "coc": 197,
      "NCCCC": 198,
      "nccs": 199,
      "ccoc": 200,
      "CSCC": 201,
      "cncn": 202,
      ")-": 203,
      "nnn": 204,
      "54": 205,
      "FC": 206,
      "COCCC": 207,
      "COCCN": 208,
      "CCCCOc": 209,
      "cnccc": 210,
      "OS": 211,
      "CCSc": 212,
      "CCCCNC": 213,
      "nnnn": 214,
      "CCSCC": 215,
      "ccnn": 216,
      "OP": 217,
      "-])=": 218,
      "NOC": 219,
      "NNc": 220,
      "scc": 221,
      "ON": 222,
      "ncccn": 223,
      "31": 224,
      "NCCN": 225,
      "CCCCCCCCCC": 226,
      "cnnc": 227,
      "CCCl": 228,
      "CCCCCCCCCCCC": 229,
      "45": 230,
      "@@": 231,
      "nccnc": 232,
      "onc": 233,
      "OCCOC": 234,
      "OCCc": 235,
      "+])(": 236,
      "cnccn": 237,
      "occc": 238,
      "OCCCO": 239,
      "CCCCCCCCCCC": 240,
      "CCNS": 241,
      "*])": 242,
      "nnnc": 243,
      "10": 244,
      "Nn": 245,
      "CSCCC": 246,
      "CCCCOC": 247,
      "NCCNC": 248,
      "OCCN": 249,
      "OCCNC": 250,
      "Brc": 251,
      "OO": 252,
      "nsc": 253,
      "-])(": 254,
      "NCCOc": 255,
      "ncnn": 256,
      "CSCc": 257,
      "NCCCCC": 258,
      "nncn": 259,
      "cnnn": 260,
      "CON": 261,
      "+]=[": 262,
      "OCCOc": 263,
      "CCCCCN": 264,
      "co": 265,
      "CCCCn": 266,
      "CCCCS": 267,
      "COCCNC": 268,
      "CF": 269,
      "ns": 270,
      "cncnc": 271,
      "NCCn": 272,
      "65": 273,
      "OCOC": 274,
      "COCCn": 275,
      "][": 276,
      "CNCC": 277,
      "NCCCc": 278,
      "cscn": 279,
      "ncsc": 280,
      "CCCCCc": 281,
      "SCCC": 282,
      "([*])": 283,
      "#[": 284,
      "NCCO": 285,
      "NCCS": 286,
      "CCCCCCCCCCCCC": 287,
      "CCCOCC": 288,
      "CCCCCNC": 289,
      "nonc": 290,
      "NCCCN": 291,
      "CCCCCCCCCCCCCCC": 292,
      "CCCCCCCCCCCCCCCCCC": 293,
      "[*])": 294,
      "11": 295,
      "CCOP": 296,
      "-]#[": 297,
      "NOCC": 298,
      "CCCSc": 299,
      "OB": 300,
      "24": 301,
      "COCCCNC": 302,
      "OCCn": 303,
      "CCCCCOc": 304,
      "nncc": 305,
      "CCCCCCCCCCCCCC": 306,
      "COCCOc": 307,
      "NCCCn": 308,
      "scnc": 309,
      "COCCOC": 310,
      "CCOCc": 311,
      "CCCCCCc": 312,
      "CH": 313,
      "CCCCCCCCCCCCCCCCC": 314,
      "56": 315,
      "CCCCCCOc": 316,
      "ccon": 317,
      "CCBr": 318,
      "42": 319,
      "Se": 320,
      "OCCCCC": 321,
      "NCCOC": 322,
      "CCNCC": 323,
      "COCCO": 324,
      "ccncn": 325,
      "NOCc": 326,
      "CI": 327,
      "sccn": 328,
      "-]=[": 329,
      "COS": 330,
      "occ": 331,
      "cscc": 332,
      "ncncc": 333,
      "ClC": 334,
      "COCCCC": 335,
      "14": 336,
      "CCCSC": 337,
      "SiH": 338,
      "CP": 339,
      "COCCCN": 340,
      "OCCCc": 341,
      "nnsc": 342,
      "NCCNc": 343,
      "NP": 344,
      "snc": 345,
      "CCCCCOC": 346,
      "CCCNS": 347,
      "nsnc": 348,
      "76": 349,
      "OCCCCCC": 350,
      "cccnn": 351,
      ")[*])": 352,
      "OCCCNC": 353,
      "OCCOCCOCCOCC": 354,
      "NCCCCCC": 355,
      "CNN": 356,
      "CCCCOCC": 357,
      "COCCc": 358,
      "OCCCN": 359,
      "+])=": 360,
      "snnc": 361,
      "OCCS": 362,
      "CCON": 363,
      "35": 364,
      "NNCC": 365,
      "CCCCCO": 366,
      "cncs": 367,
      "OOC": 368,
      "CCCCl": 369,
      "CCOCCCNC": 370,
      "NCCCOC": 371,
      "CCCCCCCCCCCCCCCCCCC": 372,
      "OOO": 373,
      "CCF": 374,
      "NCCCNC": 375,
      "CCCCNc": 376,
      "nncs": 377,
      "67": 378,
      "OCCCCCCCC": 379,
      "ncoc": 380,
      "CCOCCC": 381,
      "NCCCO": 382,
      "CCP": 383,
      "COCOc": 384,
      "CCCCCCCCCCCCCCCCCCCCC": 385,
      "CCCCCCNC": 386,
      "Sn": 387,
      "CCCCCCN": 388,
      "CNNC": 389,
      "COCOC": 390,
      "OCCCOc": 391,
      "On": 392,
      "cnoc": 393,
      "NCCOCC": 394,
      "NCCNS": 395,
      "ncco": 396,
      "ocnc": 397,
      "COCCNc": 398,
      "COCCOCC": 399,
      "ccno": 400,
      "])": 401,
      "csnn": 402,
      "SCCS": 403,
      "+])[": 404,
      "NCCSCc": 405,
      "cnco": 406,
      "NNS": 407,
      "ClCc": 408,
      "-])([": 409,
      "CCCCCn": 410,
      "NCCSc": 411,
      "NCCCOCC": 412,
      "SS": 413,
      "SCCN": 414,
      "SOOO": 415,
      "sn": 416,
      "CCCBr": 417,
      "CCCCCCOC": 418,
      "CCCCCCCOc": 419,
      "CSCCN": 420,
      "CCCCCCCCc": 421,
      "OCCCOC": 422,
      "OCCOCCO": 423,
      "CCCCCNc": 424,
      "NCCCOc": 425,
      "OCCOCCOC": 426,
      "64": 427,
      "CB": 428,
      "NCCCCc": 429,
      "ncon": 430,
      "OCCNc": 431,
      "CCOCCN": 432,
      "OCCCn": 433,
      "87": 434,
      "oncc": 435,
      "CCCCSc": 436,
      "CCOCCOc": 437,
      "CCSCCC": 438,
      "41": 439,
      "78": 440,
      "OCCCCCCCCCC": 441,
      "OCCCCCCCCCCC": 442,
      "CCOCCO": 443,
      "ONC": 444,
      "CCCCCCn": 445,
      "CCCCCCCc": 446,
      "OCCCCCCCCCCCC": 447,
      "SCCCS": 448,
      "]([": 449,
      "ccnnc": 450,
      "CONC": 451,
      "NCCSC": 452,
      "CCCCCCCCOC": 453,
      "As": 454,
      "Bc": 455,
      "CCCOCc": 456,
      "OCn": 457,
      "OCCF": 458,
      "CCCCCCCCN": 459,
      "CCOCCOC": 460,
      "CCOS": 461,
      "SCCCC": 462,
      "SCCCCCC": 463,
      "CCCSCC": 464,
      "CCCCCCCN": 465,
      "OCCSc": 466,
      "CNCc": 467,
      "COCO": 468,
      "NCCOCCOCC": 469,
      "CSSCC": 470,
      "CCCCCCCCCCCCCCCCCCCC": 471,
      "SCCc": 472,
      "SCCOc": 473,
      "OCN": 474,
      "CCCCSC": 475,
      "-][": 476,
      "CCCCCl": 477,
      "CSCN": 478,
      "CCCCCCCCOc": 479,
      "CCCCCCCCCCOC": 480,
      "CCOCCn": 481,
      "15": 482,
      "SN": 483,
      "NCN": 484,
      "OCOc": 485,
      "ClCC": 486,
      "CSCCNC": 487,
      "CCCCCCCCCCOc": 488,
      "CCOCCOCCOCC": 489,
      "53": 490,
      "Ic": 491,
      "COCCCn": 492,
      "CSCCS": 493,
      "CCCCCCCCCCCCOc": 494,
      "CCONC": 495,
      "CCSCc": 496,
      "NCCCNc": 497,
      ")/": 498,
      "BC": 499,
      "OCCCCCCCCCCCCCCCC": 500,
      "CCCCCCO": 501,
      "BrC": 502,
      "nnccc": 503,
      "CSCCO": 504,
      "nnco": 505,
      "CCCOCCC": 506,
      "NCCCSc": 507,
      "OCCCS": 508,
      "OCCCl": 509,
      "ncns": 510,
      "CCCCCCCCCOC": 511,
      "OCCOCCOCCOC": 512,
      "OCCCCCCC": 513,
      "+]#": 514,
      "-](": 515,
      "COO": 516,
      "NCCOCCO": 517,
      "CCCCCCCCCCc": 518,
      "nocc": 519,
      "OCCCNc": 520,
      "314": 521,
      "@@]": 522,
      "NCCCCCO": 523,
      "@]": 524,
      "SCCNC": 525,
      "se": 526,
      "CCCF": 527,
      "ncno": 528,
      "CCCCNS": 529,
      ")[*]": 530,
      "CCNN": 531,
      "COCCCc": 532,
      "COCCCOc": 533,
      "CCOCn": 534,
      "CCOCCCN": 535,
      "NCCCS": 536,
      "16": 537,
      "17": 538,
      "Al": 539,
      "Ge": 540,
      "NCCCCCCCC": 541,
      "SCCO": 542,
      "Te": 543,
      "CCCCBr": 544,
      "OCCBr": 545,
      "BrCc": 546,
      "CCCCCCCCCCCc": 547,
      "CCCCCCCCCCCCc": 548,
      "COCCS": 549,
      "COCCOCCOCC": 550,
      "CCOCCCC": 551,
      "NCCCl": 552,
      "CCCCCCCn": 553,
      "OCCCCOC": 554,
      "25": 555,
      "NCCCCCCC": 556,
      "NCCCCN": 557,
      "])(": 558,
      "conc": 559,
      "CCCCCCCNC": 560,
      "CCCCOCCOCC": 561,
      "COCn": 562,
      "COCCCNc": 563,
      "CCCCCCCCCCCOC": 564,
      "CCOCCNc": 565,
      "COCCCCC": 566,
      "cnns": 567,
      "CCCCCCCCCCCCCCCCCCCCCC": 568,
      "OCCCCOc": 569,
      "OCCCCCCOc": 570,
      "CCCCCCCCCCCCOC": 571,
      "(#": 572,
      "18": 573,
      "46": 574,
      "NCCCCO": 575,
      "PC": 576,
      "SCCCN": 577,
      "CCNCc": 578,
      "COn": 579,
      "CSCCCC": 580,
      "COCCOCCC": 581,
      "COCCOCCCC": 582,
      "NSc": 583,
      "CCCCCCNc": 584,
      "SCCSC": 585,
      "CCCCCCCCCCCCCCCCOc": 586,
      "OCCCCO": 587,
      "OCCCCn": 588,
      "OCCCCCCOC": 589,
      "NCCCCCCN": 590,
      "cocc": 591,
      "SSC": 592,
      "](=": 593,
      "NCl": 594,
      "OCl": 595,
      "OCCSC": 596,
      "OCCSCC": 597,
      "cnsc": 598,
      "CCCCCS": 599,
      "CCCCCNS": 600,
      "CCCCCSc": 601,
      "COB": 602,
      "CSSC": 603,
      "CCCCCCCCn": 604,
      "CCCON": 605,
      "CCCCCCCCCCCCCCCCCCCCCCC": 606,
      "CCCCCCCCCc": 607,
      "CCCCOP": 608,
      "NCCCCn": 609,
      "NCCCCCCNC": 610,
      "NCCCCCc": 611,
      "(/": 612,
      "IH": 613,
      "NOc": 614,
      "NOCCC": 615,
      "OOc": 616,
      "SSc": 617,
      "CCCP": 618,
      "CCCOCCOc": 619,
      "+][": 620,
      "+]#[": 621,
      "OCNC": 622,
      "CCCCCCCO": 623,
      "CCCCCCSc": 624,
      "CCCCOCCCNC": 625,
      "OCCNS": 626,
      "BrCC": 627,
      "CNn": 628,
      "cnsn": 629,
      "CCCCCOCC": 630,
      "COCCCCNC": 631,
      "123": 632,
      "NCCOCc": 633,
      "CCCCCCCCNC": 634,
      "CCOCCc": 635,
      "CCOCCNC": 636,
      "CCOCCOCC": 637,
      "COCCOCCOCCOC": 638,
      "CCOCCCn": 639,
      "NCCCOCCOCC": 640,
      "CCCCCCCCCCCCCCCCOC": 641,
      "OCCCCCCCCC": 642,
      "CCCCCCCCCOc": 643,
      "OCCOCCOCCO": 644,
      "OCCOCCOCCOc": 645,
      "OCCOCCOCCOCCO": 646,
      "NCCCCCCO": 647,
      "cocn": 648,
      "NCCCNS": 649,
      "312": 650,
      "51": 651,
      "75": 652,
      "IC": 653,
      "NSC": 654,
      "SCCOC": 655,
      "SCCCO": 656,
      "CCCSCc": 657,
      "CCCOCCOC": 658,
      "NCNC": 659,
      "OCF": 660,
      "CCCCCCOCC": 661,
      "CCCCOCCC": 662,
      "CCCCOCCOC": 663,
      "cccccc": 664,
      "OCCOCCC": 665,
      "CCCCCBr": 666,
      "COOC": 667,
      "COCCCS": 668,
      "CSN": 669,
      "CCCCCCCCCCCOc": 670,
      "COCCNS": 671,
      "CCOCCCNc": 672,
      "NNCCC": 673,
      "NCCCOCc": 674,
      "ncncn": 675,
      "CCCCCCCCCCCCCCCCCCCCCCCC": 676,
      "OCCCCl": 677,
      "OCCOCCOc": 678,
      "NCCCCOC": 679,
      "COCCCl": 680,
      "COCCCOCC": 681,
      "NCCSCCCO": 682,
      "OCCOCCOCCOCCOCCOCCOCCOCC": 683,
      "NCCCOCCOCCOCCCNC": 684,
      "19": 685,
      "37": 686,
      "52": 687,
      "89": 688,
      "BN": 689,
      "Hg": 690,
      "NOCCO": 691,
      "Op": 692,
      "ONc": 693,
      "SP": 694,
      "SCN": 695,
      "SCCCCC": 696,
      "SCCCc": 697,
      "ssc": 698,
      "CCCNCC": 699,
      "NCS": 700,
      "NCOc": 701,
      "CNO": 702,
      "CNCCC": 703,
      "cnncc": 704,
      "COCN": 705,
      "COCNC": 706,
      "COCOCc": 707,
      "COCCCOC": 708,
      "NCCOCCOC": 709,
      "CSCCOc": 710,
      "CCOCCS": 711,
      "CCOCCOCc": 712,
      "COCCOCc": 713,
      "COCCOCCNC": 714,
      "COCCOCCOc": 715,
      "CCCCCCSC": 716,
      "ccns": 717,
      "CCCOP": 718,
      "CCCCCCCCCCCCCCCCOCC": 719,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 720,
      "OCCOCCOCC": 721,
      "NCCCCl": 722,
      "NCCCCNC": 723,
      "NCCCCOc": 724,
      "CCCCCCCCCCCCCCOC": 725,
      "CCCCCCCCCCCCCCOc": 726,
      "132": 727,
      "36": 728,
      "63": 729,
      "FCC": 730,
      "NNCc": 731,
      "NCCCCCCCCCCC": 732,
      "OOCC": 733,
      "OCCCCN": 734,
      "OCCCCCCCCCCCCCCCCCC": 735,
      "Pc": 736,
      "SSCC": 737,
      "sncc": 738,
      "ccs": 739,
      "CCCI": 740,
      "CCCOCCOCC": 741,
      "OCOCC": 742,
      "CCCCOCc": 743,
      "CCCCCCS": 744,
      "ClCCc": 745,
      "OCCCCCc": 746,
      "OCCCCCOc": 747,
      "CNOC": 748,
      "CNCCCC": 749,
      "CONCc": 750,
      "NCCF": 751,
      "NCCOCCOCCOC": 752,
      "CSCCCNC": 753,
      "CCCCCCCCO": 754,
      "CCCCCCCCCCn": 755,
      "CCCCCCCCCCCNC": 756,
      "CCOCCOCCNC": 757,
      "COCCOCCn": 758,
      "NNN": 759,
      "NNNN": 760,
      "CCCOS": 761,
      "NCCCSC": 762,
      "NCCCSCc": 763,
      "NCCCOCCOC": 764,
      "OCCCBr": 765,
      "OCCOS": 766,
      "CCCCCCCl": 767,
      "NOS": 768,
      "CCCCCCCCCCCCCCCCc": 769,
      "CCCCCCCCCCCCCCCCCCOCC": 770,
      "CCCCCCCCCCCCCCCCCCCCCCCCC": 771,
      "OCCCCc": 772,
      "OCCCCCCO": 773,
      "OCCOCCN": 774,
      "OSOOO": 775,
      "@@](": 776,
      "OOOO": 777,
      "CCCCOCCNc": 778,
      "OCCCCCCCCCCOc": 779,
      "SSN": 780,
      "COOSc": 781,
      "-%": 782,
      "20": 783,
      "62": 784,
      "98": 785,
      "BO": 786,
      "OSC": 787,
      "OCCCCCCCCCCCCCC": 788,
      "SO": 789,
      "SNC": 790,
      "SCSc": 791,
      "SCCCOc": 792,
      "]=": 793,
      "nscc": 794,
      "ccsn": 795,
      "CCI": 796,
      "CCCOCCO": 797,
      "CCCNCCS": 798,
      "NCO": 799,
      "CCCCNCC": 800,
      "CCCCSCC": 801,
      "CCCCOCCN": 802,
      "OCCOCc": 803,
      "OCCCCCN": 804,
      "CCNCCc": 805,
      "BrCCC": 806,
      "CNCCO": 807,
      "CONc": 808,
      "COCCCOCCC": 809,
      "NCCOCCC": 810,
      "nccnn": 811,
      "CSS": 812,
      "CSCCNc": 813,
      "CCOCO": 814,
      "CCCCCCCCOCC": 815,
      "CCCCCCCCCCNC": 816,
      "CCOCCOCCO": 817,
      "COCCSc": 818,
      "COCCOCCO": 819,
      "COCCOCCOC": 820,
      "CCOO": 821,
      "CCSP": 822,
      "CCSCCN": 823,
      "CCSCCCn": 824,
      "CCCCCCl": 825,
      "CCCCCCBr": 826,
      "NCCCOCCO": 827,
      "=[*]": 828,
      "OCCCOCc": 829,
      ")([*])": 830,
      "CCCCCCCOC": 831,
      "CCCCCCCNc": 832,
      "CCCCCCCOCC": 833,
      "NON": 834,
      "CCCCCCCCCCCCCCCCNC": 835,
      "CCCCCCCCCCCCCCCCCCN": 836,
      "CCCCCCCCCCCCCCCCCCOC": 837,
      "CCCOCOC": 838,
      "OCCCCNC": 839,
      "OCCCCBr": 840,
      "CCCSP": 841,
      "[*])[": 842,
      "NCCCCOCC": 843,
      "nnns": 844,
      "109": 845,
      "CCCCCCCCCCCCCCCOC": 846,
      "OCCOCCOCCOCCOc": 847,
      "NCCCCCCBr": 848,
      "CCOCCOCCOCCOCCNC": 849,
      ")[*])[": 850,
      "26": 851,
      "321": 852,
      "57": 853,
      "73": 854,
      "BH": 855,
      "Bi": 856,
      "BOc": 857,
      "FCc": 858,
      "In": 859,
      "NB": 860,
      "NI": 861,
      "NCCCCCCCCCCCC": 862,
      "OCCCCCCCCCCCCC": 863,
      "SH": 864,
      "SI": 865,
      "SCl": 866,
      "SNc": 867,
      "SCCOCCOCCOCC": 868,
      "])[": 869,
      "op": 870,
      "CCCNCc": 871,
      "CCCOCCNC": 872,
      "NCP": 873,
      "NCn": 874,
      "OCS": 875,
      "OCOCc": 876,
      "OCOCCC": 877,
      "OCOCCOC": 878,
      "CCCCB": 879,
      "CCCCP": 880,
      "CCCCOCCNC": 881,
      "CCCCOCCn": 882,
      "ClCCC": 883,
      "ClCCN": 884,
      "OCCI": 885,
      "OCCCCCO": 886,
      "CCNCCO": 887,
      "CNP": 888,
      "CNCCN": 889,
      "CNCCc": 890,
      "CNCCS": 891,
      "CNCCCO": 892,
      "CNCCCNC": 893,
      "COCCCCCCCC": 894,
      "COCCCCN": 895,
      "COCCCCOC": 896,
      "COCCCCCCOc": 897,
      "nnncc": 898,
      "NCCOP": 899,
      "NCCOCCS": 900,
      "CSP": 901,
      "CSCCCCC": 902,
      "CSCCOC": 903,
      "CSCCCN": 904,
      "CSCCCCNC": 905,
      "CSCCCCNc": 906,
      "CCOCN": 907,
      "CCOCOc": 908,
      "+](=[": 909,
      "CCCCCCCCS": 910,
      "CCCCCCCCNc": 911,
      "CCOCCSc": 912,
      "CCOCCOCCOC": 913,
      "COCCNCC": 914,
      "COCCSCC": 915,
      "COCCOCCc": 916,
      "COCCOCOC": 917,
      "COCCOCCCOc": 918,
      "CCOn": 919,
      "CCOCCCOC": 920,
      "CCOSOOO": 921,
      "CCSS": 922,
      "CCSCCOc": 923,
      "CCSCCNC": 924,
      "CCSCCCO": 925,
      "CCSCCCOc": 926,
      "CCSCCNc": 927,
      "CCCOCCCNC": 928,
      "csnc": 929,
      "=[*])": 930,
      "OCON": 931,
      "OCOP": 932,
      "CCCCCCCOCc": 933,
      "NOCCCc": 934,
      "CCCCCCCCCCCCCCCCS": 935,
      "CCCCCCCCCCCCCCCCCCNC": 936,
      "OCCCCS": 937,
      "OCCCCNc": 938,
      "OCCCCOCC": 939,
      "OCCCCCCc": 940,
      "OCCCCCCS": 941,
      "CCCCCCCCCN": 942,
      "CCCCCCCCCNC": 943,
      "CCCSO": 944,
      "OCCOCCOCCNC": 945,
      "NCCCCNc": 946,
      "NCCCCSC": 947,
      "COCCCSc": 948,
      "OSN": 949,
      "NOCOC": 950,
      "CCCCCCCCCCCCS": 951,
      "CCCCCCCCCCCCCCN": 952,
      "CCCCCCCCCCCCCCOCC": 953,
      "CCCCCCCCCCCCCCCc": 954,
      "CCCCCCCCCCCCSc": 955,
      "OCCCON": 956,
      "OCCCOP": 957,
      "NCCCCCOC": 958,
      "CCCOCCn": 959,
      "CCCCCCCCCCCCCCCCCc": 960,
      "COCCONC": 961,
      "COCCCCNS": 962,
      "COCCCNS": 963,
      "OCCOCCOCCOCCOCCO": 964,
      "NCCCCCCl": 965,
      "NCCCCCCNc": 966,
      "OCCCCCCCCCCN": 967,
      "GeH": 968,
      "CCCCOCCOCCNC": 969,
      "COCCOCCCOCc": 970,
      "OOOOOOO": 971,
      "SCCOCCOCCOCCS": 972,
      "22": 973,
      "27": 974,
      "28": 975,
      "29": 976,
      "47": 977,
      "413": 978,
      "59": 979,
      "61": 980,
      "68": 981,
      "86": 982,
      "@](": 983,
      "Au": 984,
      "BB": 985,
      "Cr": 986,
      "NF": 987,
      "NBr": 988,
      "NOCO": 989,
      "NNCCO": 990,
      "ONCC": 991,
      "ONN": 992,
      "OSc": 993,
      "OSCC": 994,
      "ONNC": 995,
      "OOS": 996,
      "PH": 997,
      "PN": 998,
      "Pb": 999,
      "PCCC": 1000,
      "Sb": 1001,
      "SCCCCCCCC": 1002,
      "SCCOCC": 1003,
      "SCCCCc": 1004,
      "SCCCCCc": 1005,
      "SCCOCCO": 1006,
      "Tl": 1007,
      "Xe": 1008,
      "])([": 1009,
      "ccccccc": 1010,
      "CCCB": 1011,
      "CCCOCCc": 1012,
      "OCp": 1013,
      "OCSC": 1014,
      "ncsn": 1015,
      "CCCCSCc": 1016,
      "CCCCOCCOc": 1017,
      "CCCCOCCCCC": 1018,
      "CCCCCCON": 1019,
      "CCCCOCCCNc": 1020,
      "ClCCOc": 1021,
      "ClCCCc": 1022,
      "ccccccccc": 1023,
      "-]([": 1024,
      "OCCP": 1025,
      "OCCNN": 1026,
      "OCCCCCNc": 1027,
      "OCCCCCl": 1028,
      "CCNP": 1029,
      "CCNOC": 1030,
      "CCNCCOC": 1031,
      "CNOCc": 1032,
      "CNCCNC": 1033,
      "cns": 1034,
      "CCCCCOCCC": 1035,
      "CCCCCOP": 1036,
      "CCCCCSCCN": 1037,
      "COCOCCC": 1038,
      "CONS": 1039,
      "COCCCCCC": 1040,
      "COCCCO": 1041,
      "COCCCCCCCCCCCCCCCC": 1042,
      "COCCCCc": 1043,
      "COCCCCCCCCCCCC": 1044,
      "COCCCCn": 1045,
      "COCCCCCCCCCCCCCCCCCC": 1046,
      "NCCSCC": 1047,
      "NCCOCCNC": 1048,
      "NCCOCCOc": 1049,
      "NCCOCCn": 1050,
      "NCCOCCOCCOCCOCC": 1051,
      "NCCOCCOCCOCCOCCOCCOCCOCCOCC": 1052,
      "CSI": 1053,
      "CSn": 1054,
      "CSCCc": 1055,
      "CSCOC": 1056,
      "CSCCn": 1057,
      "CSCCCCCC": 1058,
      "CSCCCO": 1059,
      "CSSCc": 1060,
      "CSCCCNc": 1061,
      "CSOOO": 1062,
      "213": 1063,
      "CCCCCCCCCCN": 1064,
      "CCCCCCCCCCO": 1065,
      "CCCCCCCCCCCCN": 1066,
      "CCCCCCCCCCSc": 1067,
      "CCCCCCCCCCCCCc": 1068,
      "nncnc": 1069,
      "CCOCCOCCOCCOCCOCC": 1070,
      "CCOCCOCCOCCO": 1071,
      "CCOCCOCCNc": 1072,
      "CCOCCOCCOCCOCCOCCOCCOCCOCCOCC": 1073,
      "CCCNP": 1074,
      "COCCNCc": 1075,
      "COCCSC": 1076,
      "COCCCCCNC": 1077,
      "COCCCCCn": 1078,
      "COCCOCCCNC": 1079,
      "COCCOCCOCCOCCOCC": 1080,
      "CCOB": 1081,
      "CCOOP": 1082,
      "CCOCCCOCCC": 1083,
      "CCSCCCC": 1084,
      "CCSCCc": 1085,
      "CCSCCOC": 1086,
      "CCSCCCN": 1087,
      "CCSCCO": 1088,
      "CCSCCCCO": 1089,
      "CCSSCCC": 1090,
      "NSNC": 1091,
      "CCCCCCP": 1092,
      "cnno": 1093,
      "CCCOO": 1094,
      "CCCOOC": 1095,
      "CCCOCCCC": 1096,
      "NCCCBr": 1097,
      "NCCCSCC": 1098,
      "NCCCOCCc": 1099,
      "SCCNc": 1100,
      "OCCCI": 1101,
      "OCCCSc": 1102,
      "OCOO": 1103,
      "OCCOP": 1104,
      "NOP": 1105,
      "NOCCCC": 1106,
      "(=[*])": 1107,
      "CCCCCCCCCCCCCCCCCCCOC": 1108,
      "CCCCCCCCCCCCCCCCOS": 1109,
      "CCCCCCCCCCCCCCCCCCOP": 1110,
      "CCCCCCCCCCCCCCCCCCCCCO": 1111,
      "OCCCCCCOCC": 1112,
      "CCCCCCCCCS": 1113,
      "CCCCCCCCCNc": 1114,
      "CCCCCCCCCOCC": 1115,
      "CCCSS": 1116,
      "CCCSCCC": 1117,
      "CCCSCCS": 1118,
      "OCCOCCNc": 1119,
      "OCCOCCSC": 1120,
      "CCCCON": 1121,
      "[*])[*])": 1122,
      "NCCCCNS": 1123,
      "COCCCSC": 1124,
      "OPOC": 1125,
      "315": 1126,
      "CCCCCCCCCCCCNc": 1127,
      "CCCCCCCCCCCCOCC": 1128,
      "CCCCCCCCCCCCCCc": 1129,
      "CCCCCCCCCCCCCCNC": 1130,
      "CCCCCCCCCCCCSC": 1131,
      "CCCCCCCCCCCCCCCO": 1132,
      "CCCCCCCCCCCCSCC": 1133,
      "OOOC": 1134,
      "NCCCCCN": 1135,
      "NCCCCCNC": 1136,
      "NCCCCCNc": 1137,
      "conn": 1138,
      "SCCCSC": 1139,
      "CCCCCCCCCCCCCS": 1140,
      "CCCCCCCCCCCCCNC": 1141,
      "CCCCCCCCCCCCCOC": 1142,
      "CCCOCCNc": 1143,
      "CCCOCCOCc": 1144,
      "CCCOCCSc": 1145,
      "119": 1146,
      "NOCCn": 1147,
      "COCCOCOc": 1148,
      "COCCOCOCC": 1149,
      "CCCCCCCCCCCCCCCCCO": 1150,
      "SeH": 1151,
      "OCCCCCCl": 1152,
      "OCCSCCCCCCCC": 1153,
      "OCCSSCC": 1154,
      "OCCSSCCOC": 1155,
      "OCCCCCCCCc": 1156,
      "OCCCCCCCCOC": 1157,
      "NCCOCCBr": 1158,
      "COCCOCCOCc": 1159,
      "COCCOCCOCCC": 1160,
      "COCCOCCOCCO": 1161,
      "SSCCOC": 1162,
      "NCCOCCOCCNC": 1163,
      "CCOCCOCCOCCNC": 1164,
      "CCCCCCOCCCCc": 1165,
      "COOOP": 1166,
      "NCCOCCOCCCCCCCl": 1167,
      "NCCCCCCCCNC": 1168,
      "COCCOCCOCCOc": 1169,
      "COCCOCCOCCOCCOCCO": 1170,
      "CCCCOCCOCCOCCC": 1171,
      "COCCOCCCCNC": 1172,
      "COCCOCCCCNc": 1173,
      "OCCOCCOCCOCCOCCCCCCCCCCCC": 1174,
      "CCCCCCOCCCCC": 1175,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 1176,
      "CCCCCCSSC": 1177,
      "NNNNNNNN": 1178,
      "CCOCCOCCOCCOCCOCCOCCNC": 1179,
      "CCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCC": 1180,
      "COCCOCCOCCOCCOCCOCCOCCOc": 1181
    },
    "merges": [
      "c c",
      "C C",
      "( =",
      "cc c",
      "CC C",
      "C c",
      "+ ]",
      "cc ccc",
      "N C",
      "O C",
      "N H",
      "n c",
      "CC CC",
      ") (",
      "C l",
      "cc cc",
      "O c",
      "N c",
      ") [",
      "- ]",
      "-] )",
      "O CC",
      "C Oc",
      ") (=",
      "n H",
      "( [",
      ") =",
      "CC N",
      "B r",
      "C N",
      "+] (",
      "c n",
      "CC CCC",
      "CC c",
      "C OC",
      "C O",
      "1 2",
      "+] )",
      "s c",
      "n n",
      "N CC",
      "n cc",
      "C S",
      "CC OC",
      "2 1",
      "+] (=",
      "C NC",
      "o c",
      "c nc",
      "N Cc",
      "CCCC CCCC",
      "n nc",
      "CC OCC",
      "O Cc",
      "C n",
      "CC Oc",
      "CCC N",
      "C OCC",
      "2 3",
      "ccc nc",
      "CC NC",
      "S C",
      "3 2",
      "CC O",
      "CS c",
      "N N",
      "cc nc",
      "CC S",
      "] (",
      "N S",
      "ccc s",
      "CC n",
      "CCCC CC",
      "CCC c",
      "C Nc",
      "S i",
      "cc n",
      "cn n",
      "cccc n",
      "+] =",
      "S c",
      "ccc o",
      "CCC O",
      "c sc",
      ")= [",
      "c s",
      "N CCC",
      "nc nc",
      "cc ncc",
      "S CC",
      "n o",
      "N NC",
      "n oc",
      "N CCc",
      "= [",
      "O CCC",
      "n ccc",
      "nc n",
      "OC O",
      "CCC NC",
      "cn cc",
      ")( [",
      "( -",
      "OCC O",
      "n cccc",
      "cc sc",
      "3 4",
      "4 3",
      "CCC Oc",
      "CCCC CCC",
      "S Cc",
      "CC l",
      "CC Nc",
      "CS C",
      "CCCC N",
      "ccc n",
      "* ]",
      "N O",
      "s ccc",
      "CCC n",
      "(= [",
      "+] ([",
      "CCCCCCCC CCCCCCCC",
      "CCC OC",
      "CO Cc",
      "O CCCC",
      "CCCC CCCCC",
      "F c",
      "ncc n",
      "CCC S",
      "OCC OCC",
      "CCCC c",
      "CC SC",
      "1 3",
      "o n",
      "C Br",
      "CCCC O",
      "[ *]",
      "CN S",
      "-] )[",
      "Cl c",
      "CO P",
      "CCC Nc",
      "c oc",
      "N CCCC",
      "ncc s",
      "cc oc",
      "CS CC",
      "cnc n",
      ") -",
      "nn n",
      "5 4",
      "F C",
      "CO CCC",
      "COCC N",
      "CCCC Oc",
      "cn ccc",
      "O S",
      "CCS c",
      "CCCC NC",
      "nn nn",
      "CCS CC",
      "cc nn",
      "O P",
      "-]) =",
      "N OC",
      "N Nc",
      "s cc",
      "O N",
      "nccc n",
      "3 1",
      "N CCN",
      "CCCCCCCC CC",
      "cn nc",
      "CCC l",
      "CCCCCCCC CCCC",
      "4 5",
      "@ @",
      "ncc nc",
      "o nc",
      "OCC OC",
      "OCC c",
      "+] )(",
      "cn ccn",
      "o ccc",
      "O CCCO",
      "CCCCCCCC CCC",
      "CCN S",
      "*] )",
      "nn nc",
      "1 0",
      "N n",
      "CS CCC",
      "CCCC OC",
      "NCC NC",
      "OCC N",
      "OCC NC",
      "Br c",
      "O O",
      "n sc",
      "-] )(",
      "NCC Oc",
      "nc nn",
      "CS Cc",
      "N CCCCC",
      "nnc n",
      "cn nn",
      "CO N",
      "+]= [",
      "OCC Oc",
      "CCCCC N",
      "c o",
      "CCCC n",
      "CCCC S",
      "COCC NC",
      "C F",
      "n s",
      "cnc nc",
      "NCC n",
      "6 5",
      "OC OC",
      "COCC n",
      "] [",
      "CN CC",
      "N CCCc",
      "cs cn",
      "nc sc",
      "CCCCC c",
      "S CCC",
      "([ *])",
      "# [",
      "NCC O",
      "NCC S",
      "CCCCCCCC CCCCC",
      "CCC OCC",
      "CCCCC NC",
      "no nc",
      "N CCCN",
      "CCCCCCCC CCCCCCC",
      "CCCCCCCCCCCCCCCC CC",
      "[*] )",
      "1 1",
      "CCO P",
      "-] #[",
      "N OCC",
      "CCC Sc",
      "O B",
      "2 4",
      "CO CCCNC",
      "OCC n",
      "CCCCC Oc",
      "nn cc",
      "CCCCCCCC CCCCCC",
      "COCC Oc",
      "NCCC n",
      "sc nc",
      "COCC OC",
      "CC OCc",
      "CCCC CCc",
      "C H",
      "CCCCCCCC CCCCCCCCC",
      "5 6",
      "CCCC CCOc",
      "cc on",
      "CC Br",
      "4 2",
      "S e",
      "OCC CCC",
      "NCC OC",
      "CCN CC",
      "COCC O",
      "ccnc n",
      "N OCc",
      "C I",
      "s ccn",
      "-] =[",
      "CO S",
      "o cc",
      "cs cc",
      "nc ncc",
      "Cl C",
      "CO CCCC",
      "1 4",
      "CCC SC",
      "Si H",
      "C P",
      "CO CCCN",
      "O CCCc",
      "nn sc",
      "NCC Nc",
      "N P",
      "s nc",
      "CCCCC OC",
      "CCCN S",
      "ns nc",
      "7 6",
      "O CCCCCC",
      "ccc nn",
      ")[ *])",
      "OCCC NC",
      "OCCOCC OCCOCC",
      "N CCCCCC",
      "CN N",
      "CCCC OCC",
      "COCC c",
      "O CCCN",
      "+] )=",
      "s nnc",
      "OCC S",
      "CCO N",
      "3 5",
      "N NCC",
      "CCCCC O",
      "cnc s",
      "O OC",
      "CCCC l",
      "CCO CCCNC",
      "NCCC OC",
      "CCCCCCCCCCCCCCCC CCC",
      "OO O",
      "CC F",
      "NCCC NC",
      "CCCC Nc",
      "nnc s",
      "6 7",
      "O CCCCCCCC",
      "nc oc",
      "CCO CCC",
      "N CCCO",
      "CC P",
      "COC Oc",
      "CCCCCCCCCCCCCCCC CCCCC",
      "CCCC CCNC",
      "S n",
      "CCCC CCN",
      "CN NC",
      "COC OC",
      "OCCC Oc",
      "O n",
      "cn oc",
      "NCC OCC",
      "NCCN S",
      "ncc o",
      "oc nc",
      "COCC Nc",
      "COCC OCC",
      "ccn o",
      "] )",
      "cs nn",
      "S CCS",
      "+] )[",
      "NCC SCc",
      "cnc o",
      "NN S",
      "Cl Cc",
      "-] )([",
      "CCCCC n",
      "NCC Sc",
      "NCCC OCC",
      "S S",
      "S CCN",
      "S OOO",
      "s n",
      "CCC Br",
      "CCCC CCOC",
      "CCCC CCCOc",
      "CS CCN",
      "CCCCCCCC c",
      "OCCC OC",
      "OCC OCCO",
      "CCCCC Nc",
      "NCCC Oc",
      "OCCOCC OC",
      "6 4",
      "C B",
      "N CCCCc",
      "nc on",
      "OCC Nc",
      "CCOCC N",
      "OCCC n",
      "8 7",
      "o ncc",
      "CCCC Sc",
      "CCOCC Oc",
      "CCS CCC",
      "4 1",
      "7 8",
      "O CCCCCCCCCC",
      "O CCCCCCCCCCC",
      "CCOCC O",
      "O NC",
      "CCCC CCn",
      "CCCC CCCc",
      "O CCCCCCCCCCCC",
      "S CCCS",
      "] ([",
      "cc nnc",
      "CO NC",
      "NCC SC",
      "CCCCCCCC OC",
      "A s",
      "B c",
      "CCC OCc",
      "OC n",
      "OCC F",
      "CCCCCCCC N",
      "CCOCC OC",
      "CCO S",
      "S CCCC",
      "S CCCCCC",
      "CCC SCC",
      "CCCC CCCN",
      "OCC Sc",
      "CN Cc",
      "COC O",
      "NCC OCCOCC",
      "CS SCC",
      "CCCCCCCCCCCCCCCC CCCC",
      "S CCc",
      "S CCOc",
      "OC N",
      "CCCC SC",
      "-] [",
      "CCCCC l",
      "CS CN",
      "CCCCCCCC Oc",
      "CCCCCCCC CCOC",
      "CCOCC n",
      "1 5",
      "S N",
      "NC N",
      "OC Oc",
      "Cl CC",
      "CS CCNC",
      "CCCCCCCC CCOc",
      "CCOCC OCCOCC",
      "5 3",
      "I c",
      "CO CCCn",
      "CS CCS",
      "CCCCCCCC CCCCOc",
      "CCO NC",
      "CCS Cc",
      "NCCC Nc",
      ") /",
      "B C",
      "O CCCCCCCCCCCCCCCC",
      "CCCC CCO",
      "Br C",
      "nn ccc",
      "CS CCO",
      "nnc o",
      "CCCO CCC",
      "NCCC Sc",
      "OCCC S",
      "OCCC l",
      "ncn s",
      "CCCCCCCCC OC",
      "OCCOCC OCCOC",
      "O CCCCCCC",
      "+] #",
      "-] (",
      "CO O",
      "NCC OCCO",
      "CCCCCCCC CCc",
      "no cc",
      "OCCC Nc",
      "31 4",
      "@@ ]",
      "NCCCCC O",
      "@ ]",
      "S CCNC",
      "s e",
      "CCC F",
      "nc no",
      "CCCC NS",
      ")[ *]",
      "CCN N",
      "CO CCCc",
      "CO CCCOc",
      "CCOC n",
      "CCO CCCN",
      "NCCC S",
      "1 6",
      "1 7",
      "A l",
      "G e",
      "N CCCCCCCC",
      "S CCO",
      "T e",
      "CCCC Br",
      "OCC Br",
      "Br Cc",
      "CCCCCCCC CCCc",
      "CCCCCCCC CCCCc",
      "COCC S",
      "COCC OCCOCC",
      "CCO CCCC",
      "NCCC l",
      "CCCCCCC n",
      "OCCCC OC",
      "2 5",
      "N CCCCCCC",
      "N CCCCN",
      "] )(",
      "c onc",
      "CCCC CCCNC",
      "CCCC OCCOCC",
      "COC n",
      "CO CCCNc",
      "CCCCCCCC CCCOC",
      "CCOCC Nc",
      "COCC CCC",
      "cnn s",
      "CCCCCCCCCCCCCCCC CCCCCC",
      "OCCCC Oc",
      "OCCCC CCOc",
      "CCCCCCCCCCCC OC",
      "( #",
      "1 8",
      "4 6",
      "N CCCCO",
      "P C",
      "S CCCN",
      "CCN Cc",
      "CO n",
      "CS CCCC",
      "COCC OCCC",
      "COCC OCCCC",
      "NS c",
      "CCCCCC Nc",
      "SCC SC",
      "CCCCCCCCCCCCCCCC Oc",
      "OCCCC O",
      "OCCCC n",
      "OCCCC CCOC",
      "NCCCC CCN",
      "co cc",
      "S SC",
      "] (=",
      "NC l",
      "OC l",
      "OCC SC",
      "OCC SCC",
      "cn sc",
      "CCCCC S",
      "CCCCC NS",
      "CCCCC Sc",
      "CO B",
      "CS SC",
      "CCCCCCCC n",
      "CCCO N",
      "CCCCCCCCCCCCCCCC CCCCCCC",
      "CCCCCCCCC c",
      "CCCCO P",
      "NCCCC n",
      "NCCCC CCNC",
      "NCCCCC c",
      "( /",
      "I H",
      "N Oc",
      "N OCCC",
      "O Oc",
      "S Sc",
      "CCC P",
      "CCC OCCOc",
      "+] [",
      "+] #[",
      "OC NC",
      "CCCC CCCO",
      "CCCC CCSc",
      "CCCC OCCCNC",
      "OCC NS",
      "Br CC",
      "CN n",
      "cn sn",
      "CCCCC OCC",
      "CO CCCCNC",
      "12 3",
      "NCC OCc",
      "CCCCCCCC NC",
      "CCOCC c",
      "CCOCC NC",
      "CCOCC OCC",
      "COCC OCCOCCOC",
      "CCO CCCn",
      "NCCC OCCOCC",
      "CCCCCCCCCCCCCCCC OC",
      "OCCCC CCCCC",
      "CCCCCCCCC Oc",
      "OCCOCC OCCO",
      "OCCOCC OCCOc",
      "OCCOCC OCCOCCO",
      "NCCCC CCO",
      "co cn",
      "NCCCN S",
      "3 12",
      "5 1",
      "7 5",
      "I C",
      "N SC",
      "S CCOC",
      "S CCCO",
      "CCC SCc",
      "CCC OCCOC",
      "NC NC",
      "OC F",
      "CCCC CCOCC",
      "CCCC OCCC",
      "CCCC OCCOC",
      "cccc cc",
      "OCC OCCC",
      "CCCCC Br",
      "CO OC",
      "CO CCCS",
      "CS N",
      "CCCCCCCC CCCOc",
      "COCC NS",
      "CCO CCCNc",
      "NN CCC",
      "NCCC OCc",
      "ncnc n",
      "CCCCCCCCCCCCCCCC CCCCCCCC",
      "OCCCC l",
      "OCCOCC Oc",
      "NCCCC OC",
      "COCCC l",
      "COCCC OCC",
      "NCCS CCCO",
      "OCCOCCOCCOCC OCCOCCOCCOCC",
      "NCCCOCCOCC OCCCNC",
      "1 9",
      "3 7",
      "5 2",
      "8 9",
      "B N",
      "H g",
      "N OCCO",
      "O p",
      "O Nc",
      "S P",
      "S CN",
      "S CCCCC",
      "S CCCc",
      "s sc",
      "CCC NCC",
      "NC S",
      "NC Oc",
      "CN O",
      "CN CCC",
      "cn ncc",
      "COC N",
      "COC NC",
      "COC OCc",
      "CO CCCOC",
      "NCC OCCOC",
      "CS CCOc",
      "CCOCC S",
      "CCOCC OCc",
      "COCC OCc",
      "COCC OCCNC",
      "COCC OCCOc",
      "CCCCCC SC",
      "ccn s",
      "CCCO P",
      "CCCCCCCCCCCCCCCC OCC",
      "CCCCCCCCCCCCCCCC CCCCCCCCCCCCCCCC",
      "OCCOCC OCC",
      "NCCCC l",
      "NCCCC NC",
      "NCCCC Oc",
      "CCCCCCCCCCCC CCOC",
      "CCCCCCCCCCCC CCOc",
      "1 32",
      "3 6",
      "6 3",
      "F CC",
      "N NCc",
      "N CCCCCCCCCCC",
      "O OCC",
      "O CCCCN",
      "O CCCCCCCCCCCCCCCCCC",
      "P c",
      "S SCC",
      "s ncc",
      "cc s",
      "CCC I",
      "CCC OCCOCC",
      "OC OCC",
      "CCCC OCc",
      "CCCC CCS",
      "Cl CCc",
      "OCC CCCc",
      "OCC CCCOc",
      "CN OC",
      "CN CCCC",
      "CO NCc",
      "NCC F",
      "NCC OCCOCCOC",
      "CS CCCNC",
      "CCCCCCCC O",
      "CCCCCCCC CCn",
      "CCCCCCCC CCCNC",
      "CCOCC OCCNC",
      "COCC OCCn",
      "NN N",
      "NN NN",
      "CCCO S",
      "NCCC SC",
      "NCCC SCc",
      "NCCC OCCOC",
      "OCCC Br",
      "OCCO S",
      "CCCCCCC l",
      "NO S",
      "CCCCCCCCCCCCCCCC c",
      "CCCCCCCCCCCCCCCC CCOCC",
      "CCCCCCCCCCCCCCCC CCCCCCCCC",
      "OCCCC c",
      "OCCCC CCO",
      "OCCOCC N",
      "OS OOO",
      "@@ ](",
      "OO OO",
      "CCCCOCC Nc",
      "OCCCCCCCC CCOc",
      "SS N",
      "COO Sc",
      "- %",
      "2 0",
      "6 2",
      "9 8",
      "B O",
      "O SC",
      "O CCCCCCCCCCCCCC",
      "S O",
      "S NC",
      "S CSc",
      "S CCCOc",
      "] =",
      "n scc",
      "cc sn",
      "CC I",
      "CCC OCCO",
      "CCC NCCS",
      "NC O",
      "CCCC NCC",
      "CCCC SCC",
      "CCCC OCCN",
      "OCC OCc",
      "OCC CCCN",
      "CCN CCc",
      "Br CCC",
      "CN CCO",
      "CO Nc",
      "CO CCCOCCC",
      "NCC OCCC",
      "ncc nn",
      "CS S",
      "CS CCNc",
      "CCOC O",
      "CCCCCCCC OCC",
      "CCCCCCCC CCNC",
      "CCOCC OCCO",
      "COCC Sc",
      "COCC OCCO",
      "COCC OCCOC",
      "CCO O",
      "CCS P",
      "CCS CCN",
      "CCS CCCn",
      "CCCCCC l",
      "CCCCCC Br",
      "NCCC OCCO",
      "=[ *]",
      "OCCC OCc",
      ")([ *])",
      "CCCCCCC OC",
      "CCCCCCC Nc",
      "CCCCCCC OCC",
      "NO N",
      "CCCCCCCCCCCCCCCC NC",
      "CCCCCCCCCCCCCCCC CCN",
      "CCCCCCCCCCCCCCCC CCOC",
      "CCCOC OC",
      "OCCCC NC",
      "OCCCC Br",
      "CCCS P",
      "[*] )[",
      "NCCCC OCC",
      "nnn s",
      "10 9",
      "CCCCCCCCCCCCCCC OC",
      "OCCOCCOCCOCC Oc",
      "NCCCCCC Br",
      "CCOCCOCCOCC OCCNC",
      ")[*] )[",
      "2 6",
      "3 21",
      "5 7",
      "7 3",
      "B H",
      "B i",
      "B Oc",
      "F Cc",
      "I n",
      "N B",
      "N I",
      "N CCCCCCCCCCCC",
      "O CCCCCCCCCCCCC",
      "S H",
      "S I",
      "S Cl",
      "S Nc",
      "S CCOCCOCCOCC",
      "] )[",
      "o p",
      "CCC NCc",
      "CCC OCCNC",
      "NC P",
      "NC n",
      "OC S",
      "OC OCc",
      "OC OCCC",
      "OC OCCOC",
      "CCCC B",
      "CCCC P",
      "CCCC OCCNC",
      "CCCC OCCn",
      "Cl CCC",
      "Cl CCN",
      "OCC I",
      "OCC CCCO",
      "CCN CCO",
      "CN P",
      "CN CCN",
      "CN CCc",
      "CN CCS",
      "CN CCCO",
      "CN CCCNC",
      "CO CCCCCCCC",
      "CO CCCCN",
      "CO CCCCOC",
      "CO CCCCCCOc",
      "nn ncc",
      "NCC OP",
      "NCC OCCS",
      "CS P",
      "CS CCCCC",
      "CS CCOC",
      "CS CCCN",
      "CS CCCCNC",
      "CS CCCCNc",
      "CCOC N",
      "CCOC Oc",
      "+](= [",
      "CCCCCCCC S",
      "CCCCCCCC Nc",
      "CCOCC Sc",
      "CCOCC OCCOC",
      "COCC NCC",
      "COCC SCC",
      "COCC OCCc",
      "COCC OCOC",
      "COCC OCCCOc",
      "CCO n",
      "CCO CCCOC",
      "CCO SOOO",
      "CCS S",
      "CCS CCOc",
      "CCS CCNC",
      "CCS CCCO",
      "CCS CCCOc",
      "CCS CCNc",
      "CCCO CCCNC",
      "cs nc",
      "=[ *])",
      "OCO N",
      "OCO P",
      "CCCCCCC OCc",
      "NO CCCc",
      "CCCCCCCCCCCCCCCC S",
      "CCCCCCCCCCCCCCCC CCNC",
      "OCCCC S",
      "OCCCC Nc",
      "OCCCC OCC",
      "OCCCC CCc",
      "OCCCC CCS",
      "CCCCCCCCC N",
      "CCCCCCCCC NC",
      "CCCS O",
      "OCCOCC OCCNC",
      "NCCCC Nc",
      "NCCCC SC",
      "COCCC Sc",
      "OS N",
      "NOC OC",
      "CCCCCCCCCCCC S",
      "CCCCCCCCCCCC CCN",
      "CCCCCCCCCCCC CCOCC",
      "CCCCCCCCCCCC CCCc",
      "CCCCCCCCCCCC Sc",
      "OCCCO N",
      "OCCCO P",
      "NCCCCC OC",
      "CCCOCC n",
      "CCCCCCCCCCCCCCCCC c",
      "COCCO NC",
      "COCCCC NS",
      "COCCCN S",
      "OCCOCCOCCOCC OCCO",
      "NCCCCCC l",
      "NCCCCCC Nc",
      "OCCCCCCCC CCN",
      "Ge H",
      "CCCCOCCOCC NC",
      "COCCOCCC OCc",
      "OOOO OOO",
      "SCCOCCOCCOCC S",
      "2 2",
      "2 7",
      "2 8",
      "2 9",
      "4 7",
      "4 13",
      "5 9",
      "6 1",
      "6 8",
      "8 6",
      "@ ](",
      "A u",
      "B B",
      "C r",
      "N F",
      "N Br",
      "N OCO",
      "N NCCO",
      "O NCC",
      "O NN",
      "O Sc",
      "O SCC",
      "O NNC",
      "O OS",
      "P H",
      "P N",
      "P b",
      "P CCC",
      "S b",
      "S CCCCCCCC",
      "S CCOCC",
      "S CCCCc",
      "S CCCCCc",
      "S CCOCCO",
      "T l",
      "X e",
      "] )([",
      "cc ccccc",
      "CCC B",
      "CCC OCCc",
      "OC p",
      "OC SC",
      "nc sn",
      "CCCC SCc",
      "CCCC OCCOc",
      "CCCC OCCCCC",
      "CCCC CCON",
      "CCCC OCCCNc",
      "Cl CCOc",
      "Cl CCCc",
      "cccc ccccc",
      "-] ([",
      "OCC P",
      "OCC NN",
      "OCC CCCNc",
      "OCC CCCl",
      "CCN P",
      "CCN OC",
      "CCN CCOC",
      "CN OCc",
      "CN CCNC",
      "cn s",
      "CCCCC OCCC",
      "CCCCC OP",
      "CCCCC SCCN",
      "COC OCCC",
      "CO NS",
      "CO CCCCCC",
      "CO CCCO",
      "CO CCCCCCCCCCCCCCCC",
      "CO CCCCc",
      "CO CCCCCCCCCCCC",
      "CO CCCCn",
      "CO CCCCCCCCCCCCCCCCCC",
      "NCC SCC",
      "NCC OCCNC",
      "NCC OCCOc",
      "NCC OCCn",
      "NCC OCCOCCOCCOCC",
      "NCC OCCOCCOCCOCCOCCOCCOCCOCC",
      "CS I",
      "CS n",
      "CS CCc",
      "CS COC",
      "CS CCn",
      "CS CCCCCC",
      "CS CCCO",
      "CS SCc",
      "CS CCCNc",
      "CS OOO",
      "21 3",
      "CCCCCCCC CCN",
      "CCCCCCCC CCO",
      "CCCCCCCC CCCCN",
      "CCCCCCCC CCSc",
      "CCCCCCCC CCCCCc",
      "nnc nc",
      "CCOCC OCCOCCOCCOCC",
      "CCOCC OCCOCCO",
      "CCOCC OCCNc",
      "CCOCC OCCOCCOCCOCCOCCOCCOCCOCC",
      "CCCN P",
      "COCC NCc",
      "COCC SC",
      "COCC CCCNC",
      "COCC CCCn",
      "COCC OCCCNC",
      "COCC OCCOCCOCCOCC",
      "CCO B",
      "CCO OP",
      "CCO CCCOCCC",
      "CCS CCCC",
      "CCS CCc",
      "CCS CCOC",
      "CCS CCCN",
      "CCS CCO",
      "CCS CCCCO",
      "CCS SCCC",
      "NS NC",
      "CCCCCC P",
      "cnn o",
      "CCCO O",
      "CCCO OC",
      "CCCO CCCC",
      "NCCC Br",
      "NCCC SCC",
      "NCCC OCCc",
      "SCC Nc",
      "OCCC I",
      "OCCC Sc",
      "OCO O",
      "OCCO P",
      "NO P",
      "NO CCCC",
      "(=[ *])",
      "CCCCCCCCCCCCCCCC CCCOC",
      "CCCCCCCCCCCCCCCC OS",
      "CCCCCCCCCCCCCCCC CCOP",
      "CCCCCCCCCCCCCCCC CCCCCO",
      "OCCCC CCOCC",
      "CCCCCCCCC S",
      "CCCCCCCCC Nc",
      "CCCCCCCCC OCC",
      "CCCS S",
      "CCCS CCC",
      "CCCS CCS",
      "OCCOCC Nc",
      "OCCOCC SC",
      "CCCCO N",
      "[*] )[*])",
      "NCCCC NS",
      "COCCC SC",
      "OP OC",
      "31 5",
      "CCCCCCCCCCCC Nc",
      "CCCCCCCCCCCC OCC",
      "CCCCCCCCCCCC CCc",
      "CCCCCCCCCCCC CCNC",
      "CCCCCCCCCCCC SC",
      "CCCCCCCCCCCC CCCO",
      "CCCCCCCCCCCC SCC",
      "OO OC",
      "NCCCCC N",
      "NCCCCC NC",
      "NCCCCC Nc",
      "co nn",
      "SCCC SC",
      "CCCCCCCCCCCCC S",
      "CCCCCCCCCCCCC NC",
      "CCCCCCCCCCCCC OC",
      "CCCOCC Nc",
      "CCCOCC OCc",
      "CCCOCC Sc",
      "11 9",
      "NOCC n",
      "COCCOC Oc",
      "COCCOC OCC",
      "CCCCCCCCCCCCCCCCC O",
      "Se H",
      "OCCCCCC l",
      "OCCS CCCCCCCC",
      "OCCS SCC",
      "OCCS SCCOC",
      "OCCCCCCCC c",
      "OCCCCCCCC OC",
      "NCCOCC Br",
      "COCCOCC OCc",
      "COCCOCC OCCC",
      "COCCOCC OCCO",
      "SS CCOC",
      "NCCOCCOCC NC",
      "CCOCCOCCOCC NC",
      "CCCCCCO CCCCc",
      "COO OP",
      "NCCOCCO CCCCCCCl",
      "NCCCCCCCC NC",
      "COCCOCCOCC Oc",
      "COCCOCCOCC OCCOCCO",
      "CCCCOCCOCC OCCC",
      "COCCOCCCC NC",
      "COCCOCCCC Nc",
      "OCCOCCOCCOCCO CCCCCCCCCCCC",
      "CCCCCCOCC CCC",
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC CCCCCCCCCCCCC",
      "CCCCCCS SC",
      "NNNN NNNN",
      "CCOCCOCCOCCOCCOCC OCCNC",
      "CCOCCOCCOCCOCCOCCOCCOCCOCCOCC OCCOCC",
      "COCCOCCOCCOCCOCC OCCOCCOc"
    ]
  }
}