{
  "version": "1.0",
  "truncation": {
    "max_length": 150,
    "strategy": "OnlyFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 150
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "special": true,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 1,
      "special": true,
      "content": "<start>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 2,
      "special": true,
      "content": "<end>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 3,
      "special": true,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFKC"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "model": {
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "#": 0,
      "%": 1,
      "(": 2,
      ")": 3,
      "*": 4,
      "+": 5,
      "-": 6,
      "/": 7,
      "0": 8,
      "1": 9,
      "2": 10,
      "3": 11,
      "4": 12,
      "5": 13,
      "6": 14,
      "7": 15,
      "8": 16,
      "9": 17,
      "=": 18,
      "@": 19,
      "A": 20,
      "B": 21,
      "C": 22,
      "D": 23,
      "E": 24,
      "F": 25,
      "G": 26,
      "H": 27,
      "I": 28,
      "K": 29,
      "L": 30,
      "M": 31,
      "N": 32,
      "O": 33,
      "P": 34,
      "R": 35,
      "S": 36,
      "T": 37,
      "U": 38,
      "V": 39,
      "W": 40,
      "X": 41,
      "Y": 42,
      "Z": 43,
      "[": 44,
      "\\": 45,
      "]": 46,
      "a": 47,
      "b": 48,
      "c": 49,
      "d": 50,
      "e": 51,
      "f": 52,
      "g": 53,
      "h": 54,
      "i": 55,
      "k": 56,
      "l": 57,
      "m": 58,
      "n": 59,
      "o": 60,
      "p": 61,
      "r": 62,
      "s": 63,
      "t": 64,
      "u": 65,
      "y": 66,
      "Ċ": 67,
      "cc": 68,
      "CC": 69,
      "(=": 70,
      "ccc": 71,
      "CCC": 72,
      "Cc": 73,
      "+]": 74,
      "ccccc": 75,
      "NC": 76,
      "OC": 77,
      "NH": 78,
      "nc": 79,
      "CCCC": 80,
      ")(": 81,
      "Cl": 82,
      "cccc": 83,
      "Oc": 84,
      "Nc": 85,
      ")[": 86,
      "-]": 87,
      "OCC": 88,
      "-])": 89,
      "COc": 90,
      ")(=": 91,
      "nH": 92,
      "([": 93,
      ")=": 94,
      "CCN": 95,
      "Br": 96,
      "CN": 97,
      "+](": 98,
      "cn": 99,
      "CCCCC": 100,
      "CCc": 101,
      "COC": 102,
      "12": 103,
      "CO": 104,
      "sc": 105,
      "+])": 106,
      "nn": 107,
      "NCC": 108,
      "ncc": 109,
      "CS": 110,
      "CCOC": 111,
      "21": 112,
      "+](=": 113,
      "CNC": 114,
      "oc": 115,
      "cnc": 116,
      "NCc": 117,
      "nnc": 118,
      "CCOCC": 119,
      "CCCCCCCC": 120,
      "OCc": 121,
      "Cn": 122,
      "CCOc": 123,
      "CCCN": 124,
      "COCC": 125,
      "23": 126,
      "CCNC": 127,
      "SC": 128,
      "32": 129,
      "cccnc": 130,
      "CCO": 131,
      "NN": 132,
      "CSc": 133,
      "CCS": 134,
      "ccnc": 135,
      "NS": 136,
      "cccs": 137,
      "CCCc": 138,
      "CCn": 139,
      "](": 140,
      "CCCCCC": 141,
      "Si": 142,
      "CNc": 143,
      "ccn": 144,
      ")=[": 145,
      "Sc": 146,
      "ccccn": 147,
      "+]=": 148,
      "csc": 149,
      "cnn": 150,
      "ccco": 151,
      "CCCO": 152,
      "cs": 153,
      "NCCC": 154,
      "ccncc": 155,
      "ncnc": 156,
      "no": 157,
      "SCC": 158,
      "NNC": 159,
      "=[": 160,
      "noc": 161,
      "nccc": 162,
      "NCCc": 163,
      "OCCC": 164,
      "ncn": 165,
      "CCCNC": 166,
      "OCO": 167,
      ")([": 168,
      "(-": 169,
      "cncc": 170,
      "OCCO": 171,
      "ccsc": 172,
      "ncccc": 173,
      "34": 174,
      "CCCOc": 175,
      "43": 176,
      "CSC": 177,
      "CCl": 178,
      "CCCCN": 179,
      "CCCCCCC": 180,
      "CCNc": 181,
      "SCc": 182,
      "cccn": 183,
      "*]": 184,
      "OCCOCC": 185,
      "CCCn": 186,
      "sccc": 187,
      "(=[": 188,
      "NO": 189,
      "+]([": 190,
      "CCCCCCCCC": 191,
      "COCc": 192,
      "Fc": 193,
      "CCCOC": 194,
      "OCCCC": 195,
      "on": 196,
      "CCCS": 197,
      "CCCCCCCCCCCCCCCC": 198,
      "CBr": 199,
      "CCSC": 200,
      "CNS": 201,
      "[*]": 202,
      "nccn": 203,
      "13": 204,
      "CCCCc": 205,
      "-])[": 206,
      "CCCCO": 207,
      "Clc": 208,
      "nccs": 209,
      "CCCNc": 210,
      "coc": 211,
      "COP": 212,
      "ccoc": 213,
      "cncn": 214,
      "FC": 215,
      "CCSc": 216,
      "COCCN": 217,
      ")-": 218,
      "54": 219,
      "CSCC": 220,
      "CCCCNC": 221,
      "CCCCOc": 222,
      "OP": 223,
      "ccnn": 224,
      "nnn": 225,
      "ncccn": 226,
      "cnccc": 227,
      "NCCCC": 228,
      "COCCC": 229,
      "nnnn": 230,
      "OS": 231,
      "-])=": 232,
      "NNc": 233,
      "CCSCC": 234,
      "ON": 235,
      "NOC": 236,
      "scc": 237,
      "CCCCCCCCCCCC": 238,
      "CCNS": 239,
      "cnnc": 240,
      "45": 241,
      "+])(": 242,
      "CCCl": 243,
      "cnccn": 244,
      "31": 245,
      "CCCCCCCCCC": 246,
      "OCCOC": 247,
      "@@": 248,
      "NCCN": 249,
      "OCCCO": 250,
      "nccnc": 251,
      "onc": 252,
      "OCCc": 253,
      "OCCN": 254,
      "NCCNC": 255,
      "nnnc": 256,
      "CCCCOC": 257,
      "*])": 258,
      "occc": 259,
      "CSCCC": 260,
      "CON": 261,
      "10": 262,
      "CCCCCCCCCCC": 263,
      "Nn": 264,
      "Brc": 265,
      "OCCOc": 266,
      "+]=[": 267,
      "CSCc": 268,
      "CCCCn": 269,
      "ns": 270,
      "NCCCc": 271,
      "ncnn": 272,
      "nsc": 273,
      "cnnn": 274,
      "-])(": 275,
      "CF": 276,
      "OCCNC": 277,
      "OCOC": 278,
      "co": 279,
      "NCCOc": 280,
      "COCCNC": 281,
      "OO": 282,
      "nncn": 283,
      "CCCCS": 284,
      "CCCCCN": 285,
      "cncnc": 286,
      "cscn": 287,
      "CNCC": 288,
      "NCCn": 289,
      "][": 290,
      "NCCO": 291,
      "#[": 292,
      "OCCOCCOCCOCC": 293,
      "NCCCCC": 294,
      "CCCOCC": 295,
      "COCCn": 296,
      "NCCS": 297,
      "65": 298,
      "CCCCCCCCCCCCC": 299,
      "([*])": 300,
      "11": 301,
      "-]#[": 302,
      "CCOP": 303,
      "ncsc": 304,
      "SCCC": 305,
      "CCCCCNC": 306,
      "CP": 307,
      "CCCCCc": 308,
      "NCCCN": 309,
      "CCCCCCCCCCCCCC": 310,
      "nonc": 311,
      "COCCOc": 312,
      "OB": 313,
      "NCCCn": 314,
      "[*])": 315,
      "24": 316,
      "CCCCCOc": 317,
      "CCOCc": 318,
      "NCCOC": 319,
      "SiH": 320,
      "nncc": 321,
      "NOCC": 322,
      "CCBr": 323,
      "CCCCCCCCCCCCCCC": 324,
      "CCCSc": 325,
      "CH": 326,
      "CCCCCCCCCCCCCCCCC": 327,
      "ccncn": 328,
      "42": 329,
      "Se": 330,
      "56": 331,
      "CCCCCCCCCCCCCCCCCC": 332,
      "scnc": 333,
      "CCNCC": 334,
      "OCCn": 335,
      "nsnc": 336,
      "COCCOC": 337,
      "cncs": 338,
      "COCCCNC": 339,
      "NCCNc": 340,
      "CCCCCCOc": 341,
      "COCCO": 342,
      "OCCCCC": 343,
      "ccon": 344,
      "CNN": 345,
      "cscc": 346,
      "CI": 347,
      "COCCCN": 348,
      "CCCCl": 349,
      "OCCCc": 350,
      "COS": 351,
      ")[*])": 352,
      "14": 353,
      "CCCCCCc": 354,
      "OCCCCCC": 355,
      "sccn": 356,
      "CCCNS": 357,
      "nnsc": 358,
      "-]=[": 359,
      "CCCSC": 360,
      "ncncc": 361,
      "cccnn": 362,
      "+])=": 363,
      "occ": 364,
      "CCCCNc": 365,
      "OCCCCCCCC": 366,
      "NOCc": 367,
      "NCCCOC": 368,
      "OOC": 369,
      "snc": 370,
      "CCOCCC": 371,
      "76": 372,
      "OCCCNC": 373,
      "NP": 374,
      "SS": 375,
      "COCCCC": 376,
      "Sn": 377,
      "CCCCCCN": 378,
      "nncs": 379,
      "CCCCCOC": 380,
      "NCCOCC": 381,
      "COCCc": 382,
      "CCCCCO": 383,
      "CCON": 384,
      "NCCCCCC": 385,
      "ncoc": 386,
      "COCCOCC": 387,
      "cnoc": 388,
      "CONC": 389,
      "NCCCO": 390,
      "sn": 391,
      "CCCCCn": 392,
      "SCCS": 393,
      "OCCCOc": 394,
      "NNCC": 395,
      "OCCCN": 396,
      "NCCCOCC": 397,
      "COCCNc": 398,
      "snnc": 399,
      "CCCCCCNC": 400,
      "NCCCNC": 401,
      "ClC": 402,
      "CCCCCCCCc": 403,
      "])": 404,
      "+])[": 405,
      "CCCCOCC": 406,
      "ccno": 407,
      "-])([": 408,
      "CCCCCCCCOc": 409,
      "ncco": 410,
      "CCCCCCCCCCCCCCCCCCC": 411,
      "ONC": 412,
      "ncon": 413,
      "cnco": 414,
      "CNNC": 415,
      "CCOCCCNC": 416,
      "NCCSCc": 417,
      "OCCS": 418,
      "](=": 419,
      "CSCCN": 420,
      "35": 421,
      "CCF": 422,
      "SCCN": 423,
      "OCCCn": 424,
      "OCCCCCCCCCCCC": 425,
      "csnn": 426,
      "NNS": 427,
      "NCCSc": 428,
      "CCP": 429,
      "67": 430,
      "CCCCCCCCCCCCCCCCCCCCC": 431,
      "ocnc": 432,
      "OCCCOC": 433,
      "COCOC": 434,
      "Bc": 435,
      "OOO": 436,
      "CCOCCN": 437,
      "ccnnc": 438,
      "CCSCc": 439,
      "NCCOCCOCC": 440,
      "CCCSCC": 441,
      "SCCCC": 442,
      "COCOc": 443,
      "CCOCCOc": 444,
      "COCCOCCOCC": 445,
      "NCCCOc": 446,
      "ClCc": 447,
      "OCCOCCOCCOCCOCCOCCOCCOCC": 448,
      "COCCCn": 449,
      "CCCBr": 450,
      "OCCNc": 451,
      "NCCNS": 452,
      "CCCCCCCOc": 453,
      "CCCCCCOC": 454,
      "53": 455,
      "CCSCCC": 456,
      "oncc": 457,
      "On": 458,
      "CCOCCOC": 459,
      "CCCCSc": 460,
      "41": 461,
      "SCCCS": 462,
      "CCOS": 463,
      "OCCOCCO": 464,
      "-][": 465,
      "CCCCCNc": 466,
      "CCCCCCCc": 467,
      "-](": 468,
      "CNCc": 469,
      "CCCCCCO": 470,
      "CCOCCO": 471,
      "15": 472,
      "As": 473,
      "CCCOCc": 474,
      "CCCCCCCCOC": 475,
      "87": 476,
      "CSCCS": 477,
      "CB": 478,
      "NCCSC": 479,
      "CCOCCn": 480,
      "CSCN": 481,
      "SN": 482,
      "SOOO": 483,
      "cnns": 484,
      "Ic": 485,
      "CCCCCCCCN": 486,
      "CSSCC": 487,
      "NCCCS": 488,
      "OCCSc": 489,
      "CCCCCCn": 490,
      "nnco": 491,
      "CCOCCOCCOCC": 492,
      "OCCCl": 493,
      "OCn": 494,
      "COCCCOc": 495,
      "NCN": 496,
      "OCCCCCCCCCC": 497,
      "OCCCS": 498,
      "CCCCCl": 499
    },
    "merges": [
      "c c",
      "C C",
      "( =",
      "cc c",
      "CC C",
      "C c",
      "+ ]",
      "cc ccc",
      "N C",
      "O C",
      "N H",
      "n c",
      "CC CC",
      ") (",
      "C l",
      "cc cc",
      "O c",
      "N c",
      ") [",
      "- ]",
      "O CC",
      "-] )",
      "C Oc",
      ") (=",
      "n H",
      "( [",
      ") =",
      "CC N",
      "B r",
      "C N",
      "+] (",
      "c n",
      "CC CCC",
      "CC c",
      "C OC",
      "1 2",
      "C O",
      "s c",
      "+] )",
      "n n",
      "N CC",
      "n cc",
      "C S",
      "CC OC",
      "2 1",
      "+] (=",
      "C NC",
      "o c",
      "c nc",
      "N Cc",
      "n nc",
      "CC OCC",
      "CCCC CCCC",
      "O Cc",
      "C n",
      "CC Oc",
      "CCC N",
      "C OCC",
      "2 3",
      "CC NC",
      "S C",
      "3 2",
      "ccc nc",
      "CC O",
      "N N",
      "CS c",
      "CC S",
      "cc nc",
      "N S",
      "ccc s",
      "CCC c",
      "CC n",
      "] (",
      "CCCC CC",
      "S i",
      "C Nc",
      "cc n",
      ")= [",
      "S c",
      "cccc n",
      "+] =",
      "c sc",
      "cn n",
      "ccc o",
      "CCC O",
      "c s",
      "N CCC",
      "cc ncc",
      "nc nc",
      "n o",
      "S CC",
      "N NC",
      "= [",
      "n oc",
      "n ccc",
      "N CCc",
      "O CCC",
      "nc n",
      "CCC NC",
      "OC O",
      ")( [",
      "( -",
      "cn cc",
      "OCC O",
      "cc sc",
      "n cccc",
      "3 4",
      "CCC Oc",
      "4 3",
      "CS C",
      "CC l",
      "CCCC N",
      "CCCC CCC",
      "CC Nc",
      "S Cc",
      "ccc n",
      "* ]",
      "OCC OCC",
      "CCC n",
      "s ccc",
      "(= [",
      "N O",
      "+] ([",
      "CCCC CCCCC",
      "CO Cc",
      "F c",
      "CCC OC",
      "O CCCC",
      "o n",
      "CCC S",
      "CCCCCCCC CCCCCCCC",
      "C Br",
      "CC SC",
      "CN S",
      "[ *]",
      "ncc n",
      "1 3",
      "CCCC c",
      "-] )[",
      "CCCC O",
      "Cl c",
      "ncc s",
      "CCC Nc",
      "c oc",
      "CO P",
      "cc oc",
      "cnc n",
      "F C",
      "CCS c",
      "COCC N",
      ") -",
      "5 4",
      "CS CC",
      "CCCC NC",
      "CCCC Oc",
      "O P",
      "cc nn",
      "nn n",
      "nccc n",
      "cn ccc",
      "N CCCC",
      "CO CCC",
      "nn nn",
      "O S",
      "-]) =",
      "N Nc",
      "CCS CC",
      "O N",
      "N OC",
      "s cc",
      "CCCCCCCC CCCC",
      "CCN S",
      "cn nc",
      "4 5",
      "+] )(",
      "CCC l",
      "cn ccn",
      "3 1",
      "CCCCCCCC CC",
      "OCC OC",
      "@ @",
      "N CCN",
      "O CCCO",
      "ncc nc",
      "o nc",
      "OCC c",
      "OCC N",
      "NCC NC",
      "nn nc",
      "CCCC OC",
      "*] )",
      "o ccc",
      "CS CCC",
      "CO N",
      "1 0",
      "CCCCCCCC CCC",
      "N n",
      "Br c",
      "OCC Oc",
      "+]= [",
      "CS Cc",
      "CCCC n",
      "n s",
      "N CCCc",
      "nc nn",
      "n sc",
      "cn nn",
      "-] )(",
      "C F",
      "OCC NC",
      "OC OC",
      "c o",
      "NCC Oc",
      "COCC NC",
      "O O",
      "nnc n",
      "CCCC S",
      "CCCCC N",
      "cnc nc",
      "cs cn",
      "CN CC",
      "NCC n",
      "] [",
      "NCC O",
      "# [",
      "OCCOCC OCCOCC",
      "N CCCCC",
      "CCC OCC",
      "COCC n",
      "NCC S",
      "6 5",
      "CCCCCCCC CCCCC",
      "([ *])",
      "1 1",
      "-] #[",
      "CCO P",
      "nc sc",
      "S CCC",
      "CCCCC NC",
      "C P",
      "CCCCC c",
      "N CCCN",
      "CCCCCCCC CCCCCC",
      "no nc",
      "COCC Oc",
      "O B",
      "NCCC n",
      "[*] )",
      "2 4",
      "CCCCC Oc",
      "CC OCc",
      "NCC OC",
      "Si H",
      "nn cc",
      "N OCC",
      "CC Br",
      "CCCCCCCC CCCCCCC",
      "CCC Sc",
      "C H",
      "CCCCCCCC CCCCCCCCC",
      "ccnc n",
      "4 2",
      "S e",
      "5 6",
      "CCCCCCCCCCCCCCCC CC",
      "sc nc",
      "CCN CC",
      "OCC n",
      "ns nc",
      "COCC OC",
      "cnc s",
      "CO CCCNC",
      "NCC Nc",
      "CCCC CCOc",
      "COCC O",
      "OCC CCC",
      "cc on",
      "CN N",
      "cs cc",
      "C I",
      "CO CCCN",
      "CCCC l",
      "O CCCc",
      "CO S",
      ")[ *])",
      "1 4",
      "CCCC CCc",
      "O CCCCCC",
      "s ccn",
      "CCCN S",
      "nn sc",
      "-] =[",
      "CCC SC",
      "nc ncc",
      "ccc nn",
      "+] )=",
      "o cc",
      "CCCC Nc",
      "O CCCCCCCC",
      "N OCc",
      "NCCC OC",
      "O OC",
      "s nc",
      "CCO CCC",
      "7 6",
      "OCCC NC",
      "N P",
      "S S",
      "CO CCCC",
      "S n",
      "CCCC CCN",
      "nnc s",
      "CCCCC OC",
      "NCC OCC",
      "COCC c",
      "CCCCC O",
      "CCO N",
      "N CCCCCC",
      "nc oc",
      "COCC OCC",
      "cn oc",
      "CO NC",
      "N CCCO",
      "s n",
      "CCCCC n",
      "S CCS",
      "OCCC Oc",
      "N NCC",
      "O CCCN",
      "NCCC OCC",
      "COCC Nc",
      "s nnc",
      "CCCC CCNC",
      "NCCC NC",
      "Cl C",
      "CCCCCCCC c",
      "] )",
      "+] )[",
      "CCCC OCC",
      "ccn o",
      "-] )([",
      "CCCCCCCC Oc",
      "ncc o",
      "CCCCCCCCCCCCCCCC CCC",
      "O NC",
      "nc on",
      "cnc o",
      "CN NC",
      "CCO CCCNC",
      "NCC SCc",
      "OCC S",
      "] (=",
      "CS CCN",
      "3 5",
      "CC F",
      "S CCN",
      "OCCC n",
      "O CCCCCCCCCCCC",
      "cs nn",
      "NN S",
      "NCC Sc",
      "CC P",
      "6 7",
      "CCCCCCCCCCCCCCCC CCCCC",
      "oc nc",
      "OCCC OC",
      "COC OC",
      "B c",
      "OO O",
      "CCOCC N",
      "cc nnc",
      "CCS Cc",
      "NCC OCCOCC",
      "CCC SCC",
      "S CCCC",
      "COC Oc",
      "CCOCC Oc",
      "COCC OCCOCC",
      "NCCC Oc",
      "Cl Cc",
      "OCCOCCOCCOCC OCCOCCOCCOCC",
      "CO CCCn",
      "CCC Br",
      "OCC Nc",
      "N CCNS",
      "CCCC CCCOc",
      "CCCC CCOC",
      "5 3",
      "CCS CCC",
      "o ncc",
      "O n",
      "CCOCC OC",
      "CCCC Sc",
      "4 1",
      "S CCCS",
      "CCO S",
      "OCC OCCO",
      "-] [",
      "CCCCC Nc",
      "CCCC CCCc",
      "-] (",
      "CN Cc",
      "CCCC CCO",
      "CCOCC O",
      "1 5",
      "A s",
      "CCC OCc",
      "CCCCCCCC OC",
      "8 7",
      "CS CCS",
      "C B",
      "NCC SC",
      "CCOCC n",
      "CS CN",
      "S N",
      "S OOO",
      "cnn s",
      "I c",
      "CCCCCCCC N",
      "CS SCC",
      "NCCC S",
      "OCC Sc",
      "CCCC CCn",
      "nnc o",
      "CCOCC OCCOCC",
      "OCCC l",
      "OC n",
      "CO CCCOc",
      "NC N",
      "O CCCCCCCCCC",
      "OCCC S",
      "CCCCC l"
    ]
  }
}