{
  "version": "1.0",
  "truncation": {
    "max_length": 150,
    "strategy": "OnlyFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 150
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 202,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 200,
      "special": false,
      "content": "<start>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 201,
      "special": false,
      "content": "<end>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFKC"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "model": {
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "#": 0,
      "%": 1,
      "(": 2,
      ")": 3,
      "*": 4,
      "+": 5,
      "-": 6,
      "/": 7,
      "0": 8,
      "1": 9,
      "2": 10,
      "3": 11,
      "4": 12,
      "5": 13,
      "6": 14,
      "7": 15,
      "8": 16,
      "9": 17,
      "=": 18,
      "@": 19,
      "A": 20,
      "B": 21,
      "C": 22,
      "D": 23,
      "E": 24,
      "F": 25,
      "G": 26,
      "H": 27,
      "I": 28,
      "K": 29,
      "L": 30,
      "M": 31,
      "N": 32,
      "O": 33,
      "P": 34,
      "R": 35,
      "S": 36,
      "T": 37,
      "U": 38,
      "V": 39,
      "W": 40,
      "X": 41,
      "Y": 42,
      "Z": 43,
      "[": 44,
      "\\": 45,
      "]": 46,
      "a": 47,
      "b": 48,
      "c": 49,
      "d": 50,
      "e": 51,
      "f": 52,
      "g": 53,
      "h": 54,
      "i": 55,
      "k": 56,
      "l": 57,
      "m": 58,
      "n": 59,
      "o": 60,
      "p": 61,
      "r": 62,
      "s": 63,
      "t": 64,
      "u": 65,
      "y": 66,
      "Ċ": 67,
      "cc": 68,
      "CC": 69,
      "(=": 70,
      "ccc": 71,
      "CCC": 72,
      "Cc": 73,
      "+]": 74,
      "ccccc": 75,
      "NC": 76,
      "OC": 77,
      "NH": 78,
      "nc": 79,
      "CCCC": 80,
      ")(": 81,
      "Cl": 82,
      "cccc": 83,
      "Oc": 84,
      "Nc": 85,
      ")[": 86,
      "-]": 87,
      "(-": 88,
      "OCC": 89,
      "-])": 90,
      "COc": 91,
      ")(=": 92,
      "nH": 93,
      "([": 94,
      ")=": 95,
      "CCN": 96,
      "Br": 97,
      "CN": 98,
      "+](": 99,
      "cn": 100,
      "CCCCC": 101,
      "CCc": 102,
      "COC": 103,
      "12": 104,
      "CO": 105,
      "sc": 106,
      "+])": 107,
      "nn": 108,
      "NCC": 109,
      "ncc": 110,
      "CS": 111,
      "CCOC": 112,
      "+](=": 113,
      "21": 114,
      "CNC": 115,
      "oc": 116,
      "cnc": 117,
      "NCc": 118,
      "nnc": 119,
      "CCOCC": 120,
      "CCCCCCCC": 121,
      "OCc": 122,
      "Cn": 123,
      "CCOc": 124,
      "CCCN": 125,
      "23": 126,
      "COCC": 127,
      "CCNC": 128,
      "SC": 129,
      "cccnc": 130,
      "CCO": 131,
      "NN": 132,
      "32": 133,
      "CSc": 134,
      "CCS": 135,
      "ccnc": 136,
      "NS": 137,
      "cccs": 138,
      "CCCc": 139,
      "CCn": 140,
      "](": 141,
      "CCCCCC": 142,
      "Si": 143,
      "CNc": 144,
      "ccn": 145,
      "csc": 146,
      "Sc": 147,
      ")=[": 148,
      "ccccn": 149,
      "+]=": 150,
      "cnn": 151,
      "ccco": 152,
      "CCCO": 153,
      "cs": 154,
      "NCCC": 155,
      "ccncc": 156,
      "ncnc": 157,
      "no": 158,
      "SCC": 159,
      "noc": 160,
      "NNC": 161,
      "=[": 162,
      "nccc": 163,
      "NCCc": 164,
      "OCCC": 165,
      "ncn": 166,
      "34": 167,
      "CCCNC": 168,
      "OCO": 169,
      ")([": 170,
      "cncc": 171,
      "OCCO": 172,
      "ccsc": 173,
      "ncccc": 174,
      "CCCOc": 175,
      "CSC": 176,
      "CCl": 177,
      "CCCCN": 178,
      "CCCCCCC": 179,
      "CCNc": 180,
      "SCc": 181,
      "cccn": 182,
      "43": 183,
      "OCCOCC": 184,
      "CCCn": 185,
      "sccc": 186,
      "(=[": 187,
      "NO": 188,
      "+]([": 189,
      "CCCCCCCCC": 190,
      "COCc": 191,
      "Fc": 192,
      "CCCOC": 193,
      "OCCCC": 194,
      "on": 195,
      "CCCS": 196,
      "CCCCCCCCCCCCCCCC": 197,
      "CBr": 198,
      "CCSC": 199
    },
    "merges": [
      "c c",
      "C C",
      "( =",
      "cc c",
      "CC C",
      "C c",
      "+ ]",
      "cc ccc",
      "N C",
      "O C",
      "N H",
      "n c",
      "CC CC",
      ") (",
      "C l",
      "cc cc",
      "O c",
      "N c",
      ") [",
      "- ]",
      "( -",
      "O CC",
      "-] )",
      "C Oc",
      ") (=",
      "n H",
      "( [",
      ") =",
      "CC N",
      "B r",
      "C N",
      "+] (",
      "c n",
      "CC CCC",
      "CC c",
      "C OC",
      "1 2",
      "C O",
      "s c",
      "+] )",
      "n n",
      "N CC",
      "n cc",
      "C S",
      "CC OC",
      "+] (=",
      "2 1",
      "C NC",
      "o c",
      "c nc",
      "N Cc",
      "n nc",
      "CC OCC",
      "CCCC CCCC",
      "O Cc",
      "C n",
      "CC Oc",
      "CCC N",
      "2 3",
      "C OCC",
      "CC NC",
      "S C",
      "ccc nc",
      "CC O",
      "N N",
      "3 2",
      "CS c",
      "CC S",
      "cc nc",
      "N S",
      "ccc s",
      "CCC c",
      "CC n",
      "] (",
      "CCCC CC",
      "S i",
      "C Nc",
      "cc n",
      "c sc",
      "S c",
      ")= [",
      "cccc n",
      "+] =",
      "cn n",
      "ccc o",
      "CCC O",
      "c s",
      "N CCC",
      "cc ncc",
      "nc nc",
      "n o",
      "S CC",
      "n oc",
      "N NC",
      "= [",
      "n ccc",
      "N CCc",
      "O CCC",
      "nc n",
      "3 4",
      "CCC NC",
      "OC O",
      ")( [",
      "cn cc",
      "OCC O",
      "cc sc",
      "n cccc",
      "CCC Oc",
      "CS C",
      "CC l",
      "CCCC N",
      "CCCC CCC",
      "CC Nc",
      "S Cc",
      "ccc n",
      "4 3",
      "OCC OCC",
      "CCC n",
      "s ccc",
      "(= [",
      "N O",
      "+] ([",
      "CCCC CCCCC",
      "CO Cc",
      "F c",
      "CCC OC",
      "O CCCC",
      "o n",
      "CCC S",
      "CCCCCCCC CCCCCCCC",
      "C Br",
      "CC SC"
    ]
  }
}