{
  "version": "1.0",
  "truncation": {
    "max_length": 150,
    "strategy": "OnlyFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 150
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "special": true,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 1,
      "special": true,
      "content": "<start>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 2,
      "special": true,
      "content": "<end>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 3,
      "special": true,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFKC"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "model": {
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "#": 0,
      "%": 1,
      "(": 2,
      ")": 3,
      "*": 4,
      "+": 5,
      "-": 6,
      "/": 7,
      "0": 8,
      "1": 9,
      "2": 10,
      "3": 11,
      "4": 12,
      "5": 13,
      "6": 14,
      "7": 15,
      "8": 16,
      "9": 17,
      "=": 18,
      "@": 19,
      "A": 20,
      "B": 21,
      "C": 22,
      "D": 23,
      "E": 24,
      "F": 25,
      "G": 26,
      "H": 27,
      "I": 28,
      "K": 29,
      "L": 30,
      "M": 31,
      "N": 32,
      "O": 33,
      "P": 34,
      "R": 35,
      "S": 36,
      "T": 37,
      "U": 38,
      "V": 39,
      "W": 40,
      "X": 41,
      "Y": 42,
      "Z": 43,
      "[": 44,
      "\\": 45,
      "]": 46,
      "a": 47,
      "b": 48,
      "c": 49,
      "d": 50,
      "e": 51,
      "f": 52,
      "g": 53,
      "h": 54,
      "i": 55,
      "k": 56,
      "l": 57,
      "m": 58,
      "n": 59,
      "o": 60,
      "p": 61,
      "r": 62,
      "s": 63,
      "t": 64,
      "u": 65,
      "y": 66,
      "Ċ": 67,
      "cc": 68,
      "CC": 69,
      "(=": 70,
      "ccc": 71,
      "CCC": 72,
      "Cc": 73,
      "+]": 74,
      "ccccc": 75,
      "NC": 76,
      "OC": 77,
      "NH": 78,
      "nc": 79,
      "CCCC": 80,
      ")(": 81,
      "Cl": 82,
      "cccc": 83,
      "Oc": 84,
      "Nc": 85,
      ")[": 86,
      "-]": 87,
      "OCC": 88,
      "-])": 89,
      "COc": 90,
      ")(=": 91,
      "nH": 92,
      "([": 93,
      ")=": 94,
      "CCN": 95,
      "Br": 96,
      "CN": 97,
      "+](": 98,
      "cn": 99,
      "CCCCC": 100,
      "CCc": 101,
      "COC": 102,
      "12": 103,
      "CO": 104,
      "sc": 105,
      "+])": 106,
      "nn": 107,
      "NCC": 108,
      "ncc": 109,
      "CS": 110,
      "CCOC": 111,
      "21": 112,
      "+](=": 113,
      "CNC": 114,
      "oc": 115,
      "cnc": 116,
      "NCc": 117,
      "nnc": 118,
      "CCOCC": 119,
      "CCCCCCCC": 120,
      "OCc": 121,
      "Cn": 122,
      "CCOc": 123,
      "CCCN": 124,
      "COCC": 125,
      "23": 126,
      "CCNC": 127,
      "SC": 128,
      "32": 129,
      "cccnc": 130,
      "CCO": 131,
      "NN": 132,
      "CSc": 133,
      "CCS": 134,
      "ccnc": 135,
      "NS": 136,
      "cccs": 137,
      "CCCc": 138,
      "CCn": 139,
      "](": 140,
      "CCCCCC": 141,
      "Si": 142,
      "CNc": 143,
      "ccn": 144,
      ")=[": 145,
      "Sc": 146,
      "ccccn": 147,
      "+]=": 148,
      "csc": 149,
      "cnn": 150,
      "ccco": 151,
      "CCCO": 152,
      "cs": 153,
      "NCCC": 154,
      "ccncc": 155,
      "ncnc": 156,
      "no": 157,
      "SCC": 158,
      "NNC": 159,
      "=[": 160,
      "noc": 161,
      "nccc": 162,
      "NCCc": 163,
      "OCCC": 164,
      "ncn": 165,
      "CCCNC": 166,
      "OCO": 167,
      ")([": 168,
      "(-": 169,
      "cncc": 170,
      "OCCO": 171,
      "ccsc": 172,
      "ncccc": 173,
      "34": 174,
      "CCCOc": 175,
      "43": 176,
      "CSC": 177,
      "CCl": 178,
      "CCCCN": 179,
      "CCCCCCC": 180,
      "CCNc": 181,
      "SCc": 182,
      "cccn": 183,
      "*]": 184,
      "OCCOCC": 185,
      "CCCn": 186,
      "sccc": 187,
      "(=[": 188,
      "NO": 189,
      "+]([": 190,
      "CCCCCCCCC": 191,
      "COCc": 192,
      "Fc": 193,
      "CCCOC": 194,
      "OCCCC": 195,
      "on": 196,
      "CCCS": 197,
      "CCCCCCCCCCCCCCCC": 198,
      "CBr": 199,
      "CCSC": 200,
      "CNS": 201,
      "[*]": 202,
      "nccn": 203,
      "13": 204,
      "CCCCc": 205,
      "-])[": 206,
      "CCCCO": 207,
      "Clc": 208,
      "nccs": 209,
      "CCCNc": 210,
      "coc": 211,
      "COP": 212,
      "ccoc": 213,
      "cncn": 214,
      "FC": 215,
      "CCSc": 216,
      "COCCN": 217,
      ")-": 218,
      "54": 219,
      "CSCC": 220,
      "CCCCNC": 221,
      "CCCCOc": 222,
      "OP": 223,
      "ccnn": 224,
      "nnn": 225,
      "ncccn": 226,
      "cnccc": 227,
      "NCCCC": 228,
      "COCCC": 229,
      "nnnn": 230,
      "OS": 231,
      "-])=": 232,
      "NNc": 233,
      "CCSCC": 234,
      "ON": 235,
      "NOC": 236,
      "scc": 237,
      "CCCCCCCCCCCC": 238,
      "CCNS": 239,
      "cnnc": 240,
      "45": 241,
      "+])(": 242,
      "CCCl": 243,
      "cnccn": 244,
      "31": 245,
      "CCCCCCCCCC": 246,
      "OCCOC": 247,
      "@@": 248,
      "NCCN": 249,
      "OCCCO": 250,
      "nccnc": 251,
      "onc": 252,
      "OCCc": 253,
      "OCCN": 254,
      "NCCNC": 255,
      "nnnc": 256,
      "CCCCOC": 257,
      "*])": 258,
      "occc": 259,
      "CSCCC": 260,
      "CON": 261,
      "10": 262,
      "CCCCCCCCCCC": 263,
      "Nn": 264,
      "Brc": 265,
      "OCCOc": 266,
      "+]=[": 267,
      "CSCc": 268,
      "CCCCn": 269,
      "ns": 270,
      "NCCCc": 271,
      "ncnn": 272,
      "nsc": 273,
      "cnnn": 274,
      "-])(": 275,
      "CF": 276,
      "OCCNC": 277,
      "OCOC": 278,
      "co": 279,
      "NCCOc": 280,
      "COCCNC": 281,
      "OO": 282,
      "nncn": 283,
      "CCCCS": 284,
      "CCCCCN": 285,
      "cncnc": 286,
      "cscn": 287,
      "CNCC": 288,
      "NCCn": 289,
      "][": 290,
      "NCCO": 291,
      "#[": 292,
      "OCCOCCOCCOCC": 293,
      "NCCCCC": 294,
      "CCCOCC": 295,
      "COCCn": 296,
      "NCCS": 297,
      "65": 298,
      "CCCCCCCCCCCCC": 299,
      "([*])": 300,
      "11": 301,
      "-]#[": 302,
      "CCOP": 303,
      "ncsc": 304,
      "SCCC": 305,
      "CCCCCNC": 306,
      "CP": 307,
      "CCCCCc": 308,
      "NCCCN": 309,
      "CCCCCCCCCCCCCC": 310,
      "nonc": 311,
      "COCCOc": 312,
      "OB": 313,
      "NCCCn": 314,
      "[*])": 315,
      "24": 316,
      "CCCCCOc": 317,
      "CCOCc": 318,
      "NCCOC": 319,
      "SiH": 320,
      "nncc": 321,
      "NOCC": 322,
      "CCBr": 323,
      "CCCCCCCCCCCCCCC": 324,
      "CCCSc": 325,
      "CH": 326,
      "CCCCCCCCCCCCCCCCC": 327,
      "ccncn": 328,
      "42": 329,
      "Se": 330,
      "56": 331,
      "CCCCCCCCCCCCCCCCCC": 332,
      "scnc": 333,
      "CCNCC": 334,
      "OCCn": 335,
      "nsnc": 336,
      "COCCOC": 337,
      "cncs": 338,
      "COCCCNC": 339,
      "NCCNc": 340,
      "CCCCCCOc": 341,
      "COCCO": 342,
      "OCCCCC": 343,
      "ccon": 344,
      "CNN": 345,
      "cscc": 346,
      "CI": 347,
      "COCCCN": 348,
      "CCCCl": 349,
      "OCCCc": 350,
      "COS": 351,
      ")[*])": 352,
      "14": 353,
      "CCCCCCc": 354,
      "OCCCCCC": 355,
      "sccn": 356,
      "CCCNS": 357,
      "nnsc": 358,
      "-]=[": 359,
      "CCCSC": 360,
      "ncncc": 361,
      "cccnn": 362,
      "+])=": 363,
      "occ": 364,
      "CCCCNc": 365,
      "OCCCCCCCC": 366,
      "NOCc": 367,
      "NCCCOC": 368,
      "OOC": 369,
      "snc": 370,
      "CCOCCC": 371,
      "76": 372,
      "OCCCNC": 373,
      "NP": 374,
      "SS": 375,
      "COCCCC": 376,
      "Sn": 377,
      "CCCCCCN": 378,
      "nncs": 379,
      "CCCCCOC": 380,
      "NCCOCC": 381,
      "COCCc": 382,
      "CCCCCO": 383,
      "CCON": 384,
      "NCCCCCC": 385,
      "ncoc": 386,
      "COCCOCC": 387,
      "cnoc": 388,
      "CONC": 389,
      "NCCCO": 390,
      "sn": 391,
      "CCCCCn": 392,
      "SCCS": 393,
      "OCCCOc": 394,
      "NNCC": 395,
      "OCCCN": 396,
      "NCCCOCC": 397,
      "COCCNc": 398,
      "snnc": 399,
      "CCCCCCNC": 400,
      "NCCCNC": 401,
      "ClC": 402,
      "CCCCCCCCc": 403,
      "])": 404,
      "+])[": 405,
      "CCCCOCC": 406,
      "ccno": 407,
      "-])([": 408,
      "CCCCCCCCOc": 409,
      "ncco": 410,
      "CCCCCCCCCCCCCCCCCCC": 411,
      "ONC": 412,
      "ncon": 413,
      "cnco": 414,
      "CNNC": 415,
      "CCOCCCNC": 416,
      "NCCSCc": 417,
      "OCCS": 418,
      "](=": 419,
      "CSCCN": 420,
      "35": 421,
      "CCF": 422,
      "SCCN": 423,
      "OCCCn": 424,
      "OCCCCCCCCCCCC": 425,
      "csnn": 426,
      "NNS": 427,
      "NCCSc": 428,
      "CCP": 429,
      "67": 430,
      "CCCCCCCCCCCCCCCCCCCCC": 431,
      "ocnc": 432,
      "OCCCOC": 433,
      "COCOC": 434,
      "Bc": 435,
      "OOO": 436,
      "CCOCCN": 437,
      "ccnnc": 438,
      "CCSCc": 439,
      "NCCOCCOCC": 440,
      "CCCSCC": 441,
      "SCCCC": 442,
      "COCOc": 443,
      "CCOCCOc": 444,
      "COCCOCCOCC": 445,
      "NCCCOc": 446,
      "ClCc": 447,
      "OCCOCCOCCOCCOCCOCCOCCOCC": 448,
      "COCCCn": 449,
      "CCCBr": 450,
      "OCCNc": 451,
      "NCCNS": 452,
      "CCCCCCCOc": 453,
      "CCCCCCOC": 454,
      "53": 455,
      "CCSCCC": 456,
      "oncc": 457,
      "On": 458,
      "CCOCCOC": 459,
      "CCCCSc": 460,
      "41": 461,
      "SCCCS": 462,
      "CCOS": 463,
      "OCCOCCO": 464,
      "-][": 465,
      "CCCCCNc": 466,
      "CCCCCCCc": 467,
      "-](": 468,
      "CNCc": 469,
      "CCCCCCO": 470,
      "CCOCCO": 471,
      "15": 472,
      "As": 473,
      "CCCOCc": 474,
      "CCCCCCCCOC": 475,
      "87": 476,
      "CSCCS": 477,
      "CB": 478,
      "NCCSC": 479,
      "CCOCCn": 480,
      "CSCN": 481,
      "SN": 482,
      "SOOO": 483,
      "cnns": 484,
      "Ic": 485,
      "CCCCCCCCN": 486,
      "CSSCC": 487,
      "NCCCS": 488,
      "OCCSc": 489,
      "CCCCCCn": 490,
      "nnco": 491,
      "CCOCCOCCOCC": 492,
      "OCCCl": 493,
      "OCn": 494,
      "COCCCOc": 495,
      "NCN": 496,
      "OCCCCCCCCCC": 497,
      "OCCCS": 498,
      "CCCCCl": 499,
      "CCCCCCCCCCCCCCCCCCCC": 500,
      "se": 501,
      "CCCOCCC": 502,
      "64": 503,
      "SCCOc": 504,
      "CCCCCCCCCCOc": 505,
      "CCCCCCCN": 506,
      "SCCc": 507,
      "BrC": 508,
      "BC": 509,
      "SCCNC": 510,
      "OCN": 511,
      "CCCCNS": 512,
      "CCCCCCCCCCCCOc": 513,
      "CCCF": 514,
      "SSc": 515,
      "CCNN": 516,
      "(/": 517,
      "ncns": 518,
      "SCCO": 519,
      "OCCCCCCC": 520,
      "COCCCNc": 521,
      "ClCC": 522,
      "OCOCC": 523,
      "CCCCCCCCCc": 524,
      "CCONC": 525,
      "NCCCCc": 526,
      "CCCCCS": 527,
      "OCOc": 528,
      "Ge": 529,
      "@]": 530,
      "OCCOCCOC": 531,
      "cnsn": 532,
      "16": 533,
      "CCOCCCC": 534,
      "CCCCCCCCCCCCc": 535,
      "CCOCCOCC": 536,
      "OCCCCOc": 537,
      "@@]": 538,
      "COCCNS": 539,
      "COCO": 540,
      "nnccc": 541,
      "NCCOCCO": 542,
      "OCCF": 543,
      "CCCCCCCCCCc": 544,
      "NCCCNc": 545,
      "CCOCCCN": 546,
      "COCCS": 547,
      "Pc": 548,
      "CCOCCNC": 549,
      "CNCCC": 550,
      "SCCSC": 551,
      "SSC": 552,
      "OCCCCCCCCC": 553,
      "CSCCO": 554,
      "78": 555,
      "CSCCNC": 556,
      "CCNCc": 557,
      "NCCCCCCC": 558,
      "CCCCCCCCCCCCOC": 559,
      "+][": 560,
      "OCCCCCCOc": 561,
      "CCCCCCCOC": 562,
      "OCCCCn": 563,
      "OCCCNc": 564,
      "CCCCCCCCCCCCCCCCCCCCCC": 565,
      "OCCCCOC": 566,
      "Te": 567,
      "OCCCCO": 568,
      "OCCOCCOCCOC": 569,
      "ncno": 570,
      "CCCCSC": 571,
      "46": 572,
      "COCCOCCNC": 573,
      "CCOCn": 574,
      "CCCCCCCCNC": 575,
      ")[*]": 576,
      "CCCCCCCCCCOC": 577,
      "(#": 578,
      "NCCCCN": 579,
      "cocn": 580,
      "CCCCCCCCCOC": 581,
      ")/": 582,
      "17": 583,
      "NNCc": 584,
      "+]#": 585,
      "CSCCCC": 586,
      "COCCCCC": 587,
      "NCCCCn": 588,
      "NOc": 589,
      "conc": 590,
      "COn": 591,
      "CCCCCCNc": 592,
      "NCCCl": 593,
      "CCCCBr": 594,
      "OCCCCCCCCCCCCCCCC": 595,
      "CCSS": 596,
      "COCCOCCC": 597,
      "CCOCCc": 598,
      "CCCCOCCCNC": 599,
      "IH": 600,
      "CNn": 601,
      "COCCCc": 602,
      "NCCCCCO": 603,
      "nocc": 604,
      "BrCC": 605,
      "OCCCCCCOC": 606,
      "NCCCSc": 607,
      "cocc": 608,
      "CCOCCCn": 609,
      "OCCOCCC": 610,
      "CCCP": 611,
      "98": 612,
      "COO": 613,
      "OCCSC": 614,
      "OCCOCCOc": 615,
      "25": 616,
      "NCCCCCCCC": 617,
      "Al": 618,
      "CCCCCCCCCOc": 619,
      "CCCOP": 620,
      "]([": 621,
      "NSc": 622,
      "OCCCCc": 623,
      "NCCCCCCNC": 624,
      "CCI": 625,
      "CCCCOCCC": 626,
      "cccccc": 627,
      "OCCNS": 628,
      "SSSS": 629,
      "CCCCCCCCCCCCCCCCCCCCCCC": 630,
      "PC": 631,
      "NCCCCO": 632,
      "CCCNCC": 633,
      "OCCOCc": 634,
      "18": 635,
      "OCCCCCOc": 636,
      "COCN": 637,
      "NCl": 638,
      "BrCc": 639,
      "COB": 640,
      "CCCCCSc": 641,
      "CCCON": 642,
      "OCCBr": 643,
      "])(": 644,
      "OCF": 645,
      "CCCCCCCNC": 646,
      "CCCCCCCCn": 647,
      "123": 648,
      "OCCCCN": 649,
      "cnsc": 650,
      "CCCOCCOC": 651,
      "CCCCOP": 652,
      "52": 653,
      "NCCCCNC": 654,
      "+]#[": 655,
      "NOS": 656,
      "COCn": 657,
      "COCCCS": 658,
      "CNCCS": 659,
      "CCCCCCCCCCCCCCOc": 660,
      "NCCCCCc": 661,
      "SCCCCC": 662,
      "CCCCOCc": 663,
      "CNOC": 664,
      "CCCCOCCOCC": 665,
      "OCP": 666,
      "COOC": 667,
      "NCCCCOc": 668,
      "37": 669,
      "OCCOCCOCCO": 670,
      "75": 671,
      "CCOCCS": 672,
      "CCCSCc": 673,
      "CCCCCCCCCCCCCCCCCCCCCCCC": 674,
      "NCCF": 675,
      "COCCOCCCC": 676,
      "sncc": 677,
      "]=": 678,
      "COCOCC": 679,
      "NSC": 680,
      "CCCCCCCCCCCCN": 681,
      "19": 682,
      "CCCCCNS": 683,
      "NCCCCCCO": 684,
      "CNCCN": 685,
      "NCCCOCc": 686,
      "CCOCCNc": 687,
      "OCCCCCCCCCCC": 688,
      "=[*])": 689,
      "OCNC": 690,
      "Hg": 691,
      "SCCCN": 692,
      "132": 693,
      "OCCOCCOCCOCCO": 694,
      "NOCCC": 695,
      "314": 696,
      "OOOO": 697,
      "CONCc": 698,
      "51": 699,
      "OCCCCCCCCCCCCCCCCCC": 700,
      "COCCOCc": 701,
      "CCCCCCCCCCCCNC": 702,
      "NCNC": 703,
      "COCCOCCOC": 704,
      "OOc": 705,
      "CCCCCCCCCCCCCCCCCCOC": 706,
      "OCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCC": 707,
      "NCS": 708,
      "ccns": 709,
      "CCOCCOCCOCCOCCOCC": 710,
      "CCCCCCCCCCCc": 711,
      "CCCCCCS": 712,
      "CCCCCCCCCCCCCCCCOC": 713,
      "89": 714,
      "NCCOCCOCCNC": 715,
      "CCCCCCCCCCN": 716,
      "CCCCCCOCC": 717,
      "nscc": 718,
      "CCCCCBr": 719,
      "ccsn": 720,
      "CCCCP": 721,
      "ncncn": 722,
      "OF": 723,
      "SCCOC": 724,
      "CSN": 725,
      "SCCCc": 726,
      "20": 727,
      "NCCCNS": 728,
      "NCCCOCCO": 729,
      "CCCCCCCn": 730,
      "CCCOS": 731,
      "OCCCCNC": 732,
      "CCCCOCCOc": 733,
      "SNC": 734,
      "OCCCCl": 735,
      "NCCOCc": 736,
      "SCCCO": 737,
      "OCCCCCCCCCCCCCC": 738,
      "CCOCCCNc": 739,
      "CSCCCNC": 740,
      "CNO": 741,
      "CCCCCCCCCCCCCCCCCCCCCCCCC": 742,
      "CCCCCCCCCCCCCCCc": 743,
      "CCCCCCCCCCCCCCOC": 744,
      "CSCCc": 745,
      "CCCCCOCC": 746,
      "COCCOCCOc": 747,
      "CCOCCOCCOC": 748,
      "nnns": 749,
      "OOCC": 750,
      "NCCCCl": 751,
      "NCCCCSC": 752,
      "CCCCCCCCCCCOC": 753,
      "CCCCCCCCCCCCCCCCCCNC": 754,
      "OCOCc": 755,
      "BB": 756,
      "PP": 757,
      "NCCSCCCO": 758,
      "COCCCOC": 759,
      "NCCCSC": 760,
      "ClCCc": 761,
      "OCS": 762,
      "SCCCCCC": 763,
      "ccs": 764,
      "CSSC": 765,
      "CCCCCCCCCCCCCCCCOc": 766,
      "NCOc": 767,
      "CCCCCCCCCCNC": 768,
      "CCCCCCCCCN": 769,
      "CCCCCCl": 770,
      "SP": 771,
      "OCl": 772,
      "CSCCOc": 773,
      "CCCOCCOCC": 774,
      "ONc": 775,
      "CCCCOCCOC": 776,
      "CCCCCCCCNc": 777,
      "-])=[": 778,
      "CCSCCNC": 779,
      "109": 780,
      "NCCCCCCCCCCCC": 781,
      "CCNCCC": 782,
      "OCCCCCc": 783,
      "NCCCOCCOCC": 784,
      "COCCOCCOCCOCCOCC": 785,
      "CCCCSCC": 786,
      "312": 787,
      "OCCCSc": 788,
      "CCCCCCCCCCCCCCCCCCN": 789,
      "NCCOCCOC": 790,
      "nccnn": 791,
      "COCCSc": 792,
      "IC": 793,
      "NCCOCCC": 794,
      "ssc": 795,
      "NOCCO": 796,
      "OCCCCCCO": 797,
      "COCCOCCOCCOC": 798,
      "CCCOCCOc": 799,
      "PH": 800,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 801,
      "OCCl": 802,
      "CCB": 803,
      "CCCI": 804,
      "NCCCOCCOC": 805,
      "cnncc": 806,
      "57": 807,
      "86": 808,
      "CSCCn": 809,
      "OCOP": 810,
      "CNCCc": 811,
      "FCC": 812,
      "OCCCF": 813,
      "SCN": 814,
      "CCOCCOCCNC": 815,
      "NCCCCOC": 816,
      "BN": 817,
      "36": 818,
      "CCSCCN": 819,
      "CCCCCCCCS": 820,
      "CCCCCCCCCCCCCCc": 821,
      "CCCCCCCCCCCCCCCCOCC": 822,
      "SCCCOc": 823,
      "OCCOCCOCC": 824,
      "CCCCCSC": 825,
      "CCCCCCCCCCCCn": 826,
      "NCO": 827,
      "CCSSCC": 828,
      "OCCOCCOCCOc": 829,
      "csnc": 830,
      "SCCn": 831,
      "NNCCC": 832,
      "OCCOP": 833,
      "OCOCCOC": 834,
      "22": 835,
      "NCn": 836,
      "OI": 837,
      "CCCCCCCCCCCCCCCCCCOc": 838,
      "COCCOCCOCCOc": 839,
      "-%": 840,
      "CCOCOC": 841,
      "OCCCBr": 842,
      "CCCCCCCO": 843,
      "CCNCCS": 844,
      "CCOCO": 845,
      "CCCCCCCCCCn": 846,
      "OCCCOCC": 847,
      "CCCCCCSc": 848,
      "CCCCCCCCCCCCCCCCCCOCC": 849,
      "CCOCOc": 850,
      "NCCCSCc": 851,
      "CNCCO": 852,
      "@@](": 853,
      "NCCCCNc": 854,
      "OCCCCCO": 855,
      "NCCSCC": 856,
      "NCCCCCCN": 857,
      "CCCCCCCCCNC": 858,
      "NCCCOCCOCCOCCCNC": 859,
      "OCCCOCc": 860,
      "CCOCCOCc": 861,
      "63": 862,
      "FCc": 863,
      "NCCCCCNC": 864,
      "SNc": 865,
      "CSCCNc": 866,
      "26": 867,
      "CCCOCCO": 868,
      "SH": 869,
      "CNOCC": 870,
      "(\\": 871,
      "CCCCON": 872,
      "@](": 873,
      "CONc": 874,
      "COCCCCNC": 875,
      "Sb": 876,
      "BOC": 877,
      "CSS": 878,
      "CSCS": 879,
      "CCCCOCCNC": 880,
      "COCCCCOc": 881,
      "SO": 882,
      "NNN": 883,
      "COCCCNS": 884,
      "CCCCCCCCO": 885,
      "CCCCCCCCCCCCCc": 886,
      "CCOO": 887,
      "NI": 888,
      "CCCCCCCCCCCCCCCCc": 889,
      "CCNNC": 890,
      "OCCOCCOCCOCCOC": 891,
      "COCCONC": 892,
      "CCCCCCCCCCCOc": 893,
      "CCCNN": 894,
      "([*]": 895,
      "CCCCCCSC": 896,
      "CCCOCCc": 897,
      "321": 898,
      "SSSSSSSS": 899,
      "CSCCCCC": 900,
      "COCCOCOc": 901,
      "OCCCCS": 902,
      "CCCCCCCCCn": 903,
      "OCCOS": 904,
      "CCCCCCCl": 905,
      "CCOCN": 906,
      "OCCSCC": 907,
      "OCON": 908,
      "CCCCCCCCCCCCCOC": 909,
      "CCCCCCCCCCCCCCCOC": 910,
      "ClCCC": 911,
      "CCSCCNc": 912,
      "CCCOCCCO": 913,
      "Pb": 914,
      "OCCOCCNC": 915,
      "CCSCCCC": 916,
      "NCCCCCOC": 917,
      "CSCCCN": 918,
      "COCCOCCCNC": 919,
      "CCCCCCCCCCCCCCCCCCCCCCCCCC": 920,
      "CCOCCOCCOCCOCC": 921,
      "CCCCCCCCOCC": 922,
      "CCCCCCCCCCCCS": 923,
      "CCCCCCCCCCCCCCCCCCc": 924,
      "OCCCCCCc": 925,
      "COCCCCCC": 926,
      "NCCCCCN": 927,
      "CCCCCCCCCCS": 928,
      "NCOC": 929,
      "OCCOCCOCCNC": 930,
      "COCCCOCC": 931,
      "CNP": 932,
      "CCCCCCCCCCCCCCCCNC": 933,
      "CONS": 934,
      "CCCCCCCCCCO": 935,
      "OCCCCCCCCOc": 936,
      "COCCCCn": 937,
      "CCCCCCNS": 938,
      "NB": 939,
      "CCCOCCNC": 940,
      "OCCCCCN": 941,
      "OCCOCCCC": 942,
      "CCCCB": 943,
      "])[": 944,
      "SCCNc": 945,
      "SF": 946,
      "SSCC": 947,
      "COOCC": 948,
      "CCCCCCCCCO": 949,
      "CCCCCCCCCOCC": 950,
      "CSP": 951,
      "CCCCCOCc": 952,
      "OOOC": 953,
      "OCCOCCOCCOCCOc": 954,
      "SCCSc": 955,
      "CCOCCCOC": 956,
      "Op": 957,
      "OCCCCCOC": 958,
      "CCCCCCCCCCCCCCCCN": 959,
      "CSCCOC": 960,
      "CCCCCCBr": 961,
      "CSCCCNc": 962,
      "213": 963,
      "CCOCCNS": 964,
      "CCCCCCCCCS": 965,
      "CNNc": 966,
      "OCCCCNc": 967,
      "SOC": 968,
      "CCCCCCCNc": 969,
      "CCCOCCCNC": 970,
      "CCCCCCCCCCCCO": 971,
      "NCCOCCOCCOCCOCC": 972,
      "COCNC": 973,
      "COCCCO": 974,
      "NOCOC": 975,
      "CCCSCCC": 976,
      "CCCOCCN": 977,
      "CCOCCCOc": 978,
      "CCCCF": 979,
      "BH": 980,
      "SCCCCCCCC": 981,
      "CCCOCCn": 982,
      "CCOCCOCCN": 983,
      "62": 984,
      "CCCNCc": 985,
      "CCCCCCCCCCCNC": 986,
      "341": 987,
      "NCCBr": 988,
      "OCCON": 989,
      "CSCCCO": 990,
      "SCl": 991,
      "SCn": 992,
      "COCOCc": 993,
      "pH": 994,
      "OCCCCCCCCCCCCC": 995,
      "COCCCCN": 996,
      "CNOCc": 997,
      "COCCOCOC": 998,
      "CSCCSC": 999,
      "OCCCCCCN": 1000,
      "27": 1001,
      "CSCCCCCC": 1002,
      "CCCCOCCNc": 1003,
      "CCOOC": 1004,
      "OCCOCCN": 1005,
      "OSc": 1006,
      "COCCOCCCOc": 1007,
      "CCCCCCCCCCNc": 1008,
      "CCOCCOCCOCCOCCNC": 1009,
      "NCP": 1010,
      "CCNCCN": 1011,
      "NOCCc": 1012,
      "COCCCOCCOc": 1013,
      "COCCOCCN": 1014,
      "CCSCCCO": 1015,
      "CCSSc": 1016,
      "SCS": 1017,
      "(=[*])": 1018,
      "CCOCCOCCC": 1019,
      "CCOn": 1020,
      "73": 1021,
      "OOCc": 1022,
      "CCCCOCCCN": 1023,
      "COOCc": 1024,
      "CCOCP": 1025,
      "ONN": 1026,
      "231": 1027,
      "NOCCOc": 1028,
      "SCCOCC": 1029,
      "OBOc": 1030,
      "NCCOCCOCCOC": 1031,
      "CSCCCCNc": 1032,
      "CBc": 1033,
      "NCCCCCCCCCCC": 1034,
      "68": 1035,
      "CCCNCCS": 1036,
      "CCSCCOc": 1037,
      "OCCCCCCNC": 1038,
      "OCCSS": 1039,
      "CCCSP": 1040,
      "OOOOOOOO": 1041,
      "OCCCSC": 1042,
      "OCCCCCCCCCCOc": 1043,
      "28": 1044,
      "CCCCCCCCCCCCSC": 1045,
      "ss": 1046,
      "CCCCCCOCc": 1047,
      "48": 1048,
      "NCCOP": 1049,
      "NCCCF": 1050,
      "OCCOCCOCCOCCOCCO": 1051,
      "([*])[": 1052,
      "Bi": 1053,
      "NNCCc": 1054,
      "OCCCCBr": 1055,
      "COCCCSc": 1056,
      "cnon": 1057,
      "OCCCCOCC": 1058,
      "SCCCn": 1059,
      ")([*])": 1060,
      "CSCCCCNC": 1061,
      "]%": 1062,
      "CCOCCCCNC": 1063,
      "CCCCCCCCCCCCCCCCCc": 1064,
      "CCCCCCCCCCCCOCC": 1065,
      "ClCCCc": 1066,
      "COCCOCCNc": 1067,
      "CCCOCCCC": 1068,
      "SI": 1069,
      "CCOCCCc": 1070,
      "CCCCOCCCNc": 1071,
      "NCCSSCCNC": 1072,
      "CCOCCOCCOCCOC": 1073,
      "COCCCCNc": 1074,
      "In": 1075,
      "OCCCSCC": 1076,
      "47": 1077,
      "CCOCCCNS": 1078,
      "COCCOCCn": 1079,
      "Ga": 1080,
      "CCSCCc": 1081,
      "CCCOCCNc": 1082,
      "CCCCOCCN": 1083,
      "=[*]": 1084,
      "op": 1085,
      "ONS": 1086,
      "CCCOCCCNc": 1087,
      "CSSc": 1088,
      "CCOCCCl": 1089,
      "CCCCOCCn": 1090,
      "74": 1091,
      "OCI": 1092,
      "OCCCCCCCCOC": 1093,
      "CCOCCSc": 1094,
      "CCCCI": 1095,
      "BCC": 1096,
      "CCOCCOCCO": 1097,
      "CCSSC": 1098,
      "CCCCCCCS": 1099,
      "onnc": 1100,
      "COCP": 1101,
      "NSN": 1102,
      "CCSSCCC": 1103,
      "NF": 1104,
      "CCCCCCCOCC": 1105,
      "61": 1106,
      "29": 1107,
      "COCCCCCNC": 1108,
      "CSCCCOc": 1109,
      "CCCCCCCCCCCCCCCCCOC": 1110,
      "OSC": 1111,
      "CCCCOS": 1112,
      "COCCCCCCCCCCCCCCCCCC": 1113,
      "CCCCCCCCCCCCCCCCNc": 1114,
      "OCCCCOCCCC": 1115,
      "OBr": 1116,
      "COCCOCCOCCOCCOCCOCCOCCOCCOCC": 1117,
      "CCCCOCCCCC": 1118,
      "SCSC": 1119,
      "CCCCCCCCSc": 1120,
      "CCCCCCCCCCCO": 1121,
      "COCCOCCO": 1122,
      "[*])[": 1123,
      "COCCSCC": 1124,
      "OCCCOP": 1125,
      "CSCCCn": 1126,
      "COCCNCC": 1127,
      "OCNc": 1128,
      "-])-": 1129,
      "nnoc": 1130,
      "+](=[": 1131,
      "CNCCCC": 1132,
      "OCCCCCl": 1133,
      "CCCCCCCCCCCCCCN": 1134,
      "])=": 1135,
      "COCCOCCCNc": 1136,
      "BrCCC": 1137,
      "COCCCCc": 1138,
      "COCCOCCOCCOCC": 1139,
      "CNCCNC": 1140,
      "occn": 1141,
      "CCOCCOCCOCCOCCOCCOCCOCCOCCOCC": 1142,
      "CCCCCCCCCCCCCCNC": 1143,
      "OCCCCCNC": 1144,
      "CCSCCS": 1145,
      "NOCCN": 1146,
      "NCCCCCCNc": 1147,
      "ICC": 1148,
      "30": 1149,
      "CCSP": 1150,
      "CCSCCn": 1151,
      "CCSCCOC": 1152,
      "SCF": 1153,
      "NCNc": 1154,
      "COOc": 1155,
      "CSCCCCCNC": 1156,
      "CCCCSCc": 1157,
      "COCCOCCCOC": 1158,
      "NCCOCCOCCOCCNC": 1159,
      "NCCOCCNC": 1160,
      "OCCSCc": 1161,
      "CCCCOCCOCCNC": 1162,
      "OCCNCC": 1163,
      "CCOB": 1164,
      "pc": 1165,
      "COCCCOCCOC": 1166,
      "COCCOCCc": 1167,
      "NCCCCOCCOC": 1168,
      "NCCNCC": 1169,
      "OCSC": 1170,
      "NCCCBr": 1171,
      "COCCCCOC": 1172,
      "CCCCCCP": 1173,
      "SCCCOC": 1174,
      "CCSCCCOc": 1175,
      "OOP": 1176,
      "COCCOCCOCCO": 1177,
      "ClP": 1178,
      "NCCCCOCC": 1179,
      "CCCCCOP": 1180,
      "OCCCCON": 1181,
      "SCCCCCCCCCCCC": 1182,
      "CCCCCCCCCCCCCCCCS": 1183,
      "315": 1184,
      "NON": 1185,
      "CCCCSCCC": 1186,
      "CCNP": 1187,
      "CCCCCCCCCCCCCCCCn": 1188,
      "NOCO": 1189,
      "CCCCCCCCCCOCC": 1190,
      "OCCP": 1191,
      "COCCCCCNc": 1192,
      "NCCOCCOCCOCCOCCC": 1193,
      "OCCCCCCCCCCCOc": 1194,
      "97": 1195,
      "cco": 1196,
      "NOCCCC": 1197,
      "OCCCCCCCCCCCCCCC": 1198,
      "ONCC": 1199,
      "CCNCCc": 1200,
      "CSNC": 1201,
      "COCS": 1202,
      "NCCCCCCCCNC": 1203,
      "OOS": 1204,
      "CNCCCNC": 1205,
      "CCCCCCCCCBr": 1206,
      "NOP": 1207,
      "NCCCCCCCCCCCCCCCC": 1208,
      "CCCCCP": 1209,
      "OSOOO": 1210,
      "SCCNS": 1211,
      "COOSc": 1212,
      "FCCC": 1213,
      "COCCCCCCCC": 1214,
      "te": 1215,
      "CCCONC": 1216,
      "NOCCOC": 1217,
      "CCCCCCCCCCCCCCOCC": 1218,
      "OCCCCCCS": 1219,
      "CCCCCSCC": 1220,
      "CCCCCCCCSC": 1221,
      "SCCCl": 1222,
      "CNCl": 1223,
      "COCCOCCOCCC": 1224,
      "CCOCCOCCOc": 1225,
      "CSCCCCCCNC": 1226,
      "CCCCCCCSc": 1227,
      "OCCCOCCOC": 1228,
      "OCCOCCOCCOCCOCCOCCO": 1229,
      "OCCOCCOCCOCCC": 1230,
      "OCCCON": 1231,
      "COCCOCCOCCN": 1232,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCC": 1233,
      "SeH": 1234,
      "NCCOCCS": 1235,
      "NCCCCCCOC": 1236,
      "CCCCCF": 1237,
      "CCCCCCCCCCCCCCCCCCn": 1238,
      "NCCCCCSC": 1239,
      "COCCOCCOCCOCCOC": 1240,
      "CCOCCOCCOCCNC": 1241,
      "scnn": 1242,
      "38": 1243,
      "CONCC": 1244,
      "CNCCCN": 1245,
      "ncsn": 1246,
      "CCCCCCOP": 1247,
      "NNNC": 1248,
      "33": 1249,
      "CCOSOOO": 1250,
      "CCCCCCCCCCCS": 1251,
      "OCCCNS": 1252,
      "SCCCNC": 1253,
      "SSSSSSSSSSSSSSSS": 1254,
      "CCCCCCCCP": 1255,
      "NCCCCCCCCCC": 1256,
      "CSCCCCCNc": 1257,
      "OCCCCCS": 1258,
      "OCCCCCCn": 1259,
      "OCBr": 1260,
      "CCCCCON": 1261,
      "COCON": 1262,
      "COCCCOCCC": 1263,
      "NCCCCCCCCC": 1264,
      "ClCCN": 1265,
      "NCCCCCNc": 1266,
      "CCSCCCNc": 1267,
      "OCCOCCCOC": 1268,
      ")[*])[": 1269,
      "CCCCOCCCC": 1270,
      "NCCI": 1271,
      "CCOCCCCC": 1272,
      "CCSN": 1273,
      "OCCOCn": 1274,
      "NCCCCCCCCCCCCCCCCCC": 1275,
      "CCSCCCN": 1276,
      "BP": 1277,
      "OCCOCCOCCN": 1278,
      "CCCCCCCOCc": 1279,
      "SCCOP": 1280,
      "NCCCOCCc": 1281,
      "NNOC": 1282,
      "CSCOC": 1283,
      "CCCCCCCCCCCN": 1284,
      "NBr": 1285,
      "CSCCNS": 1286,
      "cnno": 1287,
      "SSN": 1288,
      "CCNCCNCC": 1289,
      "CCCCCCCCCCCn": 1290,
      "COCCOCCS": 1291,
      "OCCCCCn": 1292,
      "NNCCO": 1293,
      "SCOC": 1294,
      "OCCI": 1295,
      "NCCOCCOCCC": 1296,
      "OCCOCCn": 1297,
      "CCCCCCCCOP": 1298,
      "CNNN": 1299,
      "NCCCCCl": 1300,
      "PCC": 1301,
      "NCCCCCCCl": 1302,
      "CCCB": 1303,
      "CCSCCCn": 1304,
      "COCCSC": 1305,
      "COCCCCCCCCCCCCCCCC": 1306,
      "NCCOCCOCCOCCOCCOCCOCCOCCOCC": 1307,
      "PN": 1308,
      "CSCCCCCCNc": 1309,
      "OCCOCCOCCC": 1310,
      "OBc": 1311,
      "CCOCOCC": 1312,
      "ONCc": 1313,
      "CCOOCC": 1314,
      "CCCCCCOCCCCc": 1315,
      "COCCOCCCCNC": 1316,
      "OCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCC": 1317,
      "COCCOCCCCNc": 1318,
      "CCNCCO": 1319,
      "NCCON": 1320,
      "CCSCCO": 1321,
      "OCCCCCBr": 1322,
      "COCCOCCCn": 1323,
      "85": 1324,
      "Ru": 1325,
      "OCCSSCC": 1326,
      "NCCCCCCl": 1327,
      "nncnc": 1328,
      "CPC": 1329,
      "SCCCCl": 1330,
      "CCONc": 1331,
      "/[": 1332,
      "CCOCCOCCOCCO": 1333,
      "ccocc": 1334,
      "BCc": 1335,
      "CCOCCOCCNc": 1336,
      "NCCOCCCl": 1337,
      "NCCCCCCSC": 1338,
      "OCCCCCCCCCCOC": 1339,
      "OON": 1340,
      "CCCCCCCCOCc": 1341,
      "OCCCCSc": 1342,
      "CCNn": 1343,
      "COCCCCCCCCCCCC": 1344,
      "OCCCCCCCCCCCCOc": 1345,
      "NCCCI": 1346,
      "GeH": 1347,
      "CCCCCCCCCCCCSc": 1348,
      "CCCCNCC": 1349,
      "OCCCCCCCOc": 1350,
      "39": 1351,
      "CCOCCOCCOCCOCCC": 1352,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCC": 1353,
      "59": 1354,
      "NCCCOCCCl": 1355,
      "-])(=": 1356,
      "BO": 1357,
      "ClCCCC": 1358,
      "COCCOCCOCc": 1359,
      "COOS": 1360,
      "OCCOCCS": 1361,
      "OCCCCCCBr": 1362,
      "OCCSSCCOC": 1363,
      "NCCOCCN": 1364,
      "conn": 1365,
      "CSCCCc": 1366,
      "CCCCCOCCC": 1367,
      "CNSc": 1368,
      "OCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCC": 1369,
      "]=[": 1370,
      "NCCCCCOc": 1371,
      "OCCCCCCOCC": 1372,
      "Cr": 1373,
      "CCCCCCCCNS": 1374,
      "OBO": 1375,
      "CSCSC": 1376,
      "NCCOCCOCCN": 1377,
      ")=[*])": 1378,
      "CCCCCCCCCCCCCCCCCCCc": 1379,
      "COCCOCCOCCOCCO": 1380,
      "COCCCCNS": 1381,
      "ClN": 1382,
      "NOCCCc": 1383,
      "OCCCCCCCCO": 1384,
      "OCCOCCOCCOCCOCCOc": 1385,
      "ccnnn": 1386,
      "NCCCCBr": 1387,
      "OCCCCCCCl": 1388,
      "OCCCCCNc": 1389,
      "CCCCCCCCCCCCCCO": 1390,
      "CCCCOCCOCCOCC": 1391,
      "CCOCCOCCOCCN": 1392,
      "SSSC": 1393,
      "CNCCOC": 1394,
      "COCCCCCCOc": 1395,
      "NCCCCCCCNC": 1396,
      "SCSc": 1397,
      "CCONCc": 1398,
      "CCCCCI": 1399,
      "NCCCCCBr": 1400,
      "CCCCCCCCCCCCNc": 1401,
      "])([": 1402,
      "COCCCOCc": 1403,
      "CCCCCCCCCCCCCCCCCCOP": 1404,
      "OCCOCCOCCCC": 1405,
      "CCCSOOO": 1406,
      "CCCOCCOCCOCCOCC": 1407,
      "SSSSC": 1408,
      "OPOc": 1409,
      "NCCCCCCBr": 1410,
      "Tl": 1411,
      "CCOCCCCCC": 1412,
      "CCCCCCCCCCSc": 1413,
      "CCOCS": 1414,
      "CCCOCn": 1415,
      "NNNN": 1416,
      "SCCF": 1417,
      "-]([": 1418,
      "CCSCCNS": 1419,
      "CNNCC": 1420,
      "OCCOOCCO": 1421,
      "ccccccc": 1422,
      "OCCCCCCCCCCCOC": 1423,
      "OCCOCCOCCOCCOCCOC": 1424,
      "COSc": 1425,
      "OCCOCCCl": 1426,
      "CCCOCCCNS": 1427,
      "NCCCCI": 1428,
      "cns": 1429,
      "58": 1430,
      "OCCCCCCCCCOc": 1431,
      "40": 1432,
      "ncnnc": 1433,
      "SSS": 1434,
      "CCCOCCCOCCCOCCCO": 1435,
      "CCCOCCCN": 1436,
      "NCCCCCI": 1437,
      "COCNc": 1438,
      "CSCCCNS": 1439,
      "CCCCCCCCCOP": 1440,
      "NCCOCCBr": 1441,
      "NCCCCCCI": 1442,
      "CCCCCCCCCNc": 1443,
      "FCCOc": 1444,
      "SCO": 1445,
      "OCCOCCNc": 1446,
      "NCCCCCCn": 1447,
      "CCOCCOCCOCCC": 1448,
      "SnH": 1449,
      "CSSCCC": 1450,
      "OCSc": 1451,
      "COCCON": 1452,
      "CCCCOCCNS": 1453,
      "CCCCCCCCCCCCCCCCCCCCOC": 1454,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 1455,
      "NCCCOCCBr": 1456,
      "CCCCCCOCCC": 1457,
      "CPc": 1458,
      "COCCCCCCCCC": 1459,
      "CCCOCCOCc": 1460,
      "COCCOCCNS": 1461,
      "NCCCCCCc": 1462,
      "FN": 1463,
      "CCCCCCCCCCCCOP": 1464,
      "NCCOCCOCCNc": 1465,
      "COCOCCC": 1466,
      "NOCCNC": 1467,
      "SCCCCCCCCCC": 1468,
      "CCCCCCCCCCCCCCCCO": 1469,
      "SCCCCCCC": 1470,
      "BrCCc": 1471,
      "CCCCCCCCCCCCCCCO": 1472,
      "NSCC": 1473,
      "NCCCCNS": 1474,
      "CSOOO": 1475,
      "CSCCCOC": 1476,
      "COCCOCCCN": 1477,
      "NNCCN": 1478,
      "OCCCP": 1479,
      "84": 1480,
      "CCCCCCCCCCSC": 1481,
      "SCCCSc": 1482,
      "OCCCCCCCCCCCCCCCCC": 1483,
      "NCCCCCCOc": 1484,
      "OCCCOS": 1485,
      "CCNOC": 1486,
      "NCCP": 1487,
      "SOc": 1488,
      "NCCOCCOc": 1489,
      "432": 1490,
      "CSCNC": 1491,
      "ncs": 1492,
      "SOCC": 1493,
      "SOO": 1494,
      "CCCCCCCCCCCCCCCCOP": 1495,
      "COCCCCCCC": 1496,
      "CCCCOCCOCc": 1497,
      "SCCCCOc": 1498,
      "CCCCCCCCCCBr": 1499,
      "CCOOCc": 1500,
      "NCCCCOCc": 1501,
      "CCCCCCCCCCCCCO": 1502,
      "72": 1503,
      "CCCCCCI": 1504,
      "CCONS": 1505,
      "NCCOCCOCCOCC": 1506,
      "CSCCCCNS": 1507,
      "108": 1508,
      "713": 1509,
      "CSCCCS": 1510,
      "CSCCSCC": 1511,
      "COCCCSCC": 1512,
      "CCCCCCCCCCCCCOc": 1513,
      "79": 1514,
      "NOO": 1515,
      "CCCCCCCBr": 1516,
      "](/": 1517,
      "CCCSCCCC": 1518,
      "OCCCCCCl": 1519,
      "+])=[": 1520,
      "CCCCNN": 1521,
      "CCCCOCCCNS": 1522,
      "FS": 1523,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 1524,
      "OCCCCCCCCCCCCOC": 1525,
      "SCCCCCO": 1526,
      "NCCOCCOCCOCCC": 1527,
      "COCCOCCOCCOCCOCCO": 1528,
      "OCCCCCCCCCCCCCCCCCCCC": 1529,
      "ccccccccc": 1530,
      "([*])=": 1531,
      "CCCCCCCCCCCCCCCCCCO": 1532,
      "NCCCCCCCCCCCCNC": 1533,
      "CSNc": 1534,
      "CBC": 1535,
      "CCOCCOCCOCCOc": 1536,
      "CCCNP": 1537,
      "CNCS": 1538,
      "CCCCCCCCCCOP": 1539,
      "CCCOCCOCCC": 1540,
      "COCCCl": 1541,
      "OCCSSc": 1542,
      "CCCCCCCCCCCCCCCOc": 1543,
      "CCCCONC": 1544,
      "CSCO": 1545,
      "CCCOCCCn": 1546,
      "COCCOCn": 1547,
      "CSSCc": 1548,
      "COCCONCc": 1549,
      "SCCCCCCCCCCCCCCCC": 1550,
      "SCCCCN": 1551,
      "COCCCSC": 1552,
      "CCCNNC": 1553,
      "CCOCCOCCOCCOCCOCCOCCOCCOCCNC": 1554,
      "FCCn": 1555,
      "SCCOCCO": 1556,
      "BrCCCC": 1557,
      "OCCCCCCCc": 1558,
      "NCCCCCCCCCCCCCC": 1559,
      "CCSSCCN": 1560,
      "49": 1561,
      "CCCCOCCCn": 1562,
      ")#": 1563,
      "CCCCCSCc": 1564,
      "NCCCCCNS": 1565,
      "44": 1566,
      "SCCl": 1567,
      "SOON": 1568,
      "CCCCOOC": 1569,
      "OOSc": 1570,
      "COCCCCOCC": 1571,
      "-]=": 1572,
      "OCCSCCO": 1573,
      "COCCOP": 1574,
      "Bn": 1575,
      "CCOCCOCCn": 1576,
      "OPP": 1577,
      "NCCCCS": 1578,
      "SCCCSC": 1579,
      "CCCOn": 1580,
      "CCCCCCCCCCCCCCn": 1581,
      "IN": 1582,
      "SSCCC": 1583,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 1584,
      "CCCCCCCP": 1585,
      "CCCCCCCCCCCCCCCCSCC": 1586,
      "OCOCCC": 1587,
      "COCCCCCn": 1588,
      "CCCCCOS": 1589,
      "CCCCOCCCCCC": 1590,
      "CSOC": 1591,
      ")[*])=": 1592,
      "COCCOCCOCCn": 1593,
      "CCCCCCCCCSc": 1594,
      "POC": 1595,
      "CSCn": 1596,
      "NCCCCCCOP": 1597,
      "COCCCOCCN": 1598,
      "OCCCCCCCCc": 1599,
      "NNCCCC": 1600,
      "CCSCCSCC": 1601,
      "OCCCNCc": 1602,
      "CSn": 1603,
      "NOCCCOc": 1604,
      "CCCCCCCCCCCCSCC": 1605,
      "SCCCCO": 1606,
      "COCCOCCOCCNC": 1607,
      "FP": 1608,
      "COCCCOP": 1609,
      "OCCOCCON": 1610,
      "124": 1611,
      "COCCCCCCCCCC": 1612,
      "CCCCCCCCON": 1613,
      "FCOc": 1614,
      "COCSc": 1615,
      "CCCCCCCSC": 1616,
      "COCCCOCCn": 1617,
      "NOCF": 1618,
      "OCCNN": 1619,
      "CNCCOc": 1620,
      "SCNC": 1621,
      "CCCCCCCCCCCCCCCCCCS": 1622,
      "CSCCOCC": 1623,
      "CCNCCCC": 1624,
      "OCCCCCCNc": 1625,
      "OCCCCCOCC": 1626,
      "CCCCCCCCCCCCCCCCCCCCc": 1627,
      "COCCOCN": 1628,
      "OOOOOOOOOOOOOOOO": 1629,
      "Mo": 1630,
      "CCSSCCNC": 1631,
      "CCOCCOCCCC": 1632,
      "OCCCCCCCCCCO": 1633,
      "cncnn": 1634,
      "ICc": 1635,
      "COCCCCCNS": 1636,
      "OCCCCCCCCCl": 1637,
      "CSCCCCCNS": 1638,
      "96": 1639,
      "SCCCCCCCCCCC": 1640,
      "CCCCOCCc": 1641,
      "CCSCCCOC": 1642,
      "BBBB": 1643,
      "SCSCS": 1644,
      "cnnnc": 1645,
      "CNCCCO": 1646,
      "NCCl": 1647,
      "CCCCOn": 1648,
      "CNCCNCC": 1649,
      "OCCOCCOCCOCCOCCOCCOC": 1650,
      "COCCOCCOCCOCCOc": 1651,
      "CSCCCCN": 1652,
      "CCCOO": 1653,
      "OCCOCCc": 1654,
      "OCCOCCOCCOCCOCC": 1655,
      "OOCCC": 1656,
      "cccoc": 1657,
      "OCCCCCCCOC": 1658,
      "ssnc": 1659,
      "COCCSCc": 1660,
      "PI": 1661,
      "NCCOS": 1662,
      "CNSC": 1663,
      "431": 1664,
      "SCCCCS": 1665,
      "COCCOCCOCCOCCC": 1666,
      "CSCCSc": 1667,
      "NCCSSc": 1668,
      "NCCSSCC": 1669,
      "CCCOCCOCCOC": 1670,
      "CCCCCCCCCCCCCCCCCO": 1671,
      "NCOCC": 1672,
      "SBr": 1673,
      "NOCCCCC": 1674,
      "NCCCCCCCCN": 1675,
      "CSCCCCn": 1676,
      "SOOC": 1677,
      "71": 1678,
      "BNC": 1679,
      "COCCF": 1680,
      "CCCCCCCOP": 1681,
      "CCOCCBr": 1682,
      "OCCCI": 1683,
      "PCc": 1684,
      "COCCCOCCOCC": 1685,
      "OSN": 1686,
      "COCCOCCCNS": 1687,
      "CCOCCOCCOCCNc": 1688,
      "COCCCCS": 1689,
      "COCCONS": 1690,
      "POc": 1691,
      "OCCCCCSc": 1692,
      "SCCCCCn": 1693,
      "CCCCCCCCCCCCCCCCCCCCCCOC": 1694,
      "NOCCF": 1695,
      "NCSCC": 1696,
      "NCCCCOCCc": 1697,
      "CCPC": 1698,
      "COCCOCOCC": 1699,
      "CCCOCOC": 1700,
      "OCCCCCCCCCCCCCCCCCCCCCC": 1701,
      "OCCCOCCC": 1702,
      "107": 1703,
      "CCCCCCCCCCP": 1704,
      "COCCOCCOCCOCc": 1705,
      "CCCCCCCCCCCCCNC": 1706,
      "CCOOP": 1707,
      "NCCOCCOCCNS": 1708,
      "BrCCN": 1709,
      "NCCCCCCCCCCNC": 1710,
      "CCCCCCCCCCCOCC": 1711,
      "CCNNc": 1712,
      "OCOCOCOC": 1713,
      "CCCCCCSCC": 1714,
      "NOCON": 1715,
      "SCCCCc": 1716,
      "CCCNCCC": 1717,
      "50": 1718,
      "OCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCC": 1719,
      "NCSC": 1720,
      "COCCCCO": 1721,
      "OCOS": 1722,
      "OCCOCCF": 1723,
      "CCCSS": 1724,
      "OOCCCC": 1725,
      "CCCCCCCCBr": 1726,
      "NCCOCCOCCOCCN": 1727,
      "COOP": 1728,
      "OCCCCCCCCCCCO": 1729,
      "CCCOCCCc": 1730,
      "CCCCCCCCCCCCCCCNC": 1731,
      "CCOCCOCCOCCOCCOCCC": 1732,
      "OCCCCOCCCCOCCCCOCCCC": 1733,
      "CCCCNCc": 1734,
      "CNSN": 1735,
      "SSCc": 1736,
      "SCCCCCCO": 1737,
      "NCCCNCc": 1738,
      "95": 1739,
      "OCCCCNS": 1740,
      "COCCOCCCOCC": 1741,
      "FB": 1742,
      "NCCCCCCS": 1743,
      "CCSCCCS": 1744,
      "81": 1745,
      "NOOSc": 1746,
      "CCCCCCCCCCCCNS": 1747,
      "NCCCOCCOCCOCCC": 1748,
      "NCCCCCCCN": 1749,
      "NCCNN": 1750,
      "CCOCCOCCOCCOCCOC": 1751,
      "coccc": 1752,
      "CCONCC": 1753,
      "CCCCCCOS": 1754,
      "CNOc": 1755,
      "CCNCl": 1756,
      "SCOCC": 1757,
      "NCCCP": 1758,
      "BBB": 1759,
      "COCCOCNC": 1760,
      "OCCCCOCc": 1761,
      "CCCCCCCCCCCCCCCCCCNc": 1762,
      "FCCNc": 1763,
      "CSCCCSC": 1764,
      "CCCCOCCOCCOCCC": 1765,
      "NCCOCCn": 1766,
      "CCCSCCCNC": 1767,
      "118": 1768,
      "Zr": 1769,
      "CNCCn": 1770,
      "OCCCSCc": 1771,
      "CCCCCCCCCSC": 1772,
      "COCCOCCCOCc": 1773,
      "COCCCOCCOCc": 1774,
      "CCCCCCCCCCNS": 1775,
      "COCCCCCN": 1776,
      "CCSCCCNC": 1777,
      "CCCCCCCCCCCCCCS": 1778,
      "CNNS": 1779,
      "234": 1780,
      "NNP": 1781,
      "NCCOCCOCCOCCOC": 1782,
      "CCCNn": 1783,
      "cp": 1784,
      "NCCCCCn": 1785,
      "NCCOCCOCCOCCNS": 1786,
      "CCCCCCCCCCCCP": 1787,
      "+]%": 1788,
      "OCOCO": 1789,
      "CCOCCCS": 1790,
      "NCCCCCCCCNc": 1791,
      "ooc": 1792,
      "COCCCSCc": 1793,
      "COCCOCCOCCOCCNC": 1794,
      "CSCCCCCn": 1795,
      "CCCOCCOCCOCCCNC": 1796,
      "OCCOCCOCc": 1797,
      "CNI": 1798,
      "NCCCOP": 1799,
      "OCCOCCOCCOCCNC": 1800,
      "NSCc": 1801,
      "OCCONC": 1802,
      "CCCCNP": 1803,
      "CCCCCCCCCCCCCCOP": 1804,
      "nnncc": 1805,
      "SSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSS": 1806,
      "ICCC": 1807,
      "NCCOCCOCCCCCCCl": 1808,
      "CCCCCCON": 1809,
      "CCCSSCC": 1810,
      "69": 1811,
      "SNCC": 1812,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 1813,
      "OCCCCOP": 1814,
      "OOOOC": 1815,
      "NOCOCC": 1816,
      "OCCCCCCCCCCCCO": 1817,
      "CSCSc": 1818,
      "CCSCCCCC": 1819,
      "CSCCCCCCNS": 1820,
      "NCCOCCOCCOc": 1821,
      "OCCCCCCCCCOC": 1822,
      "NCSc": 1823,
      "COI": 1824,
      "nncnn": 1825,
      "CCCSSC": 1826,
      "AsH": 1827,
      "OCOO": 1828,
      "OCCOCCOCCn": 1829,
      "SCCCCSc": 1830,
      "CCOCCOCCOCCOCCO": 1831,
      "OCCOCCOCCF": 1832,
      "CNCCCc": 1833,
      "CCCCCCCCSCC": 1834,
      "CCCCCCCCCCCCCN": 1835,
      "SSSc": 1836,
      "CCCOCCOCCOCCOCCOCCOCCOCCOCC": 1837,
      "ClCCCCC": 1838,
      "OCCSSCCO": 1839,
      "SCCCOCC": 1840,
      "129": 1841,
      "CCCCCCCCOCCC": 1842,
      "CCCSN": 1843,
      "CCCCSP": 1844,
      "CCCOCCNS": 1845,
      "COCCCCCOc": 1846,
      "CCOCCCO": 1847,
      "CCCCCCCCCCCCCCCCCCCn": 1848,
      "CCCCOCN": 1849,
      "OCCSCCC": 1850,
      "OSCC": 1851,
      "CCCCCCCCCCCNc": 1852,
      "CCCCCCCCCCCCCCCCCNC": 1853,
      "CCOCCOCCOCCOCCN": 1854,
      "CCCCCCCCCCCCOS": 1855,
      "COCOCCOC": 1856,
      "pn": 1857,
      "CCCCCCCCCCCCCCCS": 1858,
      "CSCOc": 1859,
      "CCCCCCCCCCCCCCCCSC": 1860,
      "NCCCON": 1861,
      "SCCCCCCCCC": 1862,
      "CCCCOCCOCCOC": 1863,
      "NCCCOCCOCCO": 1864,
      "NSNC": 1865,
      "SCCCCCc": 1866,
      "CCNCCNC": 1867,
      "342": 1868,
      "CCCCCCCCCCCCCCCCCCSC": 1869,
      "CCCOCCCCC": 1870,
      "CCCOCCOCCO": 1871,
      "CSCSCC": 1872,
      "CCCOOC": 1873,
      "OCCCCF": 1874,
      "CCCCCCCCCCCCCCCCOCCCOP": 1875,
      "occcc": 1876,
      "SSCCCC": 1877,
      "CCNCCCCc": 1878,
      "CCCCCSCCC": 1879,
      "OCOCOC": 1880,
      "NCCOCCOCCOCCO": 1881,
      "COSC": 1882,
      "COCCP": 1883,
      "COCCOCCOCCOCCOCCOC": 1884,
      "CCNCCNCCNCC": 1885,
      "CNNCc": 1886,
      "COCSC": 1887,
      "con": 1888,
      "COCCCCCCCCCCCCCC": 1889,
      "CCCSSCCC": 1890,
      "BrCCCc": 1891,
      "CCCOCCCCCC": 1892,
      "CCCCCCCCCCCCCCCN": 1893,
      "CNCN": 1894,
      "OSOC": 1895,
      "COCCOCCOCCOCCN": 1896,
      "CSSCCOC": 1897,
      "CCCCCCCCCCCCCCCCCn": 1898,
      "SCCCNc": 1899,
      "CNCCCn": 1900,
      "SCCCF": 1901,
      "PO": 1902,
      "CSOc": 1903,
      "NCCCCCCCCCCCCC": 1904,
      "CCCCCCCCCP": 1905,
      "CCCCCCCCCCCCCCCn": 1906,
      "CNCCCCC": 1907,
      "OCCCCCCOP": 1908,
      "COCCCCCOCC": 1909,
      "NCB": 1910,
      "OCCNCc": 1911,
      "CCSNC": 1912,
      "OCCOCCSC": 1913,
      "119": 1914,
      "ClCCCOc": 1915,
      "COCCOCCOCCNc": 1916,
      "CCNO": 1917,
      "CSCCCCCCn": 1918,
      "CCOCCSC": 1919,
      "CCCCCCF": 1920,
      "NCCCCCCCNc": 1921,
      "ClB": 1922,
      "BrP": 1923,
      "CSCCCCCCCC": 1924,
      "CCCCCCCOCCC": 1925,
      "CCCCOB": 1926,
      "NOCCCCCC": 1927,
      "NCCCCSc": 1928,
      "SCCSCC": 1929,
      "])=[": 1930,
      "CCCSSc": 1931,
      "COCCOCCOCCOCCn": 1932,
      "CNCCCCCCN": 1933,
      "NOCCCO": 1934,
      "CCNCCCN": 1935,
      "OSO": 1936,
      "ClCCOC": 1937,
      "COCCOS": 1938,
      "OCCOO": 1939,
      "CCCCCCCCCCCCCCCCCCCOC": 1940,
      "OPO": 1941,
      "ClCCOc": 1942,
      "324": 1943,
      "COCCCCCCOC": 1944,
      "OCCOCCOP": 1945,
      "cH": 1946,
      "OBOC": 1947,
      "CCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCNC": 1948,
      "csn": 1949,
      "NCCOCCOCCOCCn": 1950,
      "OSCc": 1951,
      "CCCCCOCCCC": 1952,
      "CCCCCCCCCCCCCOP": 1953,
      "NCCOCCOCCO": 1954,
      "OCCOOCCOOCCOOCCO": 1955,
      "NONC": 1956,
      "OCCOCCOCCOCCN": 1957,
      "CSSS": 1958,
      "CCOCOCc": 1959,
      "OCCOCCOCCOCCOCCOCCOCCOC": 1960,
      "CCCCCCCCCCCCCn": 1961,
      "CCCCNNC": 1962,
      "OCCCCCON": 1963,
      "CCCSCCN": 1964,
      "CNCCl": 1965,
      "CSI": 1966,
      "NCCNCc": 1967,
      "+]([*])": 1968,
      "NOCCON": 1969,
      "CCNOCC": 1970,
      "COCCNCc": 1971,
      "CCCCNCCCN": 1972,
      "OCCCCCCCO": 1973,
      "OCCCCCCCCCBr": 1974,
      "CCSCCSc": 1975,
      "BrCCCCC": 1976,
      "COOO": 1977,
      "NSS": 1978,
      "OCCOCCOCCOCCOCCOCC": 1979,
      "CCCCCCCCCCCCCOCC": 1980,
      "CCCOCCCOC": 1981,
      "FCCCOc": 1982,
      "FCCCNc": 1983,
      "CCCCCCCCCCCCCCCCCCCCCCOc": 1984,
      "CCCCCCCCCCCCCCCOCC": 1985,
      "COCl": 1986,
      "CSCCCCCCCCCCCC": 1987,
      "Cp": 1988,
      "COCCCCCCc": 1989,
      "nnno": 1990,
      "NNCCOC": 1991,
      "SCCCCCCCCCCCCCCCCCC": 1992,
      "CCNCCCc": 1993,
      "CSCCCl": 1994,
      "NCCNP": 1995,
      "SSSCCC": 1996,
      "BCCCCC": 1997,
      "FOC": 1998,
      "OCCOOC": 1999
    },
    "merges": [
      "c c",
      "C C",
      "( =",
      "cc c",
      "CC C",
      "C c",
      "+ ]",
      "cc ccc",
      "N C",
      "O C",
      "N H",
      "n c",
      "CC CC",
      ") (",
      "C l",
      "cc cc",
      "O c",
      "N c",
      ") [",
      "- ]",
      "O CC",
      "-] )",
      "C Oc",
      ") (=",
      "n H",
      "( [",
      ") =",
      "CC N",
      "B r",
      "C N",
      "+] (",
      "c n",
      "CC CCC",
      "CC c",
      "C OC",
      "1 2",
      "C O",
      "s c",
      "+] )",
      "n n",
      "N CC",
      "n cc",
      "C S",
      "CC OC",
      "2 1",
      "+] (=",
      "C NC",
      "o c",
      "c nc",
      "N Cc",
      "n nc",
      "CC OCC",
      "CCCC CCCC",
      "O Cc",
      "C n",
      "CC Oc",
      "CCC N",
      "C OCC",
      "2 3",
      "CC NC",
      "S C",
      "3 2",
      "ccc nc",
      "CC O",
      "N N",
      "CS c",
      "CC S",
      "cc nc",
      "N S",
      "ccc s",
      "CCC c",
      "CC n",
      "] (",
      "CCCC CC",
      "S i",
      "C Nc",
      "cc n",
      ")= [",
      "S c",
      "cccc n",
      "+] =",
      "c sc",
      "cn n",
      "ccc o",
      "CCC O",
      "c s",
      "N CCC",
      "cc ncc",
      "nc nc",
      "n o",
      "S CC",
      "N NC",
      "= [",
      "n oc",
      "n ccc",
      "N CCc",
      "O CCC",
      "nc n",
      "CCC NC",
      "OC O",
      ")( [",
      "( -",
      "cn cc",
      "OCC O",
      "cc sc",
      "n cccc",
      "3 4",
      "CCC Oc",
      "4 3",
      "CS C",
      "CC l",
      "CCCC N",
      "CCCC CCC",
      "CC Nc",
      "S Cc",
      "ccc n",
      "* ]",
      "OCC OCC",
      "CCC n",
      "s ccc",
      "(= [",
      "N O",
      "+] ([",
      "CCCC CCCCC",
      "CO Cc",
      "F c",
      "CCC OC",
      "O CCCC",
      "o n",
      "CCC S",
      "CCCCCCCC CCCCCCCC",
      "C Br",
      "CC SC",
      "CN S",
      "[ *]",
      "ncc n",
      "1 3",
      "CCCC c",
      "-] )[",
      "CCCC O",
      "Cl c",
      "ncc s",
      "CCC Nc",
      "c oc",
      "CO P",
      "cc oc",
      "cnc n",
      "F C",
      "CCS c",
      "COCC N",
      ") -",
      "5 4",
      "CS CC",
      "CCCC NC",
      "CCCC Oc",
      "O P",
      "cc nn",
      "nn n",
      "nccc n",
      "cn ccc",
      "N CCCC",
      "CO CCC",
      "nn nn",
      "O S",
      "-]) =",
      "N Nc",
      "CCS CC",
      "O N",
      "N OC",
      "s cc",
      "CCCCCCCC CCCC",
      "CCN S",
      "cn nc",
      "4 5",
      "+] )(",
      "CCC l",
      "cn ccn",
      "3 1",
      "CCCCCCCC CC",
      "OCC OC",
      "@ @",
      "N CCN",
      "O CCCO",
      "ncc nc",
      "o nc",
      "OCC c",
      "OCC N",
      "NCC NC",
      "nn nc",
      "CCCC OC",
      "*] )",
      "o ccc",
      "CS CCC",
      "CO N",
      "1 0",
      "CCCCCCCC CCC",
      "N n",
      "Br c",
      "OCC Oc",
      "+]= [",
      "CS Cc",
      "CCCC n",
      "n s",
      "N CCCc",
      "nc nn",
      "n sc",
      "cn nn",
      "-] )(",
      "C F",
      "OCC NC",
      "OC OC",
      "c o",
      "NCC Oc",
      "COCC NC",
      "O O",
      "nnc n",
      "CCCC S",
      "CCCCC N",
      "cnc nc",
      "cs cn",
      "CN CC",
      "NCC n",
      "] [",
      "NCC O",
      "# [",
      "OCCOCC OCCOCC",
      "N CCCCC",
      "CCC OCC",
      "COCC n",
      "NCC S",
      "6 5",
      "CCCCCCCC CCCCC",
      "([ *])",
      "1 1",
      "-] #[",
      "CCO P",
      "nc sc",
      "S CCC",
      "CCCCC NC",
      "C P",
      "CCCCC c",
      "N CCCN",
      "CCCCCCCC CCCCCC",
      "no nc",
      "COCC Oc",
      "O B",
      "NCCC n",
      "[*] )",
      "2 4",
      "CCCCC Oc",
      "CC OCc",
      "NCC OC",
      "Si H",
      "nn cc",
      "N OCC",
      "CC Br",
      "CCCCCCCC CCCCCCC",
      "CCC Sc",
      "C H",
      "CCCCCCCC CCCCCCCCC",
