{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFKC"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "model": {
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "#": 0,
      "%": 1,
      "(": 2,
      ")": 3,
      "*": 4,
      "+": 5,
      "-": 6,
      "/": 7,
      "0": 8,
      "1": 9,
      "2": 10,
      "3": 11,
      "4": 12,
      "5": 13,
      "6": 14,
      "7": 15,
      "8": 16,
      "9": 17,
      "=": 18,
      "@": 19,
      "A": 20,
      "B": 21,
      "C": 22,
      "D": 23,
      "E": 24,
      "F": 25,
      "G": 26,
      "H": 27,
      "I": 28,
      "K": 29,
      "L": 30,
      "M": 31,
      "N": 32,
      "O": 33,
      "P": 34,
      "R": 35,
      "S": 36,
      "T": 37,
      "U": 38,
      "V": 39,
      "W": 40,
      "X": 41,
      "Y": 42,
      "Z": 43,
      "[": 44,
      "\\": 45,
      "]": 46,
      "a": 47,
      "b": 48,
      "c": 49,
      "d": 50,
      "e": 51,
      "f": 52,
      "g": 53,
      "h": 54,
      "i": 55,
      "k": 56,
      "l": 57,
      "m": 58,
      "n": 59,
      "o": 60,
      "p": 61,
      "r": 62,
      "s": 63,
      "t": 64,
      "u": 65,
      "y": 66,
      "Ċ": 67,
      "cc": 68,
      "CC": 69,
      "(=": 70,
      "ccc": 71,
      "CCC": 72,
      "Cc": 73,
      "+]": 74,
      "ccccc": 75,
      "NC": 76,
      "OC": 77,
      "NH": 78,
      "nc": 79,
      "CCCC": 80,
      ")(": 81,
      "Cl": 82,
      "cccc": 83,
      "Oc": 84,
      "Nc": 85,
      ")[": 86,
      "-]": 87,
      "OCC": 88,
      "-])": 89,
      "COc": 90,
      ")(=": 91,
      "nH": 92,
      "([": 93,
      ")=": 94,
      "CCN": 95,
      "Br": 96,
      "CN": 97,
      "+](": 98,
      "cn": 99
    },
    "merges": [
      "c c",
      "C C",
      "( =",
      "cc c",
      "CC C",
      "C c",
      "+ ]",
      "cc ccc",
      "N C",
      "O C",
      "N H",
      "n c",
      "CC CC",
      ") (",
      "C l",
      "cc cc",
      "O c",
      "N c",
      ") [",
      "- ]",
      "O CC",
      "-] )",
      "C Oc",
      ") (=",
      "n H",
      "( [",
      ") =",
      "CC N",
      "B r",
      "C N",
      "+] (",
      "c n"
    ]
  }
}