{
  "version": "1.0",
  "truncation": {
    "max_length": 150,
    "strategy": "OnlyFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 150
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 20001,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 20000,
      "special": false,
      "content": "<start>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 20001,
      "special": false,
      "content": "<end>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFKC"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "model": {
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "#": 0,
      "%": 1,
      "(": 2,
      ")": 3,
      "*": 4,
      "+": 5,
      "-": 6,
      "/": 7,
      "0": 8,
      "1": 9,
      "2": 10,
      "3": 11,
      "4": 12,
      "5": 13,
      "6": 14,
      "7": 15,
      "8": 16,
      "9": 17,
      "=": 18,
      "@": 19,
      "A": 20,
      "B": 21,
      "C": 22,
      "D": 23,
      "E": 24,
      "F": 25,
      "G": 26,
      "H": 27,
      "I": 28,
      "K": 29,
      "L": 30,
      "M": 31,
      "N": 32,
      "O": 33,
      "P": 34,
      "R": 35,
      "S": 36,
      "T": 37,
      "U": 38,
      "V": 39,
      "W": 40,
      "X": 41,
      "Y": 42,
      "Z": 43,
      "[": 44,
      "\\": 45,
      "]": 46,
      "a": 47,
      "b": 48,
      "c": 49,
      "d": 50,
      "e": 51,
      "f": 52,
      "g": 53,
      "h": 54,
      "i": 55,
      "k": 56,
      "l": 57,
      "m": 58,
      "n": 59,
      "o": 60,
      "p": 61,
      "r": 62,
      "s": 63,
      "t": 64,
      "u": 65,
      "y": 66,
      "Ċ": 67,
      "cc": 68,
      "CC": 69,
      "(=": 70,
      "ccc": 71,
      "CCC": 72,
      "Cc": 73,
      "+]": 74,
      "ccccc": 75,
      "NC": 76,
      "OC": 77,
      "NH": 78,
      "nc": 79,
      "CCCC": 80,
      ")(": 81,
      "Cl": 82,
      "cccc": 83,
      "Oc": 84,
      "Nc": 85,
      ")[": 86,
      "-]": 87,
      "(-": 88,
      "OCC": 89,
      "-])": 90,
      "COc": 91,
      ")(=": 92,
      "nH": 93,
      "([": 94,
      ")=": 95,
      "CCN": 96,
      "Br": 97,
      "CN": 98,
      "+](": 99,
      "cn": 100,
      "CCCCC": 101,
      "CCc": 102,
      "COC": 103,
      "12": 104,
      "CO": 105,
      "sc": 106,
      "+])": 107,
      "nn": 108,
      "NCC": 109,
      "ncc": 110,
      "CS": 111,
      "CCOC": 112,
      "+](=": 113,
      "21": 114,
      "CNC": 115,
      "oc": 116,
      "cnc": 117,
      "NCc": 118,
      "nnc": 119,
      "CCOCC": 120,
      "CCCCCCCC": 121,
      "OCc": 122,
      "Cn": 123,
      "CCOc": 124,
      "CCCN": 125,
      "23": 126,
      "COCC": 127,
      "CCNC": 128,
      "SC": 129,
      "cccnc": 130,
      "CCO": 131,
      "NN": 132,
      "32": 133,
      "CSc": 134,
      "CCS": 135,
      "ccnc": 136,
      "NS": 137,
      "cccs": 138,
      "CCCc": 139,
      "CCn": 140,
      "](": 141,
      "CCCCCC": 142,
      "Si": 143,
      "CNc": 144,
      "ccn": 145,
      "csc": 146,
      "Sc": 147,
      ")=[": 148,
      "ccccn": 149,
      "+]=": 150,
      "cnn": 151,
      "ccco": 152,
      "CCCO": 153,
      "cs": 154,
      "NCCC": 155,
      "ccncc": 156,
      "ncnc": 157,
      "no": 158,
      "SCC": 159,
      "noc": 160,
      "NNC": 161,
      "=[": 162,
      "nccc": 163,
      "NCCc": 164,
      "OCCC": 165,
      "ncn": 166,
      "34": 167,
      "CCCNC": 168,
      "OCO": 169,
      ")([": 170,
      "cncc": 171,
      "OCCO": 172,
      "ccsc": 173,
      "ncccc": 174,
      "CCCOc": 175,
      "CSC": 176,
      "CCl": 177,
      "CCCCN": 178,
      "CCCCCCC": 179,
      "CCNc": 180,
      "SCc": 181,
      "cccn": 182,
      "43": 183,
      "OCCOCC": 184,
      "CCCn": 185,
      "sccc": 186,
      "(=[": 187,
      "NO": 188,
      "+]([": 189,
      "CCCCCCCCC": 190,
      "COCc": 191,
      "Fc": 192,
      "CCCOC": 193,
      "OCCCC": 194,
      "on": 195,
      "CCCS": 196,
      "CCCCCCCCCCCCCCCC": 197,
      "CBr": 198,
      "CCSC": 199,
      "13": 200,
      "CNS": 201,
      "nccn": 202,
      "CCCCc": 203,
      "-])[": 204,
      "CCCCO": 205,
      "Clc": 206,
      "nccs": 207,
      "coc": 208,
      "CCCNc": 209,
      "COP": 210,
      "ccoc": 211,
      "FC": 212,
      "cncn": 213,
      "45": 214,
      "CCSc": 215,
      "COCCN": 216,
      ")-": 217,
      "CCCCNC": 218,
      "CCCCOc": 219,
      "CSCC": 220,
      "OP": 221,
      "ccnn": 222,
      "nnn": 223,
      "ncccn": 224,
      "cnccc": 225,
      "NCCCC": 226,
      "COCCC": 227,
      "-])=": 228,
      "OS": 229,
      "nnnn": 230,
      "NNc": 231,
      "CCSCC": 232,
      "ON": 233,
      "NOC": 234,
      "CCCCCCCCCCCC": 235,
      "CCNS": 236,
      "*)": 237,
      "cnnc": 238,
      "+])(": 239,
      "CCCl": 240,
      "54": 241,
      "cnccn": 242,
      "CCCCCCCCCC": 243,
      "OCCOC": 244,
      "31": 245,
      "@@": 246,
      "scc": 247,
      "NCCN": 248,
      "OCCCO": 249,
      "nccnc": 250,
      "OCCc": 251,
      "OCCN": 252,
      "NCCNC": 253,
      "nnnc": 254,
      "CCCCOC": 255,
      "occc": 256,
      "CSCCC": 257,
      "CON": 258,
      "10": 259,
      "CCCCCCCCCCC": 260,
      "Nn": 261,
      "Brc": 262,
      "OCCOc": 263,
      "+]=[": 264,
      "CSCc": 265,
      "CCCCn": 266,
      "ns": 267,
      "onc": 268,
      "NCCCc": 269,
      "ncnn": 270,
      "nsc": 271,
      "cnnn": 272,
      "-])(": 273,
      "OCCNC": 274,
      "CF": 275,
      "OCOC": 276,
      "co": 277,
      "NCCOc": 278,
      "COCCNC": 279,
      "OO": 280,
      "nncn": 281,
      "CCCCS": 282,
      "CCCCCN": 283,
      "cncnc": 284,
      "(*)": 285,
      "cscn": 286,
      "CNCC": 287,
      "NCCn": 288,
      "][": 289,
      "NCCO": 290,
      "#[": 291,
      "OCCOCCOCCOCC": 292,
      "NCCCCC": 293,
      "CCCOCC": 294,
      "COCCn": 295,
      "NCCS": 296,
      "56": 297,
      "CCCCCCCCCCCCC": 298,
      "11": 299,
      "-]#[": 300,
      "CCOP": 301,
      "ncsc": 302,
      "24": 303,
      "SCCC": 304,
      "CCCCCNC": 305,
      "CP": 306,
      "CCCCCc": 307,
      "NCCCN": 308,
      "CCCCCCCCCCCCCC": 309,
      "nonc": 310,
      "COCCOc": 311,
      "OB": 312,
      "NCCCn": 313,
      "65": 314,
      "CCCCCOc": 315,
      "CCOCc": 316,
      "NCCOC": 317,
      "SiH": 318,
      "nncc": 319,
      "NOCC": 320,
      "CCBr": 321,
      "CCCCCCCCCCCCCCC": 322,
      "CCCSc": 323,
      "CH": 324,
      "CCCCCCCCCCCCCCCCC": 325,
      "ccncn": 326,
      "Se": 327,
      "CCCCCCCCCCCCCCCCCC": 328,
      "CCNCC": 329,
      "scnc": 330,
      "OCCn": 331,
      "nsnc": 332,
      "COCCOC": 333,
      "cncs": 334,
      "COCCCNC": 335,
      "NCCNc": 336,
      "CCCCCCOc": 337,
      "COCCO": 338,
      "OCCCCC": 339,
      "ccon": 340,
      "CNN": 341,
      "cscc": 342,
      "CI": 343,
      "COCCCN": 344,
      "42": 345,
      "CCCCl": 346,
      "OCCCc": 347,
      "COS": 348,
      "14": 349,
      "CCCCCCc": 350,
      "OCCCCCC": 351,
      "sccn": 352,
      "CCCNS": 353,
      "nnsc": 354,
      "-]=[": 355,
      "CCCSC": 356,
      "ncncc": 357,
      "+])=": 358,
      "cccnn": 359,
      "CCCCNc": 360,
      "(*": 361,
      "OCCCCCCCC": 362,
      "NCCCOC": 363,
      "NOCc": 364,
      "OOC": 365,
      "CCOCCC": 366,
      "67": 367,
      "OCCCNC": 368,
      "SS": 369,
      "NP": 370,
      "snc": 371,
      "COCCCC": 372,
      "Sn": 373,
      "occ": 374,
      "CCCCCCN": 375,
      "nncs": 376,
      "CCCCCOC": 377,
      "NCCOCC": 378,
      "CCCCCO": 379,
      "CCON": 380,
      "NCCCCCC": 381,
      "COCCc": 382,
      "ncoc": 383,
      "COCCOCC": 384,
      "cnoc": 385,
      "(*)=": 386,
      "NCCCO": 387,
      "CONC": 388,
      "sn": 389,
      "CCCCCn": 390,
      "35": 391,
      "SCCS": 392,
      "OCCCOc": 393,
      "OCCCN": 394,
      "NNCC": 395,
      "76": 396,
      "NCCCOCC": 397,
      "COCCNc": 398,
      "snnc": 399,
      "CCCCCCNC": 400,
      "ClC": 401,
      "NCCCNC": 402,
      "CCCCCCCCc": 403,
      "])": 404,
      "+])[": 405,
      "CCCCOCC": 406,
      "ccno": 407,
      "-])([": 408,
      "CCCCCCCCOc": 409,
      "CCCCCCCCCCCCCCCCCCC": 410,
      "ncco": 411,
      "ONC": 412,
      "ncon": 413,
      "CNNC": 414,
      "cnco": 415,
      "CCOCCCNC": 416,
      "NCCSCc": 417,
      "OCCS": 418,
      "CSCCN": 419,
      "](=": 420,
      "CCF": 421,
      "SCCN": 422,
      "OCCCn": 423,
      "OCCCCCCCCCCCC": 424,
      "csnn": 425,
      "NNS": 426,
      "NCCSc": 427,
      "CCP": 428,
      "CCCCCCCCCCCCCCCCCCCCC": 429,
      "ocnc": 430,
      "OCCCOC": 431,
      "COCOC": 432,
      "Bc": 433,
      "OOO": 434,
      "CCOCCN": 435,
      "ccnnc": 436,
      "CCSCc": 437,
      "NCCOCCOCC": 438,
      "CCCSCC": 439,
      "SCCCC": 440,
      "COCOc": 441,
      "CCOCCOc": 442,
      "NCCCOc": 443,
      "COCCOCCOCC": 444,
      "ClCc": 445,
      "OCCOCCOCCOCCOCCOCCOCCOCC": 446,
      "CCCBr": 447,
      "COCCCn": 448,
      "NCCNS": 449,
      "OCCNc": 450,
      "CCCCCCCOc": 451,
      "CCCCCCOC": 452,
      "CCSCCC": 453,
      "oncc": 454,
      "On": 455,
      "CCOCCOC": 456,
      "CCCCSc": 457,
      "SCCCS": 458,
      "41": 459,
      "CCOS": 460,
      "OCCOCCO": 461,
      "-][": 462,
      "CCCCCNc": 463,
      "CCCCCCCc": 464,
      "15": 465,
      "-](": 466,
      "As": 467,
      "CCCCCCO": 468,
      "CNCc": 469,
      "CCOCCO": 470,
      "CCCOCc": 471,
      "CCCCCCCCOC": 472,
      "CSCCS": 473,
      "CB": 474,
      "NCCSC": 475,
      "CCOCCn": 476,
      "SN": 477,
      "CSCN": 478,
      "SOOO": 479,
      "78": 480,
      "cnns": 481,
      "Ic": 482,
      "53": 483,
      "CCCCCCCCN": 484,
      "CSSCC": 485,
      "NCCCS": 486,
      "OCCSc": 487,
      "nnco": 488,
      "CCCCCCn": 489,
      "CCOCCOCCOCC": 490,
      "OCCCl": 491,
      "OCn": 492,
      "COCCCOc": 493,
      "OCCCCCCCCCC": 494,
      "NCN": 495,
      "OCCCS": 496,
      "CCCCCl": 497,
      "CCCCCCCCCCCCCCCCCCCC": 498,
      "se": 499,
      "CCCOCCC": 500,
      "SCCOc": 501,
      "CCCCCCCCCCOc": 502,
      "CCCCCCCN": 503,
      "BrC": 504,
      "SCCc": 505,
      "SCCNC": 506,
      "BC": 507,
      "OCN": 508,
      "CCCCNS": 509,
      "CCCCCCCCCCCCOc": 510,
      "CCCF": 511,
      "SSc": 512,
      "(/": 513,
      "87": 514,
      "CCNN": 515,
      "ncns": 516,
      "SCCO": 517,
      "OCCCCCCC": 518,
      "46": 519,
      "ClCC": 520,
      "COCCCNc": 521,
      "OCOCC": 522,
      "CCCCCCCCCc": 523,
      "CCCCCS": 524,
      "NCCCCc": 525,
      "CCONC": 526,
      "OCOc": 527,
      "@]": 528,
      "16": 529,
      "Ge": 530,
      "OCCOCCOC": 531,
      "cnsn": 532,
      "CCOCCCC": 533,
      "CCCCCCCCCCCCc": 534,
      "CCOCCOCC": 535,
      "OCCCCOc": 536,
      "@@]": 537,
      "COCO": 538,
      "64": 539,
      "COCCNS": 540,
      "nnccc": 541,
      "NCCOCCO": 542,
      "CCCCCCCCCCc": 543,
      "NCCCNc": 544,
      "OCCF": 545,
      "CCOCCCN": 546,
      "COCCS": 547,
      "Pc": 548,
      "CCOCCNC": 549,
      "CNCCC": 550,
      "SCCSC": 551,
      "SSC": 552,
      "OCCCCCCCCC": 553,
      "CSCCO": 554,
      "CSCCNC": 555,
      "CCNCc": 556,
      "NCCCCCCC": 557,
      "CCCCCCCCCCCCOC": 558,
      "+][": 559,
      "OCCCCCCOc": 560,
      "CCCCCCCOC": 561,
      "OCCCCn": 562,
      "CCCCCCCCCCCCCCCCCCCCCC": 563,
      "OCCCNc": 564,
      "Te": 565,
      "OCCCCOC": 566,
      "OCCCCO": 567,
      "ncno": 568,
      "OCCOCCOCCOC": 569,
      "CCCCSC": 570,
      "COCCOCCNC": 571,
      "CCOCn": 572,
      "CCCCCCCCNC": 573,
      "CCCCCCCCCCOC": 574,
      "(-[": 575,
      "(#": 576,
      "NCCCCN": 577,
      "17": 578,
      "cocn": 579,
      "CCCCCCCCCOC": 580,
      ")/": 581,
      "+](-": 582,
      "NNCc": 583,
      "CSCCCC": 584,
      "+]#": 585,
      "COCCCCC": 586,
      "NCCCCn": 587,
      "NOc": 588,
      "CCCCCCNc": 589,
      "COn": 590,
      "conc": 591,
      "CCCCBr": 592,
      "NCCCl": 593,
      "IH": 594,
      "COCCOCCC": 595,
      "CCSS": 596,
      "OCCCCCCCCCCCCCCCC": 597,
      "CCCCOCCCNC": 598,
      "CCOCCc": 599,
      "COCCCc": 600,
      "nocc": 601,
      "NCCCCCO": 602,
      "CNn": 603,
      "25": 604,
      "BrCC": 605,
      "OCCCCCCOC": 606,
      "CCCP": 607,
      "NCCCSc": 608,
      "cocc": 609,
      "CCOCCCn": 610,
      "OCCOCCC": 611,
      "COO": 612,
      "OCCSC": 613,
      "OCCOCCOc": 614,
      "NCCCCCCCC": 615,
      "CCCCCCCCCOc": 616,
      "Al": 617,
      "CCCOP": 618,
      "]([": 619,
      "NSc": 620,
      "OCCCCc": 621,
      "CCI": 622,
      "NCCCCCCNC": 623,
      "cccccc": 624,
      "CCCCOCCC": 625,
      "OCCNS": 626,
      "SSSS": 627,
      "CCCCCCCCCCCCCCCCCCCCCCC": 628,
      "89": 629,
      "CCCNCC": 630,
      "NCCCCO": 631,
      "PC": 632,
      "18": 633,
      "OCCOCc": 634,
      "OCCCCCOc": 635,
      "COCN": 636,
      "NCl": 637,
      "BrCc": 638,
      "CCCCCSc": 639,
      "COB": 640,
      "CCCON": 641,
      "OCCBr": 642,
      "])(": 643,
      "OCF": 644,
      "CCCCCCCNC": 645,
      "CCCCCCCCn": 646,
      "123": 647,
      "OCCCCN": 648,
      "cnsc": 649,
      "CCCOCCOC": 650,
      "CCCCOP": 651,
      "NCCCCNC": 652,
      "NOS": 653,
      "+]#[": 654,
      "COCn": 655,
      "COCCCS": 656,
      "98": 657,
      "CNCCS": 658,
      "NCCCCCc": 659,
      "CCCCCCCCCCCCCCOc": 660,
      "SCCCCC": 661,
      "CNOC": 662,
      "CCCCOCc": 663,
      "37": 664,
      "CCCCOCCOCC": 665,
      "OCP": 666,
      "COOC": 667,
      "NCCCCOc": 668,
      "OCCOCCOCCO": 669,
      "CCOCCS": 670,
      "NCCF": 671,
      "52": 672,
      "CCCSCc": 673,
      "CCCCCCCCCCCCCCCCCCCCCCCC": 674,
      "]=": 675,
      "COCCOCCCC": 676,
      "sncc": 677,
      "19": 678,
      "COCOCC": 679,
      "CCCCCCCCCCCCN": 680,
      "NSC": 681,
      "NCCCCCCO": 682,
      "CNCCN": 683,
      "CCCCCNS": 684,
      "CCOCCNc": 685,
      "NCCCOCc": 686,
      "57": 687,
      "OCNC": 688,
      "SCCCN": 689,
      "Hg": 690,
      "=*)": 691,
      "OCCCCCCCCCCC": 692,
      "OCCOCCOCCOCCO": 693,
      "132": 694,
      "NOCCC": 695,
      "314": 696,
      "(*)(=": 697,
      "OOOO": 698,
      "CONCc": 699,
      "OCCCCCCCCCCCCCCCCCC": 700,
      "COCCOCc": 701,
      "CCCCCCCCCCCCNC": 702,
      "OOc": 703,
      "NCNC": 704,
      "CCCCCCCCCCCCCCCCCCOC": 705,
      "ccns": 706,
      "CCOCCOCCOCCOCCOCC": 707,
      "COCCOCCOC": 708,
      "NCS": 709,
      "OCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCC": 710,
      "CCCCCCCCCCCc": 711,
      "CCCCCCS": 712,
      "CCCCCCCCCCCCCCCCOC": 713,
      "CCCCCCCCCCN": 714,
      "NCCOCCOCCNC": 715,
      "CCCCCCOCC": 716,
      "nscc": 717,
      "ccsn": 718,
      "CCCCCBr": 719,
      "CCCCP": 720,
      "ncncn": 721,
      "OF": 722,
      "SCCOC": 723,
      "CSN": 724,
      "20": 725,
      "SCCCc": 726,
      "NCCCNS": 727,
      "NCCCOCCO": 728,
      "CCCOS": 729,
      "CCCCCCCn": 730,
      "75": 731,
      "OCCCCNC": 732,
      "CCCCOCCOc": 733,
      "SNC": 734,
      "OCCCCl": 735,
      "NCCOCc": 736,
      "SCCCO": 737,
      "CCOCCCNc": 738,
      "CNO": 739,
      "CSCCCNC": 740,
      "OCCCCCCCCCCCCCC": 741,
      "CCCCCCCCCCCCCCCc": 742,
      "CCCCCCCCCCCCCCCCCCCCCCCCC": 743,
      "CCCCCCCCCCCCCCOC": 744,
      "CSCCc": 745,
      "CCCCCOCC": 746,
      "51": 747,
      "CCOCCOCCOC": 748,
      "COCCOCCOc": 749,
      "nnns": 750,
      "NCCCCSC": 751,
      "NCCCCl": 752,
      "CCCCCCCCCCCOC": 753,
      "OOCC": 754,
      "PP": 755,
      "CCCCCCCCCCCCCCCCCCNC": 756,
      "OCOCc": 757,
      "COCCCOC": 758,
      "NCCCSC": 759,
      "NCCSCCCO": 760,
      "BB": 761,
      "OCS": 762,
      "ClCCc": 763,
      "SCCCCCC": 764,
      "CSSC": 765,
      "CCCCCCCCCCCCCCCCOc": 766,
      "NCOc": 767,
      "CCCCCCl": 768,
      "CCCCCCCCCCNC": 769,
      "SP": 770,
      "CCCCCCCCCN": 771,
      "ccs": 772,
      "OCl": 773,
      "CSCCOc": 774,
      "ONc": 775,
      "CCCCOCCOC": 776,
      "CCCOCCOCC": 777,
      "CCCCCCCCNc": 778,
      "-])=[": 779,
      "CCNCCC": 780,
      "CCSCCNC": 781,
      "NCCCCCCCCCCCC": 782,
      "SH": 783,
      "OCCCCCc": 784,
      "NCCCOCCOCC": 785,
      "CCCCSCC": 786,
      "COCCOCCOCCOCCOCC": 787,
      "312": 788,
      "CCCCCCCCCCCCCCCCCCN": 789,
      "OCCCSc": 790,
      "NCCOCCOC": 791,
      "nccnn": 792,
      "IC": 793,
      "COCCSc": 794,
      "PH": 795,
      "NCCOCCC": 796,
      "NOCCO": 797,
      "CCCOCCOc": 798,
      "COCCOCCOCCOC": 799,
      "OCCCCCCO": 800,
      "-%": 801,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 802,
      "ssc": 803,
      "CCB": 804,
      "NCCCOCCOC": 805,
      "OCCl": 806,
      "cnncc": 807,
      "CCCI": 808,
      "OCOP": 809,
      "CSCCn": 810,
      "36": 811,
      "FCC": 812,
      "CNCCc": 813,
      "OCCCF": 814,
      "CCSCCN": 815,
      "NCCCCOC": 816,
      "CCOCCOCCNC": 817,
      "SCN": 818,
      "BN": 819,
      "CCCCCCCCCCCCCCc": 820,
      "CCCCCCCCS": 821,
      "CCCCCCCCCCCCCCCCOCC": 822,
      "OCCOCCOCC": 823,
      "SCCCOc": 824,
      "CCCCCSC": 825,
      "NCO": 826,
      "OCCOCCOCCOc": 827,
      "SCCn": 828,
      "CCSSCC": 829,
      "csnc": 830,
      "CCCCCCCCCCCCn": 831,
      "NNCCC": 832,
      "22": 833,
      "OCCOP": 834,
      "OCOCCOC": 835,
      "109": 836,
      "CCCCCCCCCCCCCCCCCCOc": 837,
      "OI": 838,
      "NCn": 839,
      "OCCCBr": 840,
      "COCCOCCOCCOc": 841,
      "CCOCOC": 842,
      "CCNCCS": 843,
      "CCOCO": 844,
      "CCCCCCCO": 845,
      "CCCCCCCCCCn": 846,
      "CCCCCCSc": 847,
      "OCCCOCC": 848,
      "CNCCO": 849,
      "CCCCCCCCCCCCCCCCCCOCC": 850,
      "CCOCOc": 851,
      "NCCCSCc": 852,
      "@@](": 853,
      "OCCCCCO": 854,
      "NCCCCNc": 855,
      "NCCCOCCOCCOCCCNC": 856,
      "NCCCCCCN": 857,
      "CCCCCCCCCNC": 858,
      "NCCSCC": 859,
      "26": 860,
      "OCCCOCc": 861,
      "CCOCCOCc": 862,
      "FCc": 863,
      "NCCCCCNC": 864,
      "SNc": 865,
      "(\\": 866,
      "CCCCON": 867,
      "CNOCC": 868,
      "CCCOCCO": 869,
      "@](": 870,
      "(=*)": 871,
      "COCCCCNC": 872,
      "CSS": 873,
      "CONc": 874,
      "86": 875,
      "Sb": 876,
      "CSCCNc": 877,
      "BOC": 878,
      "COCCCCOc": 879,
      "CCCCOCCNC": 880,
      "CSCS": 881,
      "SO": 882,
      "NNN": 883,
      "COCCCNS": 884,
      "(*)(": 885,
      "CCOO": 886,
      "CCCCCCCCCCCCCc": 887,
      "CCCCCCCCO": 888,
      "NI": 889,
      "CCCCCCCCCCCCCCCCc": 890,
      "CCNNC": 891,
      "OCCOCCOCCOCCOC": 892,
      "COCCONC": 893,
      "CCCCCCCCCCCOc": 894,
      "CCCNN": 895,
      "CCCCCCSC": 896,
      "CCCOCCc": 897,
      "SSSSSSSS": 898,
      "63": 899,
      "321": 900,
      "CSCCCCC": 901,
      "COCCOCOc": 902,
      "OCCCCS": 903,
      "68": 904,
      "CCCCCCCCCn": 905,
      "OCCOS": 906,
      "CCCCCCCl": 907,
      "OCCSCC": 908,
      "CCOCN": 909,
      "CCCCCCCCCCCCCCCOC": 910,
      "OCON": 911,
      "CCCCCCCCCCCCCOC": 912,
      "OCCOCCNC": 913,
      "Pb": 914,
      "CCCOCCCO": 915,
      "-[": 916,
      "ClCCC": 917,
      "CCOCCOCCOCCOCC": 918,
      "NCCCCCOC": 919,
      "CSCCCN": 920,
      "CCSCCNc": 921,
      "CCCCCCCCCCCCCCCCCCCCCCCCCC": 922,
      "COCCOCCCNC": 923,
      "CCSCCCC": 924,
      "CCCCCCCCOCC": 925,
      "CCCCCCCCCCCCS": 926,
      "CCCCCCCCCCCCCCCCCCc": 927,
      "COCCCCCC": 928,
      "NCCCCCN": 929,
      "CCCCCCCCCCS": 930,
      "NCOC": 931,
      "OCCOCCOCCNC": 932,
      "OCCCCCCc": 933,
      "COCCCOCC": 934,
      "CCCCCCCCCCCCCCCCNC": 935,
      "CCCCCCCCCCO": 936,
      "CNP": 937,
      "CONS": 938,
      "OCCCCCCCCOc": 939,
      "COCCCCn": 940,
      "CCCOCCNC": 941,
      "CCCCB": 942,
      "OCCCCCN": 943,
      "CCCCCCNS": 944,
      "OCCOCCCC": 945,
      "SF": 946,
      "NB": 947,
      "COOCC": 948,
      "SCCNc": 949,
      "SSCC": 950,
      "CCCCCCCCCO": 951,
      "])[": 952,
      "CCCCCCCCCOCC": 953,
      "CSP": 954,
      "CCCCCOCc": 955,
      "OOOC": 956,
      "SCCSc": 957,
      "CCOCCCOC": 958,
      "OCCOCCOCCOCCOc": 959,
      "Op": 960,
      "CCCCCCCCCCCCCCCCN": 961,
      "OCCCCCOC": 962,
      "CCCCCCBr": 963,
      "CSCCCNc": 964,
      "CNNc": 965,
      "CSCCOC": 966,
      "CCOCCNS": 967,
      "SOC": 968,
      "213": 969,
      "CCCCCCCCCS": 970,
      "OCCCCNc": 971,
      "CCCCCCCNc": 972,
      "CCCOCCCNC": 973,
      "NCCOCCOCCOCCOCC": 974,
      "COCNC": 975,
      "CCCCCCCCCCCCO": 976,
      "COCCCO": 977,
      "NOCOC": 978,
      "CCCOCCN": 979,
      "341": 980,
      "BH": 981,
      "CCOCCCOc": 982,
      "CCCCF": 983,
      "SCCCCCCCC": 984,
      "NCCBr": 985,
      "CCOCCOCCN": 986,
      "CCCSCCC": 987,
      "CCCOCCn": 988,
      "SCn": 989,
      "CCCNCc": 990,
      "CCCCCCCCCCCNC": 991,
      "OCCCCCCCCCCCCC": 992,
      "pH": 993,
      "SCl": 994,
      "CSCCCO": 995,
      "COCOCc": 996,
      "OCCON": 997,
      "CNOCc": 998,
      "COCCOCOC": 999,
      "COCCCCN": 1000,
      "CSCCSC": 1001,
      "OCCCCCCN": 1002,
      "CSCCCCCC": 1003,
      "27": 1004,
      "CCCCOCCNc": 1005,
      "CCOOC": 1006,
      "CCOCCOCCOCCOCCNC": 1007,
      "OSc": 1008,
      "OCCOCCN": 1009,
      "62": 1010,
      "CCNCCN": 1011,
      "COCCOCCCOc": 1012,
      "CCSSc": 1013,
      "COCCCOCCOc": 1014,
      "NCP": 1015,
      "CCCCCCCCCCNc": 1016,
      "COCCOCCN": 1017,
      "CCSCCCO": 1018,
      "NOCCc": 1019,
      "SCS": 1020,
      "CCOCCOCCC": 1021,
      "CCOn": 1022,
      "OOCc": 1023,
      "CCCCOCCCN": 1024,
      "COOCc": 1025,
      "ONN": 1026,
      "CCOCP": 1027,
      "NOCCOc": 1028,
      "231": 1029,
      "NCCOCCOCCOC": 1030,
      "SCCOCC": 1031,
      "CSCCCCNc": 1032,
      "NCCCCCCCCCCC": 1033,
      "CBc": 1034,
      "OCCSS": 1035,
      "OBOc": 1036,
      "OOOOOOOO": 1037,
      "CCCNCCS": 1038,
      "73": 1039,
      "CCCSP": 1040,
      "28": 1041,
      "OCCCCCCNC": 1042,
      "OCCCSC": 1043,
      "CCCCCCCCCCCCSC": 1044,
      "OCCOCCOCCOCCOCCO": 1045,
      "(*)[": 1046,
      "NCCCF": 1047,
      "NCCOP": 1048,
      "CCCCCCOCc": 1049,
      "CCSCCOc": 1050,
      "OCCCCCCCCCCOc": 1051,
      "COCCCSc": 1052,
      "SCCCn": 1053,
      "CSCCCCNC": 1054,
      "OCCCCBr": 1055,
      "Bi": 1056,
      "OCCCCOCC": 1057,
      "NNCCc": 1058,
      "cnon": 1059,
      "ClCCCc": 1060,
      "48": 1061,
      "]%": 1062,
      "CCCCCCCCCCCCCCCCCc": 1063,
      "CCOCCCCNC": 1064,
      "47": 1065,
      "ss": 1066,
      "CCCOCCCC": 1067,
      "CCCCCCCCCCCCOCC": 1068,
      "COCCOCCNc": 1069,
      "CCOCCOCCOCCOC": 1070,
      "CCCCOCCCNc": 1071,
      "SI": 1072,
      "CCOCCCc": 1073,
      "OCCCSCC": 1074,
      "COCCCCNc": 1075,
      "COCCOCCn": 1076,
      "NCCSSCCNC": 1077,
      "CCSCCc": 1078,
      "OCCCCCCCCOC": 1079,
      "*)[": 1080,
      "CCOCCCNS": 1081,
      "In": 1082,
      "CCCCOCCN": 1083,
      "CCCOCCNc": 1084,
      "Ga": 1085,
      "ONS": 1086,
      "CSSc": 1087,
      "CCCOCCCNc": 1088,
      "CCOCCSc": 1089,
      "CCCCOCCn": 1090,
      "CCOCCCl": 1091,
      "BCC": 1092,
      "OCI": 1093,
      "CCCCCCCS": 1094,
      "CCCCI": 1095,
      "NSN": 1096,
      "CCOCCOCCO": 1097,
      "CCSSC": 1098,
      "CCSSCCC": 1099,
      "onnc": 1100,
      "COCP": 1101,
      "NF": 1102,
      "CCCCCCCOCC": 1103,
      "CCCCCCCCCCCCCCCCNc": 1104,
      "CCCCCCCCCCCCCCCCCOC": 1105,
      "CSCCCOc": 1106,
      "COCCCCCNC": 1107,
      "COCCCCCCCCCCCCCCCCCC": 1108,
      "OCCCCOCCCC": 1109,
      "CCCCOS": 1110,
      "29": 1111,
      "COCCOCCOCCOCCOCCOCCOCCOCCOCC": 1112,
      "COCCOCCO": 1113,
      "OSC": 1114,
      "OBr": 1115,
      "CCCCOCCCCC": 1116,
      "CCCCCCCCSc": 1117,
      "SCSC": 1118,
      "74": 1119,
      "CCCCCCCCCCCO": 1120,
      "COCCSCC": 1121,
      "OCNc": 1122,
      "CNCCCC": 1123,
      "op": 1124,
      "OCCCCCl": 1125,
      "COCCNCC": 1126,
      "CCCCCCCCCCCCCCN": 1127,
      "OCCCOP": 1128,
      "CSCCCn": 1129,
      "nnoc": 1130,
      "occn": 1131,
      "+](=[": 1132,
      "CCSCCS": 1133,
      "CCCCCCCCCCCCCCNC": 1134,
      "BrCCC": 1135,
      "COCCCCc": 1136,
      "COCCOCCOCCOCC": 1137,
      "CNCCNC": 1138,
      "COCCOCCCNc": 1139,
      "])=": 1140,
      "61": 1141,
      "CCOCCOCCOCCOCCOCCOCCOCCOCCOCC": 1142,
      "NOCCN": 1143,
      "=*": 1144,
      "OCCCCCNC": 1145,
      "-])-": 1146,
      "SCF": 1147,
      "NCNc": 1148,
      "30": 1149,
      "ICC": 1150,
      "NCCCCCCNc": 1151,
      "CCSCCn": 1152,
      "CSCCCCCNC": 1153,
      "CCSP": 1154,
      "CCCCOCCOCCNC": 1155,
      "COCCOCCCOC": 1156,
      "CCSCCOC": 1157,
      "NCCOCCOCCOCCNC": 1158,
      "COOc": 1159,
      "OCCSCc": 1160,
      "NCCOCCNC": 1161,
      "COCCCOCCOC": 1162,
      "OCCNCC": 1163,
      "CCOB": 1164,
      "NCCNCC": 1165,
      "CCCCSCc": 1166,
      "pc": 1167,
      "OCSC": 1168,
      "NCCCCOCCOC": 1169,
      "NCCCBr": 1170,
      "CCCCCCP": 1171,
      "COCCOCCc": 1172,
      "COCCCCOC": 1173,
      "OOP": 1174,
      "CCSCCCOc": 1175,
      "SCCCOC": 1176,
      "ClP": 1177,
      "OCCCCON": 1178,
      "COCCOCCOCCO": 1179,
      "CCCCCOP": 1180,
      "NCCCCOCC": 1181,
      "315": 1182,
      "NON": 1183,
      "CCCCCCCCCCCCCCCCS": 1184,
      "CCCCCCCCCCOCC": 1185,
      "NOCO": 1186,
      "CCCCSCCC": 1187,
      "OCCP": 1188,
      "CCCCCCCCCCCCCCCCn": 1189,
      "SCCCCCCCCCCCC": 1190,
      "NCCOCCOCCOCCOCCC": 1191,
      "COCCCCCNc": 1192,
      "CCNP": 1193,
      "OCCCCCCCCCCCCCCC": 1194,
      "OCCCCCCCCCCCOc": 1195,
      "ONCC": 1196,
      "NOCCCC": 1197,
      "cco": 1198,
      "COCS": 1199,
      "NCCCCCCCCNC": 1200,
      "CCNCCc": 1201,
      "CNCCCNC": 1202,
      "CSNC": 1203,
      "CCCCCCCCCBr": 1204,
      "OOS": 1205,
      "SCCNS": 1206,
      "CCCCCP": 1207,
      "NOP": 1208,
      "NCCCCCCCCCCCCCCCC": 1209,
      "COOSc": 1210,
      "OSOOO": 1211,
      "te": 1212,
      "FCCC": 1213,
      "COCCCCCCCC": 1214,
      "CNCl": 1215,
      "CCCCCCCSc": 1216,
      "NOCCOC": 1217,
      "CCCCCCCCCCCCCCOCC": 1218,
      "CCCONC": 1219,
      "OCCOCCOCCOCCC": 1220,
      "SCCCl": 1221,
      "OCCCCCCS": 1222,
      "CCCCCSCC": 1223,
      "CCOCCOCCOc": 1224,
      "CCCCCCCCSC": 1225,
      "CSCCCCCCNC": 1226,
      "OCCCON": 1227,
      "COCCOCCOCCC": 1228,
      "COCCOCCOCCN": 1229,
      "OCCCOCCOC": 1230,
      "NCCCCCCOC": 1231,
      "OCCOCCOCCOCCOCCOCCO": 1232,
      "NCCOCCS": 1233,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCC": 1234,
      "CCCCCCCCCCCCCCCCCCn": 1235,
      "NCCCCCSC": 1236,
      "SeH": 1237,
      "COCCOCCOCCOCCOC": 1238,
      "38": 1239,
      "NNNC": 1240,
      "CNCCCN": 1241,
      "CONCC": 1242,
      "CCOCCOCCOCCNC": 1243,
      "CCCCCF": 1244,
      "scnn": 1245,
      "CCCCCCOP": 1246,
      "33": 1247,
      "CCOSOOO": 1248,
      "SSSSSSSSSSSSSSSS": 1249,
      "CSCCCCCNc": 1250,
      "OCCCNS": 1251,
      "CCCCCCCCCCCS": 1252,
      "SCCCNC": 1253,
      "ncsn": 1254,
      "OCCCCCS": 1255,
      "OCBr": 1256,
      "NCCCCCNc": 1257,
      "NCCCCCCCCCC": 1258,
      "CCOCCCCC": 1259,
      "CCCCCCCCP": 1260,
      "OCCOCCCOC": 1261,
      "COCCCOCCC": 1262,
      "OCCCCCCn": 1263,
      "CCSCCCNc": 1264,
      "COCON": 1265,
      "CCCCCON": 1266,
      "NCCCCCCCCC": 1267,
      "CCCCOCCCC": 1268,
      "ClCCN": 1269,
      "NCCI": 1270,
      "OCCOCn": 1271,
      "CCSN": 1272,
      "CCSCCCN": 1273,
      "OCCOCCOCCN": 1274,
      "NCCCCCCCCCCCCCCCCCC": 1275,
      "SCCOP": 1276,
      "NBr": 1277,
      "CSCOC": 1278,
      "CCCCCCCOCc": 1279,
      "NCCCOCCc": 1280,
      "cnno": 1281,
      "CSCCNS": 1282,
      "NNOC": 1283,
      "CCCCCCCCCCCN": 1284,
      "CCNCCNCC": 1285,
      "CCCCCCCCCCCn": 1286,
      "OCCI": 1287,
      "SSN": 1288,
      "NNCCO": 1289,
      "97": 1290,
      "SCOC": 1291,
      "OCCCCCn": 1292,
      "COCCOCCS": 1293,
      "CCCCCCCCOP": 1294,
      "NCCOCCOCCC": 1295,
      "BP": 1296,
      "PCC": 1297,
      "CNNN": 1298,
      "79": 1299,
      "OCCOCCn": 1300,
      "NCCCCCl": 1301,
      "NCCOCCOCCOCCOCCOCCOCCOCCOCC": 1302,
      "COCCSC": 1303,
      "COCCCCCCCCCCCCCCCC": 1304,
      "CCOOCC": 1305,
      "NCCCCCCCl": 1306,
      "ONCc": 1307,
      "CSCCCCCCNc": 1308,
      "OBc": 1309,
      "CCOCOCC": 1310,
      "COCCOCCCCNc": 1311,
      "CCSCCCn": 1312,
      "PN": 1313,
      "CCCCCCOCCCCc": 1314,
      "CCCB": 1315,
      "COCCOCCCCNC": 1316,
      "OCCOCCOCCC": 1317,
      "85": 1318,
      "NCCON": 1319,
      "COCCOCCCn": 1320,
      "NCCCCCCl": 1321,
      "CCSCCO": 1322,
      "OCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCC": 1323,
      "CCNCCO": 1324,
      "OCCCCCBr": 1325,
      "nncnc": 1326,
      "SCCCCl": 1327,
      "CCONc": 1328,
      "Ru": 1329,
      "COCCCCCCCCCCCC": 1330,
      "OCCSSCC": 1331,
      "CCOCCOCCOCCO": 1332,
      "CCCCCCCCOCc": 1333,
      "NCCCCCCSC": 1334,
      "CPC": 1335,
      "CCOCCOCCNc": 1336,
      "/[": 1337,
      "OCCCCCCCCCCCCOc": 1338,
      "59": 1339,
      "NCCOCCCl": 1340,
      "BCc": 1341,
      "OON": 1342,
      "CCCCNCC": 1343,
      "OCCCCCCCCCCOC": 1344,
      "39": 1345,
      "CCNn": 1346,
      "GeH": 1347,
      "NCCCI": 1348,
      "CCCCCCCCCCCCSc": 1349,
      "OCCCCCCCOc": 1350,
      "ccocc": 1351,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCC": 1352,
      "CCOCCOCCOCCOCCC": 1353,
      "OCCCCSc": 1354,
      "OCCSSCCOC": 1355,
      "-])(=": 1356,
      "NCCCOCCCl": 1357,
      "BO": 1358,
      "NCCOCCN": 1359,
      "CCCCCOCCC": 1360,
      "CSCCCc": 1361,
      "OCCCCCCBr": 1362,
      "ClCCCC": 1363,
      "conn": 1364,
      "COOS": 1365,
      "COCCOCCOCc": 1366,
      "OCCOCCS": 1367,
      "OCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCC": 1368,
      "CNSc": 1369,
      "OBO": 1370,
      "OCCCCCCOCC": 1371,
      "Cr": 1372,
      "NCCCCCOc": 1373,
      "CSCSC": 1374,
      "CCCCCCCCNS": 1375,
      "NCCOCCOCCN": 1376,
      "NCCCCBr": 1377,
      "COCCOCCOCCOCCO": 1378,
      "CCOCCOCCOCCN": 1379,
      "]=[": 1380,
      "ClN": 1381,
      "COCCCCNS": 1382,
      "OCCCCCCCl": 1383,
      "NOCCCc": 1384,
      "CCCCCCCCCCCCCCCCCCCc": 1385,
      "ccnnn": 1386,
      "OCCOCCOCCOCCOCCOc": 1387,
      "OCCCCCNc": 1388,
      "58": 1389,
      "CNCCOC": 1390,
      "CCONCc": 1391,
      "CCCCOCCOCCOCC": 1392,
      "COCCCCCCOc": 1393,
      "SSSC": 1394,
      "SSS": 1395,
      "CCCCCCCCCCCCCCO": 1396,
      "OCCOCCOCCCC": 1397,
      "COCCCOCc": 1398,
      "NCCCCCBr": 1399,
      "CCCCCI": 1400,
      "CCCCCCCCCCCCCCCCCCOP": 1401,
      "NCCCCCCCNC": 1402,
      "CCCOCCOCCOCCOCC": 1403,
      "NCCCCCCBr": 1404,
      "])([": 1405,
      "SCSc": 1406,
      "Tl": 1407,
      "SSSSC": 1408,
      "CCCCCCCCCCCCNc": 1409,
      "CCOCS": 1410,
      "OPOc": 1411,
      "CCOCCCCCC": 1412,
      "OCCCCCCCCO": 1413,
      "COSc": 1414,
      "CCCCCCCCCCSc": 1415,
      "CCCSOOO": 1416,
      "CCCOCn": 1417,
      "OCCCCCCCCCCCOC": 1418,
      "CNNCC": 1419,
      "CCCOCCCNS": 1420,
      "ccccccc": 1421,
      "SCCF": 1422,
      "OCCOCCOCCOCCOCCOC": 1423,
      "NNNN": 1424,
      "CCSCCNS": 1425,
      "-]([": 1426,
      "NCCCCI": 1427,
      "OCCOCCCl": 1428,
      "40": 1429,
      "OCCOOCCO": 1430,
      "SCO": 1431,
      "CCCOCCCN": 1432,
      "NCCCCCCI": 1433,
      "NCCCCCI": 1434,
      "ncnnc": 1435,
      "SnH": 1436,
      "OCCOCCNc": 1437,
      "CSCCCNS": 1438,
      "CCCCCCCCCOP": 1439,
      "NCCOCCBr": 1440,
      "OCCCCCCCCCOc": 1441,
      "CCCOCCCOCCCOCCCO": 1442,
      "COCNc": 1443,
      "cns": 1444,
      "CCCCCCCCCNc": 1445,
      "FCCOc": 1446,
      "NCCCCCCn": 1447,
      "CCCCOCCNS": 1448,
      "CCOCCOCCOCCC": 1449,
      "OCSc": 1450,
      "CCCCCCCCCCCCCCCCCCCCOC": 1451,
      "CCCCCCCCCCCCOP": 1452,
      "CCCOCCOCc": 1453,
      "CSSCCC": 1454,
      "NCCCOCCBr": 1455,
      "COCCON": 1456,
      "NCCCCCCc": 1457,
      "CCCCCCOCCC": 1458,
      "BrCCc": 1459,
      "COCCOCCNS": 1460,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 1461,
      "CPc": 1462,
      "NCCOCCOCCNc": 1463,
      "NOCCNC": 1464,
      "COCCCCCCCCC": 1465,
      "FN": 1466,
      "CCCCCCCCCCCCCCCCO": 1467,
      "NCCCCNS": 1468,
      "SCCCCCCC": 1469,
      "CSCCCOC": 1470,
      "CCCCCCCCCCCCCCCO": 1471,
      "SCCCCCCCCCC": 1472,
      "COCOCCC": 1473,
      "NCCCCCCOc": 1474,
      "CSOOO": 1475,
      "NNCCN": 1476,
      "NSCC": 1477,
      "COCCOCCCN": 1478,
      "CCCCCCCCCCSC": 1479,
      "OCCCP": 1480,
      "OCCCCCCCCCCCCCCCCC": 1481,
      "CCNOC": 1482,
      "OCCCOS": 1483,
      "NCCP": 1484,
      "SCCCSc": 1485,
      "SOc": 1486,
      "SOCC": 1487,
      "NCCOCCOc": 1488,
      "CSCNC": 1489,
      "CCCCOCCOCc": 1490,
      "432": 1491,
      "CCCCCCCCCCCCCCCCOP": 1492,
      "SOO": 1493,
      "SCCCCOc": 1494,
      "CCCCCCCCCCCCCO": 1495,
      "CCOOCc": 1496,
      "COCCCCCCC": 1497,
      "NCCCCOCc": 1498,
      "713": 1499,
      "CCCCCCI": 1500,
      "NCCOCCOCCOCC": 1501,
      "CCONS": 1502,
      "CCCCCCCCCCBr": 1503,
      "CSCCCS": 1504,
      "CSCCCCNS": 1505,
      "COCCCSCC": 1506,
      "CCCCCCCBr": 1507,
      "CCCCCCCCCCCCCOc": 1508,
      "+])=[": 1509,
      "NOO": 1510,
      "CCCCNN": 1511,
      "ncs": 1512,
      "OCCCCCCCCCCCCOC": 1513,
      "CSCCSCC": 1514,
      "CCCSCCCC": 1515,
      "FS": 1516,
      "CNCS": 1517,
      "CCCCCCCCCCCCCCCCCCO": 1518,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 1519,
      "CCCCONC": 1520,
      "CCCCOCCCNS": 1521,
      "NCCCCCCCCCCCCNC": 1522,
      "SCCCCCO": 1523,
      "](/": 1524,
      "CCCCCCCCCCCCCCCOc": 1525,
      "CSNc": 1526,
      "OCCCCCCl": 1527,
      "NCCOCCOCCOCCC": 1528,
      "CCOCCOCCOCCOc": 1529,
      "OCCSSc": 1530,
      "CBC": 1531,
      "COCCOCCOCCOCCOCCO": 1532,
      "84": 1533,
      "CCCCCCCCCCOP": 1534,
      "CCCNP": 1535,
      "CCCOCCOCCC": 1536,
      "CCCOCCCn": 1537,
      "COCCCl": 1538,
      "ccccccccc": 1539,
      "COCCOCn": 1540,
      "72": 1541,
      "OCCCCCCCCCCCCCCCCCCCC": 1542,
      "COCCONCc": 1543,
      "CCOCCOCCOCCOCCOCCOCCOCCOCCNC": 1544,
      "NCCCCCCCCCCCCCC": 1545,
      "SCCCCCCCCCCCCCCCC": 1546,
      "CSCO": 1547,
      "CSSCc": 1548,
      "COCCCSC": 1549,
      "OCCCCCCCc": 1550,
      "SCCCCN": 1551,
      ")#": 1552,
      "CCCNNC": 1553,
      "FCCn": 1554,
      "SOON": 1555,
      "BrCCCC": 1556,
      "SCCOCCO": 1557,
      "49": 1558,
      "CCSSCCN": 1559,
      "44": 1560,
      "COCCCCOCC": 1561,
      "Bn": 1562,
      "CCCCOCCCn": 1563,
      "CCCCOOC": 1564,
      "OOSc": 1565,
      "SSCCC": 1566,
      "-]=": 1567,
      "CCCCCCCP": 1568,
      "CCCCCSCc": 1569,
      "SCCl": 1570,
      "COCCOP": 1571,
      "CCCOn": 1572,
      "CCCCCCCCCCCCCCn": 1573,
      "OCCSCCO": 1574,
      "CCOCCOCCn": 1575,
      "NCCCCCNS": 1576,
      "IN": 1577,
      "OPP": 1578,
      "NCCCCS": 1579,
      "CCCCCCCCCCCCCCCCSCC": 1580,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 1581,
      "SCCCSC": 1582,
      "OCOCCC": 1583,
      "COCCCCCn": 1584,
      "CCCCCCCCCSc": 1585,
      "COCCOCCOCCn": 1586,
      "CSOC": 1587,
      "CCCCCOS": 1588,
      "CCCCOCCCCCC": 1589,
      "CSCn": 1590,
      "108": 1591,
      "OCCOCCON": 1592,
      "NNCCCC": 1593,
      "CCSCCSCC": 1594,
      "OCCCNCc": 1595,
      "COCCOCCOCCNC": 1596,
      "OCCCCCCCCc": 1597,
      "NCCCCCCOP": 1598,
      "COCCCOCCN": 1599,
      "POC": 1600,
      "SCCCCO": 1601,
      "NOCCCOc": 1602,
      "FP": 1603,
      "CCCCCCCSC": 1604,
      "CCCCCCCCCCCCSCC": 1605,
      "COCCCOCCn": 1606,
      "CSn": 1607,
      "CSCCOCC": 1608,
      "OCCCCCOCC": 1609,
      "COCCCOP": 1610,
      "FCOc": 1611,
      "CCCCCCCCON": 1612,
      "NOCF": 1613,
      "CNCCOc": 1614,
      "SCNC": 1615,
      "OCCNN": 1616,
      "Mo": 1617,
      "CCCCCCCCCCCCCCCCCCCCc": 1618,
      "CCSSCCNC": 1619,
      "OCCCCCCNc": 1620,
      "COCCCCCCCCCC": 1621,
      "OOOOOOOOOOOOOOOO": 1622,
      "CCNCCCC": 1623,
      "COCSc": 1624,
      "NCCl": 1625,
      "ICc": 1626,
      "CCCCCCCCCCCCCCCCCCS": 1627,
      "CCCCOCCc": 1628,
      "cncnn": 1629,
      "COCCCCCNS": 1630,
      "96": 1631,
      "COCCOCN": 1632,
      "cccoc": 1633,
      "CCOCCOCCCC": 1634,
      "CNCCNCC": 1635,
      "OCCOCCOCCOCCOCC": 1636,
      "OCCCCCCCCCl": 1637,
      "CCCCOn": 1638,
      "SCSCS": 1639,
      "CCSCCCOC": 1640,
      "OCCCCCCCCCCO": 1641,
      "124": 1642,
      "BBBB": 1643,
      "CNCCCO": 1644,
      "cnnnc": 1645,
      "CSCCCCCNS": 1646,
      "SCCCCCCCCCCC": 1647,
      "COCCOCCOCCOCCOc": 1648,
      "OOCCC": 1649,
      "CSCCCCN": 1650,
      "431": 1651,
      "OCCOCCc": 1652,
      "SCCCCS": 1653,
      "OCCOCCOCCOCCOCCOCCOC": 1654,
      "CNSC": 1655,
      "CCCOO": 1656,
      "OCCCCCCCOC": 1657,
      "NCCOS": 1658,
      "CSCCSc": 1659,
      "ssnc": 1660,
      "NCCSSc": 1661,
      "NCCSSCC": 1662,
      "COCCOCCOCCOCCC": 1663,
      "si": 1664,
      "CCCCCCCCCCCCCCCCCO": 1665,
      "PI": 1666,
      "COCCSCc": 1667,
      "SBr": 1668,
      "SOOC": 1669,
      "NCOCC": 1670,
      "COCCOCCCNS": 1671,
      "CCCOCCOCCOC": 1672,
      "COCCF": 1673,
      "CCOCCBr": 1674,
      "NOCCCCC": 1675,
      "BNC": 1676,
      "CCCCCCCOP": 1677,
      "COCCCOCCOCC": 1678,
      "NCCCCCCCCN": 1679,
      "CSCCCCn": 1680,
      "OSN": 1681,
      "PCc": 1682,
      "POc": 1683,
      "CCOCCOCCOCCNc": 1684,
      "OCCCCCSc": 1685,
      "SCCCCCn": 1686,
      "CCCCCCCCCCCCCCCCCCCCCCOC": 1687,
      "OCCCI": 1688,
      "COCCOCOCC": 1689,
      "NCSCC": 1690,
      "COCCCCS": 1691,
      "COCCONS": 1692,
      "NOCCF": 1693,
      "NCCCCOCCc": 1694,
      "NCCOCCOCCNS": 1695,
      "OCCCCCCCCCCCCCCCCCCCCCC": 1696,
      "CCPC": 1697,
      "CCCCCCCCCCCOCC": 1698,
      "CCOOP": 1699,
      "OCCCOCCC": 1700,
      "OCOCOCOC": 1701,
      "NCCCCCCCCCCNC": 1702,
      "CCCOCOC": 1703,
      "CCCCCCCCCCCCCNC": 1704,
      "NOCON": 1705,
      "107": 1706,
      "OCCOCCF": 1707,
      "COCCOCCOCCOCc": 1708,
      "SCCCCc": 1709,
      "CCCCCCCCCCP": 1710,
      "CCCCCCSCC": 1711,
      "NCSC": 1712,
      "COCCCCO": 1713,
      "CCCNCCC": 1714,
      "CCNNc": 1715,
      "OCCCCOCCCCOCCCCOCCCC": 1716,
      "BrCCN": 1717,
      "CCCCCCCCCCCCCCCNC": 1718,
      "50": 1719,
      "CCCSS": 1720,
      "NCCOCCOCCOCCN": 1721,
      "OOCCCC": 1722,
      "OCOS": 1723,
      "SCCCCCCO": 1724,
      "OCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCC": 1725,
      "COOP": 1726,
      "OCCCCNS": 1727,
      "CCCCCCCCBr": 1728,
      "SSCc": 1729,
      "NCCNN": 1730,
      "CCSCCCS": 1731,
      "CCOCCOCCOCCOCCOCCC": 1732,
      "CCCCNCc": 1733,
      "NCCCCCCCN": 1734,
      "NCCCNCc": 1735,
      "COCCOCCCOCC": 1736,
      "NCCCOCCOCCOCCC": 1737,
      "NOOSc": 1738,
      "OCCCCCCCCCCCO": 1739,
      "CCCOCCCc": 1740,
      "CCCCCCCCCCCCNS": 1741,
      "FB": 1742,
      "coccc": 1743,
      "71": 1744,
      "NCCCP": 1745,
      "NCCCCCCS": 1746,
      "CCCCCCCCCCCCCCCCCCNc": 1747,
      "CNSN": 1748,
      "CCNCl": 1749,
      "CCONCC": 1750,
      "OCCCCOCc": 1751,
      "CCOCCOCCOCCOCCOC": 1752,
      "SCOCC": 1753,
      "CCCCCCOS": 1754,
      "CNOc": 1755,
      "COCCCCCN": 1756,
      "COCCOCNC": 1757,
      "CCCCOCCOCCOCCC": 1758,
      "OCCCSCc": 1759,
      "NCCOCCOCCOCCOC": 1760,
      "COCCOCCCOCc": 1761,
      "BBB": 1762,
      "FCCNc": 1763,
      "Zr": 1764,
      "234": 1765,
      "AsH": 1766,
      "NCCOCCn": 1767,
      "CCCCCCCCCCNS": 1768,
      "CSCCCSC": 1769,
      "CCCSCCCNC": 1770,
      "COCCCOCCOCc": 1771,
      "CNCCn": 1772,
      "COCCOCCOCCOCCNC": 1773,
      "69": 1774,
      "CCCCCCCCCSC": 1775,
      "95": 1776,
      "CCSCCCNC": 1777,
      "cp": 1778,
      "CNNS": 1779,
      "NCCOCCOCCOCCNS": 1780,
      "CSCCCCCn": 1781,
      "NNP": 1782,
      "OCOCO": 1783,
      "129": 1784,
      "NCCCCCCCCNc": 1785,
      "CCCNn": 1786,
      "CCCOCCOCCOCCCNC": 1787,
      "CCOCCCS": 1788,
      "nnncc": 1789,
      "CCCCCCCCCCCCCCS": 1790,
      "OCCOCCOCCOCCNC": 1791,
      "CCCCNP": 1792,
      "OCCOCCOCc": 1793,
      "CNI": 1794,
      "CCCCCCCCCCCCP": 1795,
      "NCCCCCn": 1796,
      "COCCCSCc": 1797,
      "NCCCOP": 1798,
      "OCCCCOP": 1799,
      "NSCc": 1800,
      "CCCCCCON": 1801,
      "SSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSS": 1802,
      "OCCONC": 1803,
      "CCCCCCCCCCCCCCOP": 1804,
      "81": 1805,
      "NOCOCC": 1806,
      "NCCOCCOCCOc": 1807,
      "SNCC": 1808,
      "118": 1809,
      "NCCOCCOCCCCCCCl": 1810,
      "ooc": 1811,
      "CSCSc": 1812,
      "CCSCCCCC": 1813,
      "NCSc": 1814,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 1815,
      "OCCCCCCCCCCCCO": 1816,
      "CCCSSCC": 1817,
      "OCCCCCCCCCOC": 1818,
      "ICCC": 1819,
      "CSCCCCCCNS": 1820,
      "nncnn": 1821,
      "OCCOCCOCCn": 1822,
      "OOOOC": 1823,
      "CCCOCCOCCOCCOCCOCCOCCOCCOCC": 1824,
      "SSSc": 1825,
      "OSCC": 1826,
      "CCCSSC": 1827,
      "OCCSSCCO": 1828,
      "CNCCCc": 1829,
      "CCCCCCCCCCCCCN": 1830,
      "CCOCCCO": 1831,
      "CCCCOCN": 1832,
      "CCOCCOCCOCCOCCN": 1833,
      "COI": 1834,
      "CCCCCCCCCCCNc": 1835,
      "OCOO": 1836,
      "CCCCCCCCSCC": 1837,
      "CCCCCCCCCCCCCCCCSC": 1838,
      "CCCCCCCCCCCCCCCCCCCn": 1839,
      "CCCOCCNS": 1840,
      "CCCCCCCCCCCCOS": 1841,
      "SCCCOCC": 1842,
      "CCOCCOCCOCCOCCO": 1843,
      "COCCCCCOc": 1844,
      "OCCOCCOCCF": 1845,
      "CCCCSP": 1846,
      "SCCCCSc": 1847,
      "ClCCCCC": 1848,
      "CCCSN": 1849,
      "CCCCCCCCCCCCCCCCCNC": 1850,
      "OCCSCCC": 1851,
      "CSCOc": 1852,
      "CCCCOCCOCCOC": 1853,
      "COCOCCOC": 1854,
      "CSCSCC": 1855,
      "CCCCCCCCOCCC": 1856,
      "CCCCCCCCCCCCCCCS": 1857,
      "NSNC": 1858,
      "CCCCCCCCCCCCCCCCCCSC": 1859,
      "+]%": 1860,
      "NCCCON": 1861,
      "CCCOCCOCCO": 1862,
      "342": 1863,
      "pn": 1864,
      "CCNCCNC": 1865,
      "COSC": 1866,
      "NCCCOCCOCCO": 1867,
      "COCCP": 1868,
      "CCCOOC": 1869,
      "CCCCCSCCC": 1870,
      "CCCOCCCCC": 1871,
      "SSCCCC": 1872,
      "SCCCCCCCCC": 1873,
      "CCCCCCCCCCCCCCCCOCCCOP": 1874,
      "NCCOCCOCCOCCO": 1875,
      "COCSC": 1876,
      "SCCCCCc": 1877,
      "BrCCCc": 1878,
      "COCCOCCOCCOCCOCCOC": 1879,
      "CCNCCNCCNCC": 1880,
      "CCNCCCCc": 1881,
      "CNNCc": 1882,
      "OCOCOC": 1883,
      "COCCCCCCCCCCCCCC": 1884,
      "OCCCCF": 1885,
      "CNCN": 1886,
      "CCCOCCCCCC": 1887,
      "SCCCF": 1888,
      "CCCCCCCCCCCCCCCn": 1889,
      "con": 1890,
      "CCCCCCCCCCCCCCCN": 1891,
      "CSSCCOC": 1892,
      "=%": 1893,
      "COCCOCCOCCOCCN": 1894,
      "CCCCCCCCCCCCCCCCCn": 1895,
      "OSOC": 1896,
      "NCB": 1897,
      "CSOc": 1898,
      "CCCSSCCC": 1899,
      "CCNO": 1900,
      "*)(": 1901,
      "occcc": 1902,
      "COCCOCCOCCNc": 1903,
      "CCOCCSC": 1904,
      "COCCCCCOCC": 1905,
      "CSCCCCCCn": 1906,
      "CCCCCCF": 1907,
      "NCCCCCCCCCCCCC": 1908,
      "CCCCCCCOCCC": 1909,
      "OCCNCc": 1910,
      "CCCCCCCCCP": 1911,
      "OCCOCCOP": 1912,
      "SCCCNc": 1913,
      "CNCCCCC": 1914,
      "PO": 1915,
      "ClB": 1916,
      "CCSNC": 1917,
      "OCCOCCSC": 1918,
      "OCCCCCCOP": 1919,
      "CNCCCn": 1920,
      "CCCSSc": 1921,
      "COCCOCCOCCOCCn": 1922,
      "NCCCCSc": 1923,
      "NCCCCCCCNc": 1924,
      "CCNCCCN": 1925,
      "BrP": 1926,
      "CCCCOB": 1927,
      "SCCSCC": 1928,
      "ClCCCOc": 1929,
      "OPO": 1930,
      "csn": 1931,
      "ClCCOC": 1932,
      "324": 1933,
      "NOCCCO": 1934,
      "OSO": 1935,
      "NOCCCCCC": 1936,
      "OCCOCCOCCOCCOCCOCCOCCOC": 1937,
      "CCCCCOCCCC": 1938,
      "CSCCCCCCCC": 1939,
      "NONC": 1940,
      "CCCCCCCCCCCCCCCCCCCOC": 1941,
      "COCCCCCCOC": 1942,
      "CNCCl": 1943,
      "NCCOCCOCCO": 1944,
      "CCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCNC": 1945,
      "CNCCCCCCN": 1946,
      "])=[": 1947,
      "CCCCCCCCCCCCCOP": 1948,
      "OBOC": 1949,
      "NCCOCCOCCOCCn": 1950,
      "CCCCNNC": 1951,
      "COCCOS": 1952,
      "OCCOO": 1953,
      "ClCCOc": 1954,
      "CSI": 1955,
      "CCCSCCN": 1956,
      "BrCCCCC": 1957,
      "OSCc": 1958,
      "OCCCCCCCCCBr": 1959,
      "CCOCOCc": 1960,
      "119": 1961,
      "CCCCNCCCN": 1962,
      "NCCNCc": 1963,
      "NOCCON": 1964,
      "FCCCNc": 1965,
      "CCNOCC": 1966,
      "COCCCCCCc": 1967,
      "OCCOCCOCCOCCN": 1968,
      "OCCOOCCOOCCOOCCO": 1969,
      "Cp": 1970,
      "FCCCOc": 1971,
      "OCCCCCON": 1972,
      "+](*)": 1973,
      "CCCOCCCOC": 1974,
      "COCCNCc": 1975,
      "CCCCCCCCCCCCCn": 1976,
      "COCl": 1977,
      "CCSCCSc": 1978,
      "OCCOCCOCCOCCOCCOCC": 1979,
      "COCCCCCCCCCCC": 1980,
      "CSSS": 1981,
      "CSCCCCCCCCCCCC": 1982,
      "OCCCCCCCO": 1983,
      "CCCCCCCCCCCCCCCCCCCCCCOc": 1984,
      "CCCCCCCCCCCCCOCC": 1985,
      "OCCOOC": 1986,
      "CCCCCCCCCCCCCCCOCC": 1987,
      "nnno": 1988,
      "NCCNP": 1989,
      "SSSSS": 1990,
      "BCCCCC": 1991,
      "COCONC": 1992,
      "COOO": 1993,
      "CSCCCl": 1994,
      "CCNCCCc": 1995,
      "FOC": 1996,
      "CCOCSc": 1997,
      "OCCCSCCC": 1998,
      "NNCCOC": 1999,
      "CCCCCCCCCCCCCCCCCCSc": 2000,
      "SSSCCC": 2001,
      "CCCCOCCOCCC": 2002,
      "142": 2003,
      "SCCCCCCCCCCCCCCCCCC": 2004,
      "COCCCCCOC": 2005,
      "OCCCCCCON": 2006,
      "COCCCCCc": 2007,
      "CCCCSOOO": 2008,
      "CCCOCCS": 2009,
      "243": 2010,
      "CCSOOO": 2011,
      "CCOCCOCCOCCOCCOCCOC": 2012,
      "CCCCOCCOCCOCCOC": 2013,
      "NSS": 2014,
      "NCCCOCCC": 2015,
      "CCCCCCCCCCCCCCNc": 2016,
      "SSCCNC": 2017,
      "CBN": 2018,
      "OCCOCCOCCOCCCC": 2019,
      "CCNCCOC": 2020,
      "COCCOCCCCn": 2021,
      "SCCBr": 2022,
      "CCCCCCCCCCCCCCCCCN": 2023,
      "55": 2024,
      "BrN": 2025,
      "COCCCOCCNc": 2026,
      "CCCCCCOCCc": 2027,
      "PCCC": 2028,
      "nnsn": 2029,
      "NCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCC": 2030,
      "OH": 2031,
      "cnncn": 2032,
      "NCCCCCCNS": 2033,
      "POCC": 2034,
      "NCNS": 2035,
      "COCOCCCC": 2036,
      "CCCOCN": 2037,
      "CCCOCO": 2038,
      "nnnnc": 2039,
      "NCCCNCC": 2040,
      "COCCONCC": 2041,
      "FCCCC": 2042,
      "SCP": 2043,
      "CCCCCCCCCCCCCCCCCCSCC": 2044,
      "COCCOCCOCCOCCOCCOCC": 2045,
      "CCNCS": 2046,
      "CCOCCOCCOCCOCCOCCOCCNC": 2047,
      "CCCOCCOCCNC": 2048,
      "NCBr": 2049,
      "CCCOB": 2050,
      "SB": 2051,
      "CNON": 2052,
      "CCCCSCCCNC": 2053,
      "OCCOCCOS": 2054,
      "CCCCCNCC": 2055,
      "OCCOCCOCCOCCOCCOCCOCCO": 2056,
      "cccccccc": 2057,
      "CCCSCCS": 2058,
      "CCCOCCOCCOCCC": 2059,
      "PCl": 2060,
      "nnon": 2061,
      "OCOn": 2062,
      "NCCONC": 2063,
      "CCOCCON": 2064,
      "OCCCCSC": 2065,
      "NCCCOCCCNC": 2066,
      "CCCCCCOCCCC": 2067,
      "+])([": 2068,
      "CCCCCCCCOS": 2069,
      "OCCOCCOCCOCCOCCOCCOCCOCCOC": 2070,
      "CSOCC": 2071,
      "CCOSC": 2072,
      "NCCSSC": 2073,
      "CCPCC": 2074,
      "OOOOOO": 2075,
      "Fe": 2076,
      "SCCCNS": 2077,
      "OCCOCCOCCOCCOCCOCCOCCOCCO": 2078,
      "OCCCCCCCCBr": 2079,
      "CCCOCCOCCOc": 2080,
      "CCCCCCCCCCCSC": 2081,
      "OCCSCCOC": 2082,
      "CCOOc": 2083,
      "NNCl": 2084,
      "OCCOCCOCCOCc": 2085,
      "OCCCCOS": 2086,
      "CCCCCCCCCCCCCCCCSc": 2087,
      ")(=[": 2088,
      "CSSCCNC": 2089,
      "CCCCCCCCCCCCCCCCCCCCOc": 2090,
      "CCCCOCCOCCOc": 2091,
      "CCCCOCOC": 2092,
      "cH": 2093,
      "CCNCCOc": 2094,
      "NCCSSCCC": 2095,
      "OCCCCCCCCN": 2096,
      "OCCCCCCCCCCCS": 2097,
      "NOCCCN": 2098,
      "CCCCCCCCCOS": 2099,
      "CCCCCNN": 2100,
      "CCCCCCCCCCCOP": 2101,
      "CCCCOCCCc": 2102,
      "CCCCOCCS": 2103,
      "BBC": 2104,
      "CCCCCCCNS": 2105,
      "CCOCCOCCOCCOCCOCCOCC": 2106,
      "SCCOCCOCCOCC": 2107,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 2108,
      "OPC": 2109,
      "OCCCCCCCCCS": 2110,
      "OCCOCOC": 2111,
      "CCCCCCCCCCCBr": 2112,
      "BrCCOc": 2113,
      "NCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCC": 2114,
      "FCCN": 2115,
      "CCSCCSC": 2116,
      "SCCCSCC": 2117,
      "CNCCOCC": 2118,
      "CCOCCOCCS": 2119,
      "COCCOCCCCNS": 2120,
      "CCCCCCCCl": 2121,
      "CCCOCCOCCOCC": 2122,
      ")\\": 2123,
      "423": 2124,
      "106": 2125,
      "OCCOCCOCCOCCOCCOCCOc": 2126,
      "SSSSc": 2127,
      "CCCCCB": 2128,
      "CSO": 2129,
      "CCOCCCOCCC": 2130,
      "OCCOCCCCCC": 2131,
      "OCCCSCCNC": 2132,
      "COCCOCCOCCOCCOCCOCCOC": 2133,
      "BOc": 2134,
      "SOOc": 2135,
      "CCOCCSCC": 2136,
      "NCCSCCCOC": 2137,
      "OCCOCCOCCOCCOCCOCCOCCOCCOCCOCCO": 2138,
      "CCOCCOCCSC": 2139,
      "NCCCCCCCCCCCCCCC": 2140,
      "CCNOS": 2141,
      "NCCOCCOCCOCCOCCOCCOCCOCCOCCC": 2142,
      "cssc": 2143,
      "CCCCCCCCCCSCC": 2144,
      "NOCCn": 2145,
      "OCCCCCCCCCc": 2146,
      "SNN": 2147,
      "COOCCC": 2148,
      "OCONC": 2149,
      "CPCC": 2150,
      "COCCOCCOCCS": 2151,
      "\\[": 2152,
      "CNB": 2153,
      "OCCOCCSc": 2154,
      "CCCSCCO": 2155,
      "BCCCC": 2156,
      "CONN": 2157,
      "CCSNc": 2158,
      "60": 2159,
      "CCCCCCCCCCCCCCCCCOCC": 2160,
      "NCCOCCNc": 2161,
      "Pt": 2162,
      "SNCc": 2163,
      "CSCCCCCN": 2164,
      "PPP": 2165,
      "COCCBr": 2166,
      "CCSCCCc": 2167,
      "CCOCCOCCOCCn": 2168,
