{
  "version": "1.0",
  "truncation": {
    "max_length": 150,
    "strategy": "OnlyFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 150
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "special": true,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 1,
      "special": true,
      "content": "<start>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 2,
      "special": true,
      "content": "<end>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 3,
      "special": true,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFKC"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "model": {
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "#": 0,
      "(": 1,
      ")": 2,
      "+": 3,
      "-": 4,
      "1": 5,
      "2": 6,
      "3": 7,
      "4": 8,
      "5": 9,
      "=": 10,
      "B": 11,
      "C": 12,
      "F": 13,
      "H": 14,
      "N": 15,
      "O": 16,
      "S": 17,
      "[": 18,
      "]": 19,
      "c": 20,
      "i": 21,
      "l": 22,
      "n": 23,
      "o": 24,
      "r": 25,
      "s": 26,
      "Ċ": 27,
      "cc": 28,
      "CC": 29,
      "(=": 30,
      "ccc": 31,
      "+]": 32,
      "CCC": 33,
      "OC": 34,
      "NC": 35,
      "NH": 36,
      "nc": 37,
      "ccccc": 38,
      "Cc": 39,
      "Cl": 40,
      "CO": 41,
      "cccc": 42,
      ")=": 43,
      ")(": 44,
      ")[": 45,
      "Nc": 46,
      "COc": 47,
      ")(=": 48,
      "CCCC": 49,
      "-]": 50,
      "nH": 51,
      "+](": 52,
      "([": 53,
      "CN": 54,
      "cn": 55,
      "nn": 56,
      "sc": 57,
      "-])": 58,
      "CNC": 59,
      "OCC": 60,
      "CCN": 61,
      "CCCCC": 62,
      "CCOC": 63,
      "+])": 64,
      "COC": 65,
      "Oc": 66,
      "CCc": 67,
      "Br": 68,
      "Cn": 69,
      "NCC": 70,
      "SC": 71,
      "cnc": 72,
      "nnc": 73,
      "NCc": 74,
      "12": 75,
      "21": 76,
      "CS": 77,
      "ccn": 78,
      "CCn": 79,
      "CCOCC": 80,
      "+](=": 81,
      "23": 82,
      "CNc": 83,
      "NN": 84,
      "NS": 85,
      "Sc": 86,
      "SCC": 87,
      "cs": 88,
      "oc": 89,
      "CCl": 90,
      "CCNC": 91,
      "ccco": 92,
      "OCc": 93
    },
    "merges": [
      "c c",
      "C C",
      "( =",
      "cc c",
      "+ ]",
      "CC C",
      "O C",
      "N C",
      "N H",
      "n c",
      "cc ccc",
      "C c",
      "C l",
      "C O",
      "cc cc",
      ") =",
      ") (",
      ") [",
      "N c",
      "CO c",
      ") (=",
      "CC CC",
      "- ]",
      "n H",
      "+] (",
      "( [",
      "C N",
      "c n",
      "n n",
      "s c",
      "-] )",
      "C NC",
      "O CC",
      "CC N",
      "CC CCC",
      "CC OC",
      "+] )",
      "C OC",
      "O c",
      "CC c",
      "B r",
      "C n",
      "N CC",
      "S C",
      "c nc",
      "n nc",
      "NC c",
      "1 2",
      "2 1",
      "C S",
      "cc n",
      "CC n",
      "CC OCC",
      "+] (=",
      "2 3",
      "C Nc",
      "N N",
      "N S",
      "S c",
      "S CC",
      "c s",
      "o c",
      "CC l",
      "CC NC",
      "ccc o",
      "OC c"
    ]
  }
}