[Cl+2expl]
[Co+2expl]
[Ring3]
[Hoexpl]
[Ga-expl]
[#Smexpl]
[TeH2+expl]
[SiH2-expl]
[#O+expl]
[#Ybexpl]
[=BH2-expl]
[Ru+2expl]
[3Hexpl]
[=Baexpl]
[=Bi+expl]
[VHexpl]
[TaH3expl]
[Hf+4expl]
[#Os-expl]
[CH2expl]
[=Tcexpl]
[Zr-expl]
[#Ruexpl]
[C@@expl]
[19Fexpl]
[As-expl]
[Os-expl]
[Rh+2expl]
[Ru-expl]
[AlH2expl]
[=Hfexpl]
[=Agexpl]
[Ho+3expl]
[PoH2expl]
[PH3-expl]
[Br]
[Ring2]
[#S+expl]
[NH-expl]
[=Ti+expl]
[Hg+expl]
[=Niexpl]
[\Cl]
[BiHexpl]
[=Smexpl]
[Br+2expl]
[YH2expl]
[Mo+2expl]
[#N+expl]
[S-expl]
[=As+expl]
[TlH3expl]
[Nbexpl]
[ThH4expl]
[Pd-2expl]
[/O]
[Ir-3expl]
[Dyexpl]
[=SbH2expl]
[CH-expl]
[=Si+expl]
[=Gdexpl]
[=Hgexpl]
[GeHexpl]
[=P+expl]
[Dy+3expl]
[Os+4expl]
[#Osexpl]
[=SeHexpl]
[#Coexpl]
[Ring1]
[Pt-expl]
[=Alexpl]
[Yb+3expl]
[OH2+expl]
[=Hf+2expl]
[#Biexpl]
[=Pr+expl]
[=GeHexpl]
[NH2+expl]
[BH2-expl]
[GeH3expl]
[Frexpl]
[Pd+expl]
[Sn-expl]
[Ni+expl]
[Re-2expl]
[Tl+3expl]
[#Snexpl]
[Acexpl]
[Ceexpl]
[=Seexpl]
[ClH+2expl]
[Expl/Ring1]
[SH-expl]
[#TaHexpl]
[=SH-expl]
[Oexpl]
[Cu-2expl]
[Zn-expl]
[=Feexpl]
[Lu+3expl]
[Cr+expl]
[V+2expl]
[=C]
[/Br]
[/I]
[Auexpl]
[U+2expl]
[=Tmexpl]
[Pd-expl]
[Ru+expl]
[SeH2expl]
[=SnH2expl]
[18Fexpl]
[ReHexpl]
[#SiHexpl]
[=Taexpl]
[#B]
[\I]
[=TaHexpl]
[ClH+expl]
[=Reexpl]
[Branch3_3]
[Inexpl]
[#S-expl]
[Prexpl]
[=Rhexpl]
[=Moexpl]
[#Tlexpl]
[=YHexpl]
[PtH+expl]
[\O-expl]
[Ir-2expl]
[#S]
[C@expl]
[Ta-expl]
[Irexpl]
[#Laexpl]
[NH3+expl]
[Co-3expl]
[Cu+expl]
[PH3expl]
[Sbexpl]
[Pt+4expl]
[=B]
[Vexpl]
[=W-expl]
[Noexpl]
[#Wexpl]
[PH2expl]
[I+expl]
[=Crexpl]
[#Ru-expl]
[BHexpl]
[C@@Hexpl]
[=Dyexpl]
[=TeH2expl]
[Asexpl]
[=PH2expl]
[S@expl]
[Er+3expl]
[#I]
[N-expl]
[Pt-2expl]
[#SH-expl]
[teexpl]
[=Npexpl]
[I-expl]
[=Thexpl]
[AtHexpl]
[#Prexpl]
[#Os-2expl]
[Th+4expl]
[Gdexpl]
[=Ruexpl]
[=B-expl]
[#Reexpl]
[RuH2expl]
[\N]
[Bkexpl]
[Au+3expl]
[=Irexpl]
[=Tlexpl]
[Amexpl]
[Expl/Ring2]
[=WHexpl]
[SH2+expl]
[IH+expl]
[Rh-2expl]
[end]
[=VHexpl]
[Expl#Ring1]
[#Ir+expl]
[Tb+3expl]
[Cr+2expl]
[S+expl]
[Cr-expl]
[=Ru+expl]
[#Euexpl]
[Mg+expl]
[ZrHexpl]
[=Tc+4expl]
[=S-expl]
[Ptexpl]
[=Tiexpl]
[Sn+2expl]
[=Laexpl]
[CHexpl]
[\O]
[Kexpl]
[#N]
[P@expl]
[N]
[Feexpl]
[Uexpl]
[#Niexpl]
[Srexpl]
[Cr-3expl]
[Al+expl]
[U+3expl]
[InHexpl]
[SnH3expl]
[InH2expl]
[Luexpl]
[Branch2_3]
[#Teexpl]
[=Luexpl]
[11CH2expl]
[P@@expl]
[17Fexpl]
[P]
[=Mo+4expl]
[Tmexpl]
[Cd-2expl]
[#Feexpl]
[\C]
[Ni-expl]
[Rh-expl]
[Re-expl]
[Branch2_2]
[=Tc+5expl]
[TaHexpl]
[=CHexpl]
[PH2-expl]
[IrHexpl]
[#Tcexpl]
[=Coexpl]
[Cl]
[11CH3expl]
[AsH4expl]
[#11Cexpl]
[=ReHexpl]
[Nb-2expl]
[/C@@expl]
[OsHexpl]
[=S+expl]
[123Iexpl]
[Ti+2expl]
[=Inexpl]
[=Wexpl]
[ThH2expl]
[Liexpl]
[Sb-expl]
[UH2expl]
[Zr-3expl]
[=AsHexpl]
[=Os+2expl]
[AuHexpl]
[Branch3_1]
[Agexpl]
[O+expl]
[Niexpl]
[Tc+expl]
[SH2expl]
[TlHexpl]
[Co+expl]
[pad]
[ReH4expl]
[Rnexpl]
[=Pdexpl]
[YHexpl]
[TeH2expl]
[=P]
[Fe-4expl]
[CH2+expl]
[I+3expl]
[=Uexpl]
[=Osexpl]
[#Uexpl]
[#C+expl]
[Os-3expl]
[AlHexpl]
[Os+2expl]
[\C@Hexpl]
[/NHexpl]
[=C-expl]
[ReH7expl]
[Gd+3expl]
[\C@@expl]
[Cd-expl]
[/S]
[WH3expl]
[Ruexpl]
[SH+expl]
[RhHexpl]
[YbH2expl]
[C]
[Tl+expl]
[Se-expl]
[=Auexpl]
[Os+6expl]
[=Snexpl]
[Au-expl]
[#Fe+expl]
[=NH+expl]
[Mgexpl]
[Siexpl]
[GeH2expl]
[/F]
[SmH3expl]
[Bhexpl]
[ReH2expl]
[Seexpl]
[Ba+expl]
[/Cl]
[Znexpl]
[/C@expl]
[Rh+expl]
[TeHexpl]
[IHexpl]
[=Vexpl]
[OsH2expl]
[Bi+2expl]
[#Geexpl]
[=FeHexpl]
[Fe-3expl]
[/S+expl]
[#C-expl]
[Teexpl]
[=PHexpl]
[Mn-2expl]
[Ir+2expl]
[B]
[PbH3expl]
[#Mnexpl]
[=BH-expl]
[=Mgexpl]
[Baexpl]
[Ta-2expl]
[UHexpl]
[=SiH2expl]
[Sn+expl]
[Si+2expl]
[Hsexpl]
[=SiHexpl]
[Mtexpl]
[Os+expl]
[Rh-3expl]
[Se+expl]
[=U+2expl]
[=Geexpl]
[O]
[#Tmexpl]
[Pb+2expl]
[Zrexpl]
[IH2expl]
[#Taexpl]
[WHexpl]
[Tcexpl]
[\NHexpl]
[Si-expl]
[Al-3expl]
[Ir+expl]
[=UHexpl]
[GaHexpl]
[Csexpl]
[=Asexpl]
[=IrHexpl]
[PH2+expl]
[Au+expl]
[#Luexpl]
[Sn+3expl]
[F]
[=Biexpl]
[Expl#Ring2]
[Ybexpl]
[#Yexpl]
[=Ti+2expl]
[C+expl]
[S@@expl]
[35Sexpl]
[Os+8expl]
[Branch1_1]
[#C]
[\C@expl]
[#Thexpl]
[PHexpl]
[Branch1_2]
[=SH+expl]
[In-expl]
[#Gdexpl]
[=C+expl]
[PH4expl]
[SbHexpl]
[Xeexpl]
[=Mnexpl]
[Smexpl]
[P+expl]
[BiH2expl]
[Eu+2expl]
[=SHexpl]
[\N+expl]
[Zn-2expl]
[=Znexpl]
[Co-2expl]
[SiH2expl]
[#Ceexpl]
[Si+3expl]
[UH3expl]
[#Moexpl]
[VH2expl]
[Npexpl]
[Gd+2expl]
[Mo-2expl]
[C@Hexpl]
[SbH4expl]
[SeH5expl]
[#WHexpl]
[#Asexpl]
[Zn+expl]
[=PbH2expl]
[#SHexpl]
[=Euexpl]
[=SbHexpl]
[=N+expl]
[Fe-expl]
[Br+3expl]
[Tb+4expl]
[#PbHexpl]
[Ti-2expl]
[AsH2expl]
[Rbexpl]
[Branch3_2]
[=Pbexpl]
[=I]
[PbH4expl]
[=Fe+expl]
[=I-expl]
[Cu-expl]
[Zr+2expl]
[Si+expl]
[Crexpl]
[Bi+expl]
[=Ybexpl]
[Mo+expl]
[#Seexpl]
[=Prexpl]
[\S]
[PH6expl]
[Reexpl]
[TlH2expl]
[Dbexpl]
[/C]
[Nb-expl]
[=Zr+2expl]
[=Gaexpl]
[Cf+3expl]
[=Teexpl]
[CuHexpl]
[Ta+2expl]
[=Sbexpl]
[2Hexpl]
[GaH2expl]
[Expl=Ring2]
[\F]
[=Hoexpl]
[Branch1_3]
[=Ndexpl]
[=Cdexpl]
[#Mo+expl]
[Ru+3expl]
[Erexpl]
[=Erexpl]
[Expl=Ring1]
[=O+expl]
[=AsH2expl]
[=GeH2expl]
[Yexpl]
[EuH3expl]
[C-expl]
[IrH3expl]
[Laexpl]
[/P]
[IrH2expl]
[Caexpl]
[PtHexpl]
[=Zrexpl]
[Th+2expl]
[#Tc+expl]
[Cuexpl]
[Zr-2expl]
[=V+2expl]
[TaH2expl]
[Eu+3expl]
[W+2expl]
[Fe-2expl]
[IH4expl]
[WH2expl]
[Hf+2expl]
[SHexpl]
[/C@Hexpl]
[SbH2expl]
[Os-2expl]
[Ti+3expl]
[Al-expl]
[#Hf+expl]
[PtH2expl]
[#Inexpl]
[unk]
[GdH2expl]
[#Erexpl]
[Cmexpl]
[/N+expl]
[AlH-expl]
[Ta+5expl]
[N@@+expl]
[#Os+2expl]
[Mn+expl]
[IH+3expl]
[Pmexpl]
[Ru-2expl]
[#AsHexpl]
[/123Iexpl]
[Poexpl]
[Ndexpl]
[#Dyexpl]
[O-expl]
[Hg-2expl]
[Sm+3expl]
[#P+expl]
[Coexpl]
[NH+expl]
[Os+7expl]
[XeHexpl]
[=SnHexpl]
[/13CHexpl]
[=O]
[#Sbexpl]
[\C@@Hexpl]
[Tbexpl]
[Wexpl]
[Moexpl]
[Naexpl]
[=IH2expl]
[=Se+expl]
[NiHexpl]
[AsHexpl]
[=IH3expl]
[=N]
[Cdexpl]
[Snexpl]
[=Cuexpl]
[Paexpl]
[=Ceexpl]
[SnH2-expl]
[start]
[=Th+2expl]
[=Ptexpl]
[#P]
[SH4expl]
[SiH3expl]
[PbH2expl]
[PtH3expl]
[I]
[Hg+2expl]
[#Crexpl]
[Thexpl]
[Ni-2expl]
[125Iexpl]
[Cl+3expl]
[I+2expl]
[=S]
[#Pdexpl]
[=TeHexpl]
[Tiexpl]
[AsH3expl]
[13Cexpl]
[Hg-expl]
[\P]
[SeHexpl]
[Cl+expl]
[Mnexpl]
[AlH2-expl]
[N+expl]
[=NH2+expl]
[PbHexpl]
[Biexpl]
[Ni+2expl]
[Euexpl]
[PH-expl]
[Fmexpl]
[=Si-expl]
[Ti+expl]
[Ru-3expl]
[=Mo+2expl]
[Br+expl]
[#Tbexpl]
[SiH-expl]
[=S@@expl]
[B-expl]
[Expl\Ring2]
[Al+2expl]
[Atexpl]
[Scexpl]
[76Brexpl]
[BH3-expl]
[=SH2expl]
[Hgexpl]
[14CH3expl]
[Ag-expl]
[=Tbexpl]
[/O-expl]
[=Siexpl]
[=Srexpl]
[HgHexpl]
[=Tc+3expl]
[=Tc+2expl]
[SnH2expl]
[=OH+expl]
[=Sb+expl]
[Sb+expl]
[U+4expl]
[Yb+2expl]
[=Nbexpl]
[Pbexpl]
[Geexpl]
[Ir+3expl]
[Tlexpl]
[Mdexpl]
[Osexpl]
[=SH3expl]
[Pt+2expl]
[Zr-4expl]
[=CH-expl]
[#W-expl]
[Puexpl]
[Cr-2expl]
[=N-expl]
[=P-expl]
[Ni-3expl]
[#Siexpl]
[IrH+2expl]
[\Br]
[#Zrexpl]
[=PH+expl]
[IH3expl]
[Bi+3expl]
[#Ndexpl]
[Tm+3expl]
[Raexpl]
[Expl=Ring3]
[Cf+2expl]
[BiH3expl]
[/N]
[Gaexpl]
[=AsH3expl]
[PoHexpl]
[Branch2_1]
[PH+expl]
[Expl\Ring1]
[S]
[=Yexpl]
[IH2+3expl]
[=PH3expl]
[TeH3expl]
[#Hoexpl]
[CH2-expl]
[Pdexpl]
[W+expl]
[=SH4expl]
[Fe+expl]
[Al-2expl]
[CH+expl]
[Alexpl]
[SnHexpl]
[P-expl]
[IrH4expl]
[#W+expl]
[MnHexpl]
[PdHexpl]
[#Pbexpl]
[/C@@Hexpl]
[As+expl]
[SiHexpl]
[SbH+expl]
[NHexpl]
[Sgexpl]
[#MoHexpl]
[=RuH2expl]
[Taexpl]
[Te+expl]
[BH-expl]
[Cfexpl]
[OH+expl]
[Esexpl]
[Hfexpl]
[#Ta+expl]
[Pt+expl]
[#Nbexpl]
[Rhexpl]
[F+expl]
[Rfexpl]
[RuHexpl]
[Lrexpl]
